#Область ПрограммныйИнтерфейс

Процедура КонтрольОбновленияПовторноИспользуемыхЗначений() Экспорт

	ПараметрыРаботыКлиента 	= СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
	Значение 				= УправлениеITОтделом8УФ.ПризнакСбросаПовторноИспользуемыхЗначений();
	Если Значение <> ПараметрыРаботыКлиента.ПризнакСбросаПовторноИспользуемыхЗначений Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	ПодключитьОбработчикОжидания("КонтрольОбновленияПовторноИспользуемыхЗначений", 60, Истина);

КонецПроцедуры

#КонецОбласти