
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ПометкаУдаления", Ложь);		
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Пользователь",
		Пользователи.ТекущийПользователь());
		
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Выполнено", Ложь);
		
КонецПроцедуры

#КонецОбласти