
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПредопределенные(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаЗаполнитьПредопределенные", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, 
		НСтр("ru = 'Предопределенные элементы справочника будут приведены к настройкам по умолчанию. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВопросаЗаполнитьПредопределенные(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьПредопределенныеНаСервере();
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредопределенныеНаСервере()
	
	Справочники.Метрики.ЗаполнитьПриПервоначальномЗаполнении();
	
КонецПроцедуры

#КонецОбласти
