
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПервичныйДокумент") Тогда
		Запись.ПервичныйДокумент 				= Параметры.ПервичныйДокумент;
		Элементы.ПервичныйДокумент.Видимость	= Ложь;
		Элементы.Объект.Видимость				= Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ПредметДокумента") Тогда
		Запись.Объект							= Параметры.ПредметДокумента;
		Элементы.ПервичныйДокумент.Видимость	= Истина;
		Элементы.Объект.Видимость				= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Пользователь) Тогда
		ТекущийОбъект.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ПервичныеДокументы_ДобавленаСвязьДокумента");
	
КонецПроцедуры

#КонецОбласти