#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПотенциальныеКлиенты") Тогда
		
		Наименование 		= ДанныеЗаполнения.Наименование;
		Комментарий			= ДанныеЗаполнения.Комментарий;
		
		Для Каждого Строки Из ДанныеЗаполнения.КонтактнаяИнформация Цикл
			Если Строки.Вид = Справочники.ВидыКонтактнойИнформации.EmailПотенциальногоКлиента Тогда
				НоваяСтрока = КонтактнаяИнформация.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строки);
				НоваяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			ИначеЕсли Строки.Вид = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонПотенциальногоКлиента Тогда
				НоваяСтрока = КонтактнаяИнформация.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строки);
				НоваяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
			КонецЕсли;			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли