
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПеренестиВсеКомментарии = Истина;
	ПеренестиОписаниеЗаданияВКомментарий = Истина;
	ПометитьНаУдалениеЗадание = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Если НЕ ЗначениеЗаполнено(Задание) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите задание'"), , "Задание");
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Задание", Задание);
	Структура.Вставить("ПеренестиОписаниеЗаданияВКомментарий", ПеренестиОписаниеЗаданияВКомментарий);
	Структура.Вставить("ПометитьНаУдалениеЗадание", ПометитьНаУдалениеЗадание);
	
	Закрыть(Структура);
	
КонецПроцедуры

#КонецОбласти
