
#Область ПрограммныйИнтерфейс

Процедура УстановитьПроцентГотовности(Знач Сообщение, Знач Процент) Экспорт
	
	МенеджерЗаписиГотовности = РегистрыСведений.СтепеньГотовностиСообщенийОбменМобильноеПриложение.СоздатьМенеджерЗаписи();
	МенеджерЗаписиГотовности.Сообщение         = Сообщение;
	МенеджерЗаписиГотовности.ПроцентГотовности = Процент;
	МенеджерЗаписиГотовности.Записать();
	
КонецПроцедуры

Функция ПолучитьПроцентГотовностиСообщения(Знач Сообщение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтепеньГотовностиСообщенийОбменМобильноеПриложение.ПроцентГотовности
		|ИЗ
		|	РегистрСведений.СтепеньГотовностиСообщенийОбменМобильноеПриложение КАК СтепеньГотовностиСообщенийОбменМобильноеПриложение
		|ГДЕ
		|	СтепеньГотовностиСообщенийОбменМобильноеПриложение.Сообщение = &Сообщение";
	Запрос.УстановитьПараметр("Сообщение", Сообщение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентГотовности;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти