
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ПредметСтатьи", ПараметрКоманды);
	ПараметрыФормы.Вставить("ВсеПредметы",      ПолучитьМассивПредметов(ПараметрКоманды));	
	ОткрытьФорму("РегистрСведений.СвязьСтатейБазыЗнаний.Форма.ФормаСпискаСтатейПоПредмету", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьМассивПредметов(ПараметрКоманды)
	
	МассивПредметы = Новый Массив;
	ОбъектСсылка   = ПараметрКоманды;
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.МестаХранения") Тогда
		ДобавитьВМассив(МассивПредметы, ОбъектСсылка);
		ДобавитьВМассив(МассивПредметы, ОбъектСсылка.Организация);
		ДобавитьВМассив(МассивПредметы, ОбъектСсылка.Подразделение);
		ДобавитьВМассив(МассивПредметы, ОбъектСсылка.Местоположение);
	КонецЕсли;			

	Возврат МассивПредметы;
	
КонецФункции

&НаСервере
Процедура ДобавитьВМассив(Массив, Значение)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Массив.Добавить(Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

