
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БазовыеЦвета 	= ЗначениеИзСтрокиВнутр(ПолучитьОбщийМакет("БазовыеЦвета").ПолучитьТекст());
	Автошрифт		= Новый Шрифт("Arial", 10);	
	ОбновитьСписокДоступныхРолейТекущегоПользователя();
	ЗаполнитьСписокВыбораВидВиджета();
	
	// Если это демо, то обработчик не доступен.
	Если УправлениеITОтделом8УФ.ЭтоДемоСерверОграниченныеПрава() Тогда
		Элементы.КодОбработчика.ТолькоПросмотр = Истина;
	КонецЕсли;	
		
	Если Объект.Ссылка.Пустая() Тогда				
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Копирование элемента.
			Объект.Наименование 	= "";			
			Объект.Заголовок		= "";
			Объект.Подсказка		= "";
			
		Иначе			
			КодОбработчика = 
				"// Указанный код будет выполнен &НаСервере.
				|// Произвольный код, в котором могут быть указаны параметры открываемой формы
				|// или вызван экспортный метод серверного модуля.
				|// Например, для открытия формы нового задания с указанным процессом, может быть указан следующий код: 
				|// ЗначенияЗаполнения = Новый Структура;
				|// ЗначенияЗаполнения.Вставить(""Процесс"", ПредопределенноеЗначение(""Справочник.Процессы.ЖалобаПользователя""));
				|// ПараметрыФормы.Вставить(""ЗначенияЗаполнения"", ЗначенияЗаполнения);";
			
			Объект.Видимость							= Истина;
			Объект.Доступность							= Истина;
			Объект.ТолькоПросмотр						= Ложь;
			Объект.ВажностьПриОтображении				= Перечисления.ВажностьПриОтображении.Авто;
			Объект.ОтображениеПодсказки					= Перечисления.ОтображениеПодсказки.Авто;
			Объект.ОтображатьЗаголовок					= Истина;
			РедактируемыйЦветТекстаЗаголовка 			= WebЦвета.Черный;
			РедактируемыйЦветТекста 					= WebЦвета.Черный;
			РедактируемыйЦветФона 						= WebЦвета.Белый;
			РедактируемыйШрифтЗаголовка					= Автошрифт;
			РедактируемыйШрифт							= Автошрифт;
			РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения = WebЦвета.Белый;
			Объект.Ширина								= 0;
			Объект.Высота								= 0;
			РедактируемыйЦветРамки						= WebЦвета.НейтральноСерый;
			Объект.ТипРамки								= Перечисления.ТипРамки.Нет;
			Объект.ТолщинаРамки							= 0;
			Объект.ГоризонтальноеПоложениеВГруппе 		= Перечисления.ВидыГоризонтальногоПоложенияЭлементов.Авто;
			Объект.ВертикальноеПоложениеВГруппе			= Перечисления.ВидыВертикальногоПоложенияЭлементов.Авто;		
			Объект.РастягиватьПоГоризонтали				= Ложь;
			Объект.РастягиватьПоВертикали				= Ложь;
			Объект.РастягиватьПоГоризонталиВариант		= Перечисления.РастягиваниеЭлементаФормы.Авто;
			Объект.РастягиватьПоВертикалиВариант		= Перечисления.РастягиваниеЭлементаФормы.Авто;
			Объект.Группировка							= Перечисления.ВидыГруппировокЭлементовФормы.ГоризонтальнаяЕслиВозможно;
			Объект.ВидДекорации							= Перечисления.ВидыДекораций.Надпись;		
			Объект.ОтображениеСтраниц					= Перечисления.ОтображениеСтраниц.ЗакладкиСверху;
			Объект.ГоризонтальныйИнтервал				= Перечисления.ИнтервалМеждуЭлементамиФормы.Авто;
			Объект.ВертикальныйИнтервал					= Перечисления.ИнтервалМеждуЭлементамиФормы.Авто;
			Объект.ВыравниваниеЭлементовИЗаголовков 	= Перечисления.ВыравниваниеЭлементовИЗаголовков.Авто;
			Объект.ГоризонтальноеПоложениеПодчиненных	= Перечисления.ВидыГоризонтальногоПоложенияЭлементов.Авто;
			Объект.ВертикальноеПоложениеПодчиненных 	= Перечисления.ВидыВертикальногоПоложенияЭлементов.Авто;
			Объект.ВертикальнаяПрокруткаПриСжатии		= Ложь;
			Объект.Гиперссылка							= Ложь;
			Объект.АвтоМаксимальнаяШирина				= Ложь;
			Объект.АвтоМаксимальнаяВысота				= Ложь;
			Объект.ВысотаЗаголовка						= 0;
			Объект.ГоризонтальноеПоложение				= Перечисления.ВидыГоризонтальногоПоложенияЭлементов.Лево;
			Объект.ВертикальноеПоложение				= Перечисления.ВидыВертикальногоПоложенияЭлементов.Авто;
			Объект.Масштабировать						= Ложь;
			Объект.РазмерКартинки						= Перечисления.ВидыРазмеровКартинки.РеальныйРазмер;
			Объект.Объединенная							= Истина;
			Объект.Поведение							= Перечисления.ВидыПоведенияГруппыЭлементов.Обычное;
			Объект.Отображение							= Перечисления.ВидыОтображенияГруппыЭлементов.СлабоеВыделение;
			Объект.СквозноеВыравнивание					= Перечисления.ВидыИспользованияСквозногоВыравнивания.Авто;
			Объект.Свернута								= Ложь;
			Объект.ОтображениеУправления				= Перечисления.ВидыОтображенияУправленияГруппыЭлементов.ГиперссылкаЗаголовка;
			Объект.ОтображатьОтступСлева				= Истина;
			Объект.ВидФормы								= Перечисления.ВидФормы.ФормаОбъекта;
			Объект.ВидОтображенияКнопки					= Перечисления.ВидОтображенияКнопки.Авто;
			Объект.ПериодАвтообновленияМетрики			= 10;
			Объект.ПоложениеЗаголовка					= Перечисления.ПоложенияЗаголовкаЭлементаФормы.Нет;
			
			Если Объект.Ссылка.Пустая() Тогда
				Объект.ВидОбработчика = Перечисления.ВидыОбработчиковВиджетов.ОткрытьФорму;
			КонецЕсли;
			
			Если Параметры.Свойство("Родитель") Тогда
				Объект.Родитель = Параметры.Родитель;
			КонецЕсли;	
			
			Если Параметры.Свойство("Владелец") Тогда
				Объект.Владелец = Параметры.Владелец;
			КонецЕсли;	
			
			Если Параметры.Свойство("ВидВиджета") Тогда
				ВидВиджетаСтрока = Параметры.ВидВиджета;
				Если ВидВиджетаСтрока = "ГруппаОбычнаяГруппа" Тогда
					Объект.Вид = Перечисления.ВидыВиджетов.ОбычнаяГруппа;
					Объект.Наименование = НСтр("ru = 'Группа'");
					Объект.Заголовок 	= НСтр("ru = 'Группа'");
					Объект.Подсказка	= НСтр("ru = 'Группа'");
					Объект.Отображение	= Перечисления.ВидыОтображенияГруппыЭлементов.СлабоеВыделение;
					
				ИначеЕсли ВидВиджетаСтрока = "ГруппаОбычнаяГруппаБезОтображения" Тогда	
					Объект.Вид = Перечисления.ВидыВиджетов.ОбычнаяГруппа;
					Объект.Наименование = НСтр("ru = 'Группа'");
					Объект.Заголовок 	= НСтр("ru = 'Группа'");
					Объект.Подсказка	= НСтр("ru = 'Группа'");
					Объект.Отображение	= Перечисления.ВидыОтображенияГруппыЭлементов.Нет;
					Объект.ОтображатьЗаголовок = Ложь;
					
				ИначеЕсли ВидВиджетаСтрока = НСтр("ru = 'ГруппаСтраницы'") Тогда
					Объект.Вид = Перечисления.ВидыВиджетов.Страницы;
					Объект.Наименование = НСтр("ru = 'Группа Страницы'");
					Объект.Заголовок 	= НСтр("ru = 'Группа Страницы'");
					Объект.Подсказка	= НСтр("ru = 'Группа Страницы'");
					
				ИначеЕсли ВидВиджетаСтрока = "ГруппаСтраница" Тогда
					Объект.Вид = Перечисления.ВидыВиджетов.Страница;
					Объект.Наименование = НСтр("ru = 'Группа Страница'");
					Объект.Заголовок 	= НСтр("ru = 'Группа Страница'");
					Объект.Подсказка	= НСтр("ru = 'Группа Страница'");
					
				ИначеЕсли ВидВиджетаСтрока = "ДекорацияНадпись" Тогда
					Объект.Вид 			= Перечисления.ВидыВиджетов.Декорация;
					Объект.ВидДекорации = Перечисления.ВидыДекораций.Надпись;
					Объект.Наименование = НСтр("ru = 'Декорация Надпись'");
					Объект.Заголовок 	= НСтр("ru = 'Декорация Надпись'");
					Объект.Подсказка	= НСтр("ru = 'Декорация Надпись'");
					
				ИначеЕсли ВидВиджетаСтрока = "ДекорацияКартинка" Тогда
					Объект.Вид 			= Перечисления.ВидыВиджетов.Декорация;
					Объект.ВидДекорации = Перечисления.ВидыДекораций.Картинка;
					Объект.Наименование = НСтр("ru = 'Декорация Картинка'");
					Объект.Заголовок 	= НСтр("ru = 'Декорация Картинка'");
					Объект.Подсказка	= НСтр("ru = 'Декорация Картинка'");
					
				ИначеЕсли ВидВиджетаСтрока = "МетрикаНадпись" Тогда
					Объект.Вид 					= Перечисления.ВидыВиджетов.Метрика;
					Объект.ВидОтображенияМетрики= Перечисления.ВидыОтображенияМетрик.Надпись;
					Объект.Наименование = НСтр("ru = 'Метрика (Надпись)'");
					Объект.Заголовок 	= НСтр("ru = 'Метрика (Надпись)'");
					Объект.Подсказка	= НСтр("ru = 'Метрика (Надпись)'");
					Объект.Ширина				= 8;
					Объект.Высота				= 0;
					
				ИначеЕсли ВидВиджетаСтрока = "МетрикаНадписьСУсловнымОформлением" Тогда
					Объект.Вид 					= Перечисления.ВидыВиджетов.Метрика;
					Объект.ВидОтображенияМетрики= Перечисления.ВидыОтображенияМетрик.НадписьСУсловнымОформлением;
					Объект.Наименование = НСтр("ru = 'Метрика (Надпись с оформлением)'");
					Объект.Заголовок 	= НСтр("ru = 'Метрика (Надпись с оформлением)'");
					Объект.Подсказка	= НСтр("ru = 'Метрика (Надпись с оформлением)'");
					Объект.Ширина				= 8;
					Объект.Высота				= 0;
					
				ИначеЕсли ВидВиджетаСтрока = "МетрикаДиаграмма" Тогда
					Объект.Вид 					= Перечисления.ВидыВиджетов.Метрика;
					Объект.ВидОтображенияМетрики= Перечисления.ВидыОтображенияМетрик.Диаграмма;
					Объект.Наименование = НСтр("ru = 'Метрика (Диаграмма)'");
					Объект.Заголовок 	= НСтр("ru = 'Метрика (Диаграмма)'");
					Объект.Подсказка	= НСтр("ru = 'Метрика (Диаграмма)'");
					Объект.Ширина				= 50;
					Объект.Высота				= 7;
	
				ИначеЕсли ВидВиджетаСтрока = "Кнопка" Тогда
					Объект.Вид 			= Перечисления.ВидыВиджетов.Кнопка;					
					Объект.Наименование = НСтр("ru = 'Кнопка'");
					Объект.Заголовок 	= НСтр("ru = 'Кнопка'");
					Объект.Подсказка	= НСтр("ru = 'Кнопка'");
					
				КонецЕсли;
			
			Иначе
			
				Объект.Вид = Перечисления.ВидыВиджетов.ОбычнаяГруппа;
				Объект.Наименование = НСтр("ru = 'Группа'");
				Объект.Заголовок 	= НСтр("ru = 'Группа'");
				Объект.Подсказка	= НСтр("ru = 'Группа'");
				Объект.Отображение	= Перечисления.ВидыОтображенияГруппыЭлементов.СлабоеВыделение;
			
			КонецЕсли;		
		КонецЕсли;
		
	Иначе
		
		Попытка
			РедактируемыйЦветФона 			= ?(ПустаяСтрока(Объект.ЦветФона), Новый Цвет(),РаботаСЦветомКлиентСервер.HexВЦвет(Объект.ЦветФона));
			РедактируемыйЦветТекста 		= РаботаСЦветомКлиентСервер.HexВЦвет(Объект.ЦветТекста);
			РедактируемыйЦветТекстаЗаголовка= РаботаСЦветомКлиентСервер.HexВЦвет(Объект.ЦветТекстаЗаголовка);
			РедактируемыйЦветРамки			= РаботаСЦветомКлиентСервер.HexВЦвет(Объект.ЦветРамки);
			РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения = РаботаСЦветомКлиентСервер.HexВЦвет(Объект.ЦветФонаЗаголовкаСкрытогоОтображения);
		Исключение
			РедактируемыйЦветФона 			= WebЦвета.Белый;
			РедактируемыйЦветТекста 		= WebЦвета.Черный;
			РедактируемыйЦветТекстаЗаголовка= WebЦвета.Черный;
			РедактируемыйЦветРамки			= WebЦвета.НейтральноСерый;
			РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения = WebЦвета.Белый;
		КонецПопытки;
		
		Попытка
			РедактируемыйШрифтЗаголовка 	= Объект.Ссылка.ШрифтЗаголовка.Получить();			
		Исключение			
			РедактируемыйШрифтЗаголовка 	= Автошрифт;
		КонецПопытки;
		
		Попытка
			РедактируемыйШрифт 				= Объект.Ссылка.Шрифт.Получить();			
		Исключение			
			РедактируемыйШрифт 				= Автошрифт;
		КонецПопытки;		
		
	КонецЕсли;	
	
	ОбновитьИзображение();
	ЗаполнитьОбъектыДляОткрытияФормы();	
	УстановитьВидимостьДоступность();	
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если РедактируемыйЦветФона.Вид = ВидЦвета.АвтоЦвет Тогда
		ТекущийОбъект.ЦветФона   			= "";
	Иначе
		ТекущийОбъект.ЦветФона   			= РаботаСЦветомКлиентСервер.ЦветВHex(РедактируемыйЦветФона);
	КонецЕсли;
	ТекущийОбъект.ЦветТекста 			= РаботаСЦветомКлиентСервер.ЦветВHex(РедактируемыйЦветТекста);
	ТекущийОбъект.ЦветТекстаЗаголовка 	= РаботаСЦветомКлиентСервер.ЦветВHex(РедактируемыйЦветТекстаЗаголовка);
	ТекущийОбъект.ЦветРамки			 	= РаботаСЦветомКлиентСервер.ЦветВHex(РедактируемыйЦветРамки);
	ТекущийОбъект.ЦветФонаЗаголовкаСкрытогоОтображения = РаботаСЦветомКлиентСервер.ЦветВHex(РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения);
	ТекущийОбъект.ШрифтЗаголовка		= Новый ХранилищеЗначения(РедактируемыйШрифтЗаголовка, Новый СжатиеДанных());
	ТекущийОбъект.Шрифт					= Новый ХранилищеЗначения(РедактируемыйШрифт, Новый СжатиеДанных());
	ТекущийОбъект.КодОбработчика		= Новый ХранилищеЗначения(КодОбработчика, Новый СжатиеДанных());
	ТекущийОбъект.КодОбработчикаЗначенияМетрик	= Новый ХранилищеЗначения(КодОбработчикаЗначенияМетрик, Новый СжатиеДанных());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Виджет_Запись", Новый Структура("РабочийСтолСсылка", Объект.Владелец), Объект.Ссылка);	
	ЗаполнитьОбразец();	

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	Если Объект.Вид = Перечисления.ВидыВиджетов.Кнопка Тогда
		Если Объект.ВидОбработчика = Перечисления.ВидыОбработчиковВиджетов.ОткрытьФорму Тогда
			Если ПустаяСтрока(Объект.ИмяОбъектаФормы) Тогда
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Заполнение",
				"Имя объекта");
				ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				,
				"Объект.ИмяОбъектаФормы",
				,
				Отказ);
			КонецЕсли;
			
		ИначеЕсли Объект.ВидОбработчика = Перечисления.ВидыОбработчиковВиджетов.ПроизвольныйАлгоритм Тогда					
			Если ПустаяСтрока(КодОбработчика) Тогда
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Заполнение",
				"Произвольный алгоритм");
				ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				,
				"КодОбработчика",
				,
				Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КодОбработчика 				 = ТекущийОбъект.КодОбработчика.Получить();
	КодОбработчикаЗначенияМетрик = ТекущийОбъект.КодОбработчикаЗначенияМетрик.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	                  
	Если НЕ ЗначениеЗаполнено(Объект.Вид) Тогда
		Возврат;
	КонецЕсли;	
		
	ВидСтрокой = Строка(Объект.Вид);
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = ВидСтрокой;
	КонецЕсли;
	Если ПустаяСтрока(Объект.Заголовок) Тогда
		Объект.Заголовок = ВидСтрокой;
	КонецЕсли;
    Если ПустаяСтрока(Объект.ЗаголовокСвернутогоОтображения) Тогда
		Объект.ЗаголовокСвернутогоОтображения = ВидСтрокой;
	КонецЕсли;
	Если ПустаяСтрока(Объект.Подсказка) Тогда
		Объект.Подсказка = ВидСтрокой;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДекорацииПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоведениеПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаЗаголовкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("РедактируемыйЦветТекстаЗаголовкаНачалоВыбораЗавершение", ЭтотОбъект), 
		БазовыеЦвета, 
		Элемент, 
		БазовыеЦвета.НайтиПоЗначению(РедактируемыйЦветТекстаЗаголовка));

КонецПроцедуры
	
&НаКлиенте
Процедура РедактируемыйЦветТекстаЗаголовкаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Результат = ВыбранныйЭлемент;
    Если Результат <> Неопределено Тогда
        
        Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
            ПараметрыФормы = Новый Структура("РедактируемыйЦвет", РедактируемыйЦветТекстаЗаголовка);
            ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.РедактируемыйЦветТекстаЗаголовка,,,, 
				Новый ОписаниеОповещения("РедактируемыйЦветТекстаЗаголовкаНачалоВыбораЗавершение2", ЭтотОбъект, 
				Новый Структура("Результат", Результат)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
            Возврат;
        Иначе
            РедактируемыйЦветТекстаЗаголовка = Результат.Значение;
			Модифицированность 				 = Истина;
		КонецЕсли;
		
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаЗаголовкаНачалоВыбораЗавершение2(Результат, ДополнительныеПараметры) Экспорт    
		                 
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаЗаголовкаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаЗаголовкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		РедактируемыйЦветТекстаЗаголовка = ВыбранноеЗначение;		
	КонецЕсли;
	
	Модифицированность	 = Истина;
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("РедактируемыйЦветТекстаНачалоВыбораЗавершение", ЭтотОбъект), 
		БазовыеЦвета, 
		Элемент, 
		БазовыеЦвета.НайтиПоЗначению(РедактируемыйЦветТекста));

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Результат = ВыбранныйЭлемент;
    Если Результат <> Неопределено Тогда
        
        Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
            ПараметрыФормы = Новый Структура("РедактируемыйЦвет", РедактируемыйЦветТекста);
            ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.РедактируемыйЦветТекста,,,, 
				Новый ОписаниеОповещения("РедактируемыйЦветТекстаНачалоВыбораЗавершение2", ЭтотОбъект,
				Новый Структура("Результат", Результат)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
            Возврат;
        Иначе
            РедактируемыйЦветТекста = Результат.Значение;
			Модифицированность 		= Истина;
		КонецЕсли;
		
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаНачалоВыбораЗавершение2(Результат, ДополнительныеПараметры) Экспорт    
		
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветТекстаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		РедактируемыйЦветТекста = ВыбранноеЗначение;		
	КонецЕсли;
	
	Модифицированность	 = Истина;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("РедактируемыйЦветФонаНачалоВыбораЗавершение", ЭтотОбъект), 
		БазовыеЦвета, 
		Элемент, 
		БазовыеЦвета.НайтиПоЗначению(РедактируемыйЦветФона));

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Результат = ВыбранныйЭлемент;
    Если Результат <> Неопределено Тогда
        
        Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
            ПараметрыФормы = Новый Структура("РедактируемыйЦвет", РедактируемыйЦветФона);
            ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.РедактируемыйЦветФона,,,, 
				Новый ОписаниеОповещения("РедактируемыйЦветФонаНачалоВыбораЗавершение2", ЭтотОбъект,
				Новый Структура("Результат", Результат)),
				РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
            Возврат;
        Иначе
            РедактируемыйЦветФона	= Результат.Значение;
			Модифицированность 		= Истина;
		КонецЕсли;
		
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаНачалоВыбораЗавершение2(Результат, ДополнительныеПараметры) Экспорт    
		
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		РедактируемыйЦветФона = ВыбранноеЗначение;		
	КонецЕсли;
	
	Модифицированность	 = Истина;
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветРамкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("РедактируемыйЦветРамкиНачалоВыбораЗавершение", ЭтотОбъект), 
		БазовыеЦвета, 
		Элемент, 
		БазовыеЦвета.НайтиПоЗначению(РедактируемыйЦветФона));
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветРамкиНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Результат = ВыбранныйЭлемент;
    Если Результат <> Неопределено Тогда
        
        Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
            ПараметрыФормы = Новый Структура("РедактируемыйЦвет", РедактируемыйЦветРамки);
            ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.РедактируемыйЦветРамки,,,, 
				Новый ОписаниеОповещения("РедактируемыйЦветРамкиНачалоВыбораЗавершение2", ЭтотОбъект, 
				Новый Структура("Результат", Результат)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
            Возврат;
        Иначе
            РедактируемыйЦветРамки	= Результат.Значение;
			Модифицированность 		= Истина;
		КонецЕсли;
		
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветРамкиНачалоВыбораЗавершение2(Результат, ДополнительныеПараметры) Экспорт    
		
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветРамкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		РедактируемыйЦветРамки = ВыбранноеЗначение;		
	КонецЕсли;
	
	Модифицированность	 = Истина;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаЗаголовкаСкрытогоОтображенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ПоказатьВыборИзСписка(
		Новый ОписаниеОповещения("РедактируемыйЦветФонаЗаголовкаСкрытогоОтображенияНачалоВыбораЗавершение", ЭтотОбъект), 
		БазовыеЦвета, 
		Элемент, 
		БазовыеЦвета.НайтиПоЗначению(РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения));

КонецПроцедуры
	
&НаКлиенте
Процедура РедактируемыйЦветФонаЗаголовкаСкрытогоОтображенияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Результат = ВыбранныйЭлемент;
    Если Результат <> Неопределено Тогда
        
        Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
            ПараметрыФормы = Новый Структура("РедактируемыйЦвет", РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения);
            ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, 
				Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения,,,, 
				Новый ОписаниеОповещения("РедактируемыйЦветФонаЗаголовкаСкрытогоОтображенияНачалоВыбораЗавершение2", ЭтотОбъект,
				Новый Структура("Результат", Результат)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
            Возврат;
        Иначе
            РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения 	= Результат.Значение;
			Модифицированность 									= Истина;
		КонецЕсли;
		
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаЗаголовкаСкрытогоОтображенияНачалоВыбораЗавершение2(Результат, ДополнительныеПараметры) Экспорт    
		
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаЗаголовкаСкрытогоОтображенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Цвет") Тогда
		РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения = ВыбранноеЗначение;		
	КонецЕсли;
	
	Модифицированность	 = Истина;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ШрифтЗаголовкаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйШрифтПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеСтрока = Объект.Наименование;		
	Если ПустаяСтрока(НаименованиеСтрока) Тогда
		Возврат;
	КонецЕсли;	
	Объект.Заголовок 						= ?(ПустаяСтрока(Объект.Заголовок), НаименованиеСтрока, Объект.Заголовок);
	Объект.ЗаголовокСвернутогоОтображения	= ?(ПустаяСтрока(Объект.ЗаголовокСвернутогоОтображения), НаименованиеСтрока,
		Объект.ЗаголовокСвернутогоОтображения);
	Объект.Подсказка 						= ?(ПустаяСтрока(Объект.Подсказка), НаименованиеСтрока, Объект.Подсказка);

КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаФормыПриИзменении(Элемент)
	
	Если Не ПустаяСтрока(Объект.ИмяОбъектаФормы) Тогда
		Если СтрНайти(Объект.ИмяОбъектаФормы, "Регистр") > 0 
			ИЛИ СтрНайти(Объект.ИмяОбъектаФормы, "Журнал") > 0 Тогда
			Объект.ВидФормы = ПредопределенноеЗначение("Перечисление.ВидФормы.ФормаСписка");
			Элементы.ВидФормы.Доступность = Ложь;
		ИначеЕсли СтрНайти(Объект.ИмяОбъектаФормы, "ОбщаяФорма") > 0
			ИЛИ СтрНайти(Объект.ИмяОбъектаФормы, "Обработка") > 0 
			ИЛИ СтрНайти(Объект.ИмяОбъектаФормы, "Отчет") > 0 
			Тогда
			Объект.ВидФормы = ПредопределенноеЗначение("Перечисление.ВидФормы.ФормаОбъекта");
			Элементы.ВидФормы.Доступность = Ложь;
		Иначе
			Элементы.ВидФормы.Доступность = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПриИзменении(Элемент)
	
	Элементы.СтраницаДействия.Видимость = Объект.Гиперссылка;
	Если Объект.Гиперссылка = Истина Тогда
		РедактируемыйЦветТекста = WebЦвета.КоролевскиГолубой;
	Иначе
		РедактируемыйЦветТекста = WebЦвета.Черный;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВидОбработчикаПриИзменении(Элемент)
	
	Если Объект.ВидОбработчика = 
			ПредопределенноеЗначение("Перечисление.ВидыОбработчиковВиджетов.ПроизвольныйАлгоритм") Тогда
		Элементы.ГруппаОткрытьФорму.Видимость = Ложь;
	ИначеЕсли Объект.ВидОбработчика = ПредопределенноеЗначение("Перечисление.ВидыОбработчиковВиджетов.ОткрытьФорму") Тогда
		Элементы.ГруппаОткрытьФорму.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь; 
	РедактируемыйЦветФона	= Новый Цвет();
	Модифицированность 		= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветФонаЗаголовкаСкрытогоОтображенияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка								= Ложь; 
	РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения 	= WebЦвета.Белый;
	Модифицированность 									= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйЦветРамкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь; 
	РедактируемыйЦветРамки	= WebЦвета.НейтральноСерый;
	Модифицированность 		= Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ШрифтЗаголовкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка		= Ложь;
	РедактируемыйШрифтЗаголовка = Новый Шрифт("Arial", 10);
	Модифицированность			= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйШрифтОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка= Ложь;
	РедактируемыйШрифт 	= Новый Шрифт("Arial", 10);
	Модифицированность	= Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВидОтображенияМетрикиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОформленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "НастройкиОформленияНавСсылка" Тогда		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзображенияИзНабора", 
			Новый Структура("ПрефиксКартинок", "вдж"),,,,, 
			Новый ОписаниеОповещения("ВыбратьИзображениеИзНабораНастройкиОформленияЗавершение",
			ЭтотОбъект, Новый Структура("ТекущаяСтрока", ВыбраннаяСтрока)), 
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОформленияЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные 			= Элементы.НастройкиОформления.ТекущиеДанные;
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура;
	ПараметрыФормы.Вставить("ЦветФона", 	ТекущиеДанные.ЦветФона); 
	ПараметрыФормы.Вставить("ЦветТекста", 	ТекущиеДанные.ЦветТекста); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЦветаФонаИТекста", ЭтотОбъект);
	ОткрытьФорму("Справочник.Виджеты.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.НастройкиОформления, , , ,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	

КонецПроцедуры

&НаКлиенте
Процедура НастройкиОформленияПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОформленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ 						= Истина;
	НоваяСтрока 				= Объект.НастройкиОформления.Добавить();
	НоваяСтрока.ЦветФонаТекста	= "Образец";
	НоваяСтрока.ЦветФона		= "#FFFFFF"; // Белый.
	НоваяСтрока.ЦветТекста		= "#000000"; // Черный.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыРоли

&НаКлиенте
Процедура РолиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиФлагПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Роли.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НайденныеСтроки = Объект.Роли.НайтиСтроки(Новый Структура("Роль", ТекущиеДанные.Роль));
		Если ТекущиеДанные.Флаг = Истина Тогда
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = Объект.Роли.Добавить();
				НоваяСтрока.Роль = ТекущиеДанные.Роль;				
			КонецЕсли;
		Иначе
			Если НайденныеСтроки.Количество() > 0 Тогда
				Объект.Роли.Удалить(НайденныеСтроки[0]);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	Объект.Роли.Сортировать("Роль", );
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьКартинку(Команда)
	
	ОчиститьИзображениеНаСервере();	
	ОбновитьИзображение();
	Элементы.АдресКартинки.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинку(Команда)
	

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзображенияИзНабора", 
		Новый Структура("ПрефиксКартинок", "вдж"),,,,, 
		Новый ОписаниеОповещения("ВыбратьИзображениеИзНабораЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ТолькоВыбранныеРоли(Команда)
	
	ТолькоВыбранныеРоли 					 = Не ТолькоВыбранныеРоли;
	Элементы.РолиТолькоВыбранныеРоли.Пометка = ТолькоВыбранныеРоли;
	Если ТолькоВыбранныеРоли Тогда	
		Элементы.Роли.ОтборСтрок = Новый ФиксированнаяСтруктура("Флаг", Истина);
	Иначе
		Элементы.Роли.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	
	Результат = ПроверкаНаСервере();
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат);
	Иначе
		Результат.Показать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	
	Конструктор 		= Новый КонструкторЗапроса;
	ТекстЗапроса		= Элементы.КодОбработчикаЗначенияМетрик.ВыделенныйТекст;
	Конструктор.Текст	= СтрЗаменить(ТекстЗапроса,"|", "");
	Оповещение 			= Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение", ЭтотОбъект);
	Конструктор.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти	

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОбъектыДляОткрытияФормы()
	
	Элементы.ИмяОбъектаФормы.СписокВыбора.Очистить();
	
	// Справочники.
	Для Каждого М Из Метаданные.Справочники Цикл				
		Элементы.ИмяОбъектаФормы.СписокВыбора.Добавить("Справочник." + М.Имя, М.Синоним, , БиблиотекаКартинок.Справочник);		
	КонецЦикла;
	
	// Документы.
	Для Каждого М Из Метаданные.Документы Цикл				
		Элементы.ИмяОбъектаФормы.СписокВыбора.Добавить("Документ." + М.Имя, М.Синоним, , БиблиотекаКартинок.Документ);
	КонецЦикла;
	
	// Журналы документов.
	Для Каждого М Из Метаданные.ЖурналыДокументов Цикл				
		Элементы.ИмяОбъектаФормы.СписокВыбора.Добавить("ЖурналДокументов." + М.Имя, М.Синоним, , БиблиотекаКартинок.ЖурналДокументов);
	КонецЦикла;

	// Регистры сведений.
	Для Каждого М Из Метаданные.РегистрыСведений Цикл				
		Элементы.ИмяОбъектаФормы.СписокВыбора.Добавить("РегистрСведений." + М.Имя, М.Синоним, , БиблиотекаКартинок.РегистрСведений);
	КонецЦикла;

	// Общие формы.
	Для Каждого М Из Метаданные.ОбщиеФормы Цикл				
		Элементы.ИмяОбъектаФормы.СписокВыбора.Добавить("ОбщаяФорма." + М.Имя, М.Синоним, , БиблиотекаКартинок.Форма);
	КонецЦикла;

	// Обработки.
	Для Каждого М Из Метаданные.Обработки Цикл				
		Элементы.ИмяОбъектаФормы.СписокВыбора.Добавить("Обработка." + М.Имя, М.Синоним, , БиблиотекаКартинок.Обработка);
	КонецЦикла;
	
	// Отчеты.
	Для Каждого М Из Метаданные.Отчеты Цикл				
		Элементы.ИмяОбъектаФормы.СписокВыбора.Добавить("Отчет." + М.Имя, М.Синоним, , БиблиотекаКартинок.Отчет);
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ВидыВиджетов= Перечисления.ВидыВиджетов;
	ВидОбъекта 	= Объект.Вид;	
			
	Если ВидОбъекта = ВидыВиджетов.Страницы Тогда		
		
		// Основные.
		Элементы.Наименование.Видимость							= Истина;
		Элементы.Заголовок.Видимость							= Истина;
		Элементы.СтраницаНастройкаМетрик.Видимость				= Ложь;
		Элементы.ВидОтображенияМетрики.Видимость				= Ложь;
		Элементы.Видимость.Видимость							= Истина;
		Элементы.Доступность.Видимость							= Истина;
		Элементы.ТолькоПросмотр.Видимость						= Истина;
		Элементы.ВидОтображенияКнопки.Видимость					= Ложь;
		Элементы.ВажностьПриОтображении.Видимость				= Истина;
		Элементы.Поведение.Видимость							= Ложь;
		Элементы.ЗаголовокСвернутогоОтображения.Видимость 		= Ложь;
		Элементы.Свернута.Видимость								= Ложь;
		Элементы.ОтображениеУправления.Видимость				= Ложь;
		Элементы.ОтображатьОтступСлева.Видимость				= Ложь;
		Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения.Видимость = Ложь;
		Элементы.Отображение.Видимость							= Ложь;		
		Элементы.Группировка.Видимость 							= Ложь;
		Элементы.Объединенная.Видимость							= Ложь;
		Элементы.ВидДекорации.Видимость 						= Ложь;
		Элементы.Гиперссылка.Видимость							= Ложь;
		Элементы.СквозноеВыравнивание.Видимость					= Ложь;
		Элементы.ТипДиаграммы.Видимость							= Ложь;
		Элементы.РежимСглаживанияДиаграммы.Видимость			= Ложь;
		Элементы.ОтображатьЛегенду.Видимость					= Ложь;
		Элементы.ОтображатьШкалуТочек.Видимость					= Ложь;
		Элементы.ОтображатьШкалуЗначений.Видимость				= Ложь;
		Элементы.ПоложениеЗаголовка.Видимость					= Ложь;
		// Использование.
		Элементы.Подсказка.Видимость							= Истина;
		Элементы.ОтображениеПодсказки.Видимость					= Истина;
		Элементы.Масштабировать.Видимость						= Ложь;
		Элементы.ТекстНевыбраннойКартинки.Видимость 			= Ложь;		
		Элементы.ОтображениеСтраниц.Видимость					= Истина;
		Элементы.ОтображатьЗаголовок.Видимость					= Ложь;
		Элементы.РазмерКартинки.Видимость						= Ложь;
		Элементы.ГруппаКартинка.Видимость						= Ложь;
		Элементы.ВыравниваниеЭлементовИЗаголовков.Видимость		= Ложь;
		
		// Оформление.
		Элементы.РедактируемыйЦветТекстаЗаголовка.Видимость 	= Истина;
		Элементы.ШрифтЗаголовка.Видимость						= Истина;
		Элементы.ГоризонтальныйИнтервал.Видимость				= Ложь;
		Элементы.ВертикальныйИнтервал.Видимость					= Ложь;
		Элементы.РедактируемыйЦветТекста.Видимость				= Ложь;
		Элементы.РедактируемыйШрифт.Видимость					= Ложь;
		Элементы.РедактируемыйЦветФона.Видимость				= Ложь;
		Элементы.РедактируемыйЦветРамки.Видимость				= Ложь;
		Элементы.ГруппаРамка.Видимость							= Ложь;
		
		// Расположение.
		Элементы.ГруппаШиринаВысота.Видимость					= Истина;
		Элементы.АвтоМаксимальнаяВысота.Видимость				= Ложь;
		Элементы.АвтоМаксимальнаяШирина.Видимость				= Ложь;
		Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ВертикальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ГоризонтальноеПоложение.Видимость				= Ложь;
		Элементы.ВертикальноеПоложение.Видимость				= Ложь;
		Элементы.РастягиватьПоГоризонталиВариант.Видимость 		= Истина;		
		Элементы.РастягиватьПоВертикалиВариант.Видимость 		= Истина;
		Элементы.РастягиватьПоГоризонтали.Видимость 			= Ложь;		
		Элементы.РастягиватьПоВертикали.Видимость 				= Ложь;
		Элементы.ГоризонтальноеПоложениеПодчиненных.Видимость 	= Ложь;
		Элементы.ВертикальноеПоложениеПодчиненных.Видимость 	= Ложь;
		Элементы.ВертикальнаяПрокруткаПриСжатии.Видимость		= Ложь;
		Элементы.ВысотаЗаголовка.Видимость						= Ложь;
		
		// Действия.
		Элементы.СтраницаДействия.Видимость						= Ложь;		

	ИначеЕсли ВидОбъекта = ВидыВиджетов.Страница Тогда	
		
		// Основные.
		Элементы.Наименование.Видимость							= Истина;
		Элементы.Заголовок.Видимость							= Истина;
		Элементы.СтраницаНастройкаМетрик.Видимость				= Ложь;
		Элементы.ВидОтображенияМетрики.Видимость				= Ложь;
		Элементы.Видимость.Видимость							= Истина;		
		Элементы.Доступность.Видимость							= Истина;
		Элементы.ТолькоПросмотр.Видимость						= Истина;
		Элементы.ВидОтображенияКнопки.Видимость					= Ложь;
		Элементы.ВажностьПриОтображении.Видимость				= Истина;
		Элементы.Поведение.Видимость							= Ложь;
		Элементы.ЗаголовокСвернутогоОтображения.Видимость 		= Ложь;
		Элементы.Свернута.Видимость								= Ложь;
		Элементы.ОтображениеУправления.Видимость				= Ложь;
		Элементы.ОтображатьОтступСлева.Видимость				= Ложь;
		Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения.Видимость = Ложь;
		Элементы.Отображение.Видимость							= Ложь;		
		Элементы.Группировка.Видимость 							= Истина;
		Элементы.Объединенная.Видимость							= Ложь;
		Элементы.ВидДекорации.Видимость 						= Ложь;
		Элементы.Гиперссылка.Видимость							= Ложь;
		Элементы.СквозноеВыравнивание.Видимость					= Ложь;
		Элементы.ТипДиаграммы.Видимость							= Ложь;
		Элементы.РежимСглаживанияДиаграммы.Видимость			= Ложь;
		Элементы.ОтображатьЛегенду.Видимость					= Ложь;
		Элементы.ОтображатьШкалуТочек.Видимость					= Ложь;
		Элементы.ОтображатьШкалуЗначений.Видимость				= Ложь;
		Элементы.ПоложениеЗаголовка.Видимость					= Ложь;
		
		// Использование.
		Элементы.Подсказка.Видимость							= Истина;
		Элементы.ОтображениеПодсказки.Видимость					= Истина;
		Элементы.Масштабировать.Видимость						= Ложь;
		Элементы.ТекстНевыбраннойКартинки.Видимость 			= Ложь;		
		Элементы.ОтображениеСтраниц.Видимость					= Ложь;		
		Элементы.ОтображатьЗаголовок.Видимость					= Истина;
		Элементы.РазмерКартинки.Видимость						= Ложь;
		Элементы.ГруппаКартинка.Видимость						= Истина;
		Элементы.ВыравниваниеЭлементовИЗаголовков.Видимость		= Истина;
		
		// Оформление.
		Элементы.РедактируемыйЦветТекстаЗаголовка.Видимость 	= Истина;
		Элементы.ШрифтЗаголовка.Видимость						= Истина;		
		Элементы.ГоризонтальныйИнтервал.Видимость				= Истина;
		Элементы.ВертикальныйИнтервал.Видимость					= Истина;
		Элементы.РедактируемыйЦветТекста.Видимость				= Ложь;
        Элементы.РедактируемыйШрифт.Видимость					= Ложь;
		Элементы.РедактируемыйЦветФона.Видимость				= Истина;
		Элементы.РедактируемыйЦветРамки.Видимость				= Ложь;
		Элементы.ГруппаРамка.Видимость							= Ложь;
		
		// Расположение.
		Элементы.ГруппаШиринаВысота.Видимость					= Истина;
		Элементы.АвтоМаксимальнаяВысота.Видимость				= Ложь;
		Элементы.АвтоМаксимальнаяШирина.Видимость				= Ложь;
		Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 		= Ложь;
		Элементы.ВертикальноеПоложениеВГруппе.Видимость 		= Ложь;
		Элементы.ГоризонтальноеПоложение.Видимость				= Ложь;
		Элементы.ВертикальноеПоложение.Видимость				= Ложь;
		Элементы.РастягиватьПоВертикалиВариант.Видимость 		= Истина;
		Элементы.РастягиватьПоГоризонталиВариант.Видимость 		= Истина;
		Элементы.РастягиватьПоВертикали.Видимость 				= Ложь;
		Элементы.РастягиватьПоГоризонтали.Видимость 			= Ложь;
		Элементы.ГоризонтальноеПоложениеПодчиненных.Видимость 	= Истина;
		Элементы.ВертикальноеПоложениеПодчиненных.Видимость 	= Истина;
	    Элементы.ВертикальнаяПрокруткаПриСжатии.Видимость		= Истина;
		Элементы.ВысотаЗаголовка.Видимость						= Ложь;		
		
		// Действия.
		Элементы.СтраницаДействия.Видимость						= Ложь;		
	
	ИначеЕсли ВидОбъекта = ВидыВиджетов.Декорация Тогда	
		
		// Основные.
		Элементы.Наименование.Видимость							= Истина;
		Элементы.Заголовок.Видимость							= Истина;
		Элементы.ВидОтображенияМетрики.Видимость				= Ложь;
		Элементы.Видимость.Видимость							= Истина;
		Элементы.СтраницаНастройкаМетрик.Видимость				= Ложь;
		Элементы.Доступность.Видимость							= Истина;
		Элементы.ТолькоПросмотр.Видимость						= Ложь;
		Элементы.ВидОтображенияКнопки.Видимость					= Ложь;
		Элементы.ВажностьПриОтображении.Видимость				= Истина;
		Элементы.Поведение.Видимость							= Ложь;
		Элементы.ЗаголовокСвернутогоОтображения.Видимость 		= Ложь;
		Элементы.Свернута.Видимость								= Ложь;
		Элементы.ОтображениеУправления.Видимость				= Ложь;
		Элементы.ОтображатьОтступСлева.Видимость				= Ложь;
		Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения.Видимость = Ложь;
		Элементы.Отображение.Видимость							= Ложь;
		Элементы.Группировка.Видимость 							= Ложь;
		Элементы.Объединенная.Видимость							= Ложь;
		Элементы.ВидДекорации.Видимость 						= Истина;
		Элементы.Гиперссылка.Видимость							= Истина;
		Элементы.СквозноеВыравнивание.Видимость					= Ложь;
		Элементы.ТипДиаграммы.Видимость							= Ложь;
		Элементы.РежимСглаживанияДиаграммы.Видимость			= Ложь;
		Элементы.ОтображатьЛегенду.Видимость					= Ложь;
		Элементы.ОтображатьШкалуТочек.Видимость					= Ложь;
		Элементы.ОтображатьШкалуЗначений.Видимость				= Ложь;
		Элементы.ПоложениеЗаголовка.Видимость					= Ложь;
		
		// Использование.
		Элементы.Подсказка.Видимость							= Истина;
		Элементы.ОтображениеПодсказки.Видимость					= Истина;		
		Элементы.ОтображениеСтраниц.Видимость					= Ложь;		
		Элементы.ОтображатьЗаголовок.Видимость					= Ложь; 
		
		Если Объект.ВидДекорации = Перечисления.ВидыДекораций.Картинка Тогда
			Элементы.ГруппаКартинка.Видимость					= Истина;
			Элементы.Масштабировать.Видимость					= Истина;
			Элементы.ВысотаЗаголовка.Видимость					= Ложь;
			Элементы.ТекстНевыбраннойКартинки.Видимость 		= Истина;
			Элементы.РазмерКартинки.Видимость					= Истина;
		Иначе
			Элементы.ГруппаКартинка.Видимость					= Ложь;
			Элементы.Масштабировать.Видимость					= Ложь;
			Элементы.ВысотаЗаголовка.Видимость					= Истина;
			Элементы.ТекстНевыбраннойКартинки.Видимость 		= Ложь;		
			Элементы.РазмерКартинки.Видимость					= Ложь;
		КонецЕсли;		
		
		Элементы.ВыравниваниеЭлементовИЗаголовков.Видимость		= Ложь;
 	
		// Оформление.
		Элементы.РедактируемыйЦветТекстаЗаголовка.Видимость 	= Ложь;
		Элементы.ШрифтЗаголовка.Видимость						= Ложь;		
		Элементы.ГоризонтальныйИнтервал.Видимость				= Ложь;
		Элементы.ВертикальныйИнтервал.Видимость					= Ложь;
		Элементы.РедактируемыйЦветТекста.Видимость				= Истина;
        Элементы.РедактируемыйШрифт.Видимость					= Истина;
		Элементы.РедактируемыйЦветФона.Видимость				= Истина;
		Элементы.РедактируемыйЦветРамки.Видимость				= Истина;
		Элементы.ГруппаРамка.Видимость							= Истина;

		// Расположение.
		Элементы.ГруппаШиринаВысота.Видимость					= Истина;
		Элементы.АвтоМаксимальнаяВысота.Видимость				= Истина;
		Элементы.АвтоМаксимальнаяШирина.Видимость				= Истина;
		Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ВертикальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ГоризонтальноеПоложение.Видимость				= Истина;
		Элементы.ВертикальноеПоложение.Видимость				= Истина;
		Элементы.РастягиватьПоВертикалиВариант.Видимость 		= Истина;
		Элементы.РастягиватьПоГоризонталиВариант.Видимость 		= Истина;
		Элементы.РастягиватьПоВертикали.Видимость 				= Ложь;
		Элементы.РастягиватьПоГоризонтали.Видимость 			= Ложь;
		Элементы.ГоризонтальноеПоложениеПодчиненных.Видимость 	= Ложь;
		Элементы.ВертикальноеПоложениеПодчиненных.Видимость 	= Ложь;
	    Элементы.ВертикальнаяПрокруткаПриСжатии.Видимость		= Ложь;		
		
		// Действия.
		Если Объект.Гиперссылка = Истина Тогда
			Элементы.СтраницаДействия.Видимость	= Истина;
		Иначе
			Элементы.СтраницаДействия.Видимость	= Ложь;
		КонецЕсли;	

	ИначеЕсли ВидОбъекта = ВидыВиджетов.ОбычнаяГруппа Тогда		
		
		// Основные.
		Элементы.Наименование.Видимость							= Истина;
		Элементы.Заголовок.Видимость							= Истина;
		Элементы.ИмяОбъектаФормы.Видимость						= Ложь;
		Элементы.ВидФормы.Видимость								= Ложь;
		Элементы.СтраницаНастройкаМетрик.Видимость				= Ложь;
		Элементы.ВидОтображенияМетрики.Видимость				= Ложь;
		Элементы.Видимость.Видимость							= Истина;
		Элементы.Доступность.Видимость							= Истина;
		Элементы.ТолькоПросмотр.Видимость						= Истина;
		Элементы.ВидОтображенияКнопки.Видимость					= Ложь;
		Элементы.ВажностьПриОтображении.Видимость				= Истина;
		Элементы.Поведение.Видимость							= Истина;
		Элементы.ТипДиаграммы.Видимость							= Ложь;
		Элементы.РежимСглаживанияДиаграммы.Видимость			= Ложь;
		Элементы.ОтображатьЛегенду.Видимость					= Ложь;
		Элементы.ОтображатьШкалуТочек.Видимость					= Ложь;
		Элементы.ОтображатьШкалуЗначений.Видимость				= Ложь;
		Элементы.ПоложениеЗаголовка.Видимость					= Ложь;
		
		Если Объект.Поведение = Перечисления.ВидыПоведенияГруппыЭлементов.Обычное Тогда
			Элементы.ЗаголовокСвернутогоОтображения.Видимость 	= Ложь;
			Элементы.Свернута.Видимость							= Ложь;
			Элементы.ОтображениеУправления.Видимость			= Ложь;
			Элементы.ОтображатьОтступСлева.Видимость			= Ложь;
			Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения.Видимость = Ложь;
			Элементы.СквозноеВыравнивание.Видимость				= Истина;
		Иначе
			Элементы.ЗаголовокСвернутогоОтображения.Видимость 	= Истина;
			Элементы.Свернута.Видимость							= Истина;
			Элементы.ОтображениеУправления.Видимость			= Истина;
			Элементы.ОтображатьОтступСлева.Видимость			= Истина;
			Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения.Видимость = Истина;
			Элементы.СквозноеВыравнивание.Видимость				= Ложь;
		КонецЕсли;
		
		Элементы.Отображение.Видимость							= Истина;
		Элементы.Группировка.Видимость 							= Истина;
		Элементы.Объединенная.Видимость							= Истина;
		Элементы.ВидДекорации.Видимость 						= Ложь;
		Элементы.Гиперссылка.Видимость							= Ложь;	
		
		// Использование.
		Элементы.Подсказка.Видимость							= Истина;
		Элементы.ОтображениеПодсказки.Видимость					= Истина;
		Элементы.Масштабировать.Видимость						= Ложь;
		Элементы.ТекстНевыбраннойКартинки.Видимость 			= Ложь;		
		Элементы.ОтображениеСтраниц.Видимость					= Ложь;		
		Элементы.ОтображатьЗаголовок.Видимость					= Истина;
		Элементы.РазмерКартинки.Видимость						= Ложь;
		Элементы.ГруппаКартинка.Видимость						= Ложь;
		Элементы.ВыравниваниеЭлементовИЗаголовков.Видимость		= Истина;
		
		// Оформление.
		Элементы.РедактируемыйЦветТекстаЗаголовка.Видимость 	= Истина;
		Элементы.ШрифтЗаголовка.Видимость						= Истина;		
		Элементы.ГоризонтальныйИнтервал.Видимость				= Истина;
		Элементы.ВертикальныйИнтервал.Видимость					= Истина;
		Элементы.РедактируемыйЦветТекста.Видимость				= Ложь;
        Элементы.РедактируемыйШрифт.Видимость					= Ложь;
		Элементы.РедактируемыйЦветФона.Видимость				= Истина;
		Элементы.РедактируемыйЦветРамки.Видимость				= Ложь;
		Элементы.ГруппаРамка.Видимость							= Ложь;
		
		// Расположение.
		Элементы.ГруппаШиринаВысота.Видимость					= Истина;
		Элементы.АвтоМаксимальнаяВысота.Видимость				= Ложь;
		Элементы.АвтоМаксимальнаяШирина.Видимость				= Ложь;
		Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ВертикальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ГоризонтальноеПоложение.Видимость				= Ложь;
		Элементы.ВертикальноеПоложение.Видимость				= Ложь;
		Элементы.РастягиватьПоВертикалиВариант.Видимость 		= Истина;
		Элементы.РастягиватьПоГоризонталиВариант.Видимость 		= Истина;
		Элементы.РастягиватьПоВертикали.Видимость 				= Ложь;
		Элементы.РастягиватьПоГоризонтали.Видимость 			= Ложь;
		Элементы.ГоризонтальноеПоложениеПодчиненных.Видимость 	= Истина;
		Элементы.ВертикальноеПоложениеПодчиненных.Видимость 	= Истина;
	    Элементы.ВертикальнаяПрокруткаПриСжатии.Видимость		= Ложь;
		Элементы.ВысотаЗаголовка.Видимость						= Ложь;
		
		// Действия.
		Элементы.СтраницаДействия.Видимость						= Ложь;		

	ИначеЕсли ВидОбъекта = ВидыВиджетов.Метрика Тогда
		
		// Основные.
		Элементы.Наименование.Видимость							= Истина;		
		Элементы.ВидОтображенияМетрики.Видимость				= Истина;		
		Элементы.СтраницаНастройкаМетрик.Видимость				= Ложь;		
		Элементы.ТолькоПросмотр.Видимость						= Ложь;
		Элементы.ВидОтображенияКнопки.Видимость					= Ложь;		
		Элементы.Поведение.Видимость							= Ложь;
		Элементы.ЗаголовокСвернутогоОтображения.Видимость 		= Ложь;
		Элементы.Свернута.Видимость								= Ложь;
		Элементы.ОтображениеУправления.Видимость				= Ложь;
		Элементы.ОтображатьОтступСлева.Видимость				= Ложь;
		Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения.Видимость = Ложь;
		Элементы.Отображение.Видимость							= Ложь;
		Элементы.Группировка.Видимость 							= Ложь;
		Элементы.Объединенная.Видимость							= Ложь;
		Элементы.ВидДекорации.Видимость 						= Ложь;
		Элементы.Гиперссылка.Видимость							= Истина;
		Элементы.СквозноеВыравнивание.Видимость					= Ложь;
		
		// Использование.
		Элементы.ОтображениеСтраниц.Видимость					= Ложь;		
		Элементы.ОтображатьЗаголовок.Видимость					= Ложь;
		
		Если Объект.ВидОтображенияМетрики = Перечисления.ВидыОтображенияМетрик.Надпись Тогда
			
			Элементы.Заголовок.Видимость						= Ложь;
			Элементы.Видимость.Видимость						= Истина;
			Элементы.Доступность.Видимость						= Истина;
			Элементы.ВажностьПриОтображении.Видимость			= Истина;
			Элементы.ГруппаКартинка.Видимость					= Ложь;
			Элементы.Масштабировать.Видимость					= Ложь;
			Элементы.ВысотаЗаголовка.Видимость					= Истина;
			Элементы.ТекстНевыбраннойКартинки.Видимость 		= Ложь;		
			Элементы.РазмерКартинки.Видимость					= Ложь;
			Элементы.СтраницаУсловноеОформление.Видимость		= Ложь;
			Элементы.РедактируемыйЦветТекста.Видимость			= Истина;
			Элементы.РедактируемыйЦветФона.Видимость			= Истина;
			Элементы.РедактируемыйЦветРамки.Видимость			= Истина;
			Элементы.ГруппаРамка.Видимость						= Истина;
			Элементы.ГруппаРасположение.Видимость				= Истина;
			Элементы.Подсказка.Видимость						= Истина;
			Элементы.ОтображениеПодсказки.Видимость				= Истина;		
			Элементы.ТипДиаграммы.Видимость						= Ложь;
			Элементы.РежимСглаживанияДиаграммы.Видимость		= Ложь;
			Элементы.РедактируемыйШрифт.Видимость				= Истина;			
			Элементы.ОтображатьЛегенду.Видимость				= Ложь;
			Элементы.ОтображатьШкалуТочек.Видимость				= Ложь;
			Элементы.ОтображатьШкалуЗначений.Видимость			= Ложь;
			Элементы.РастягиватьПоВертикали.Видимость 			= Ложь;
			Элементы.РастягиватьПоГоризонтали.Видимость 		= Ложь;
			Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 	= Ложь;
			Элементы.ВертикальноеПоложениеВГруппе.Видимость 	= Ложь;
			Элементы.ГоризонтальноеПоложение.Видимость			= Истина;
			Элементы.ВертикальноеПоложение.Видимость			= Истина;
			Элементы.РастягиватьПоВертикалиВариант.Видимость 	= Истина;
			Элементы.РастягиватьПоГоризонталиВариант.Видимость 	= Истина;
			Элементы.ПоложениеЗаголовка.Видимость				= Ложь;
			
		ИначеЕсли Объект.ВидОтображенияМетрики = Перечисления.ВидыОтображенияМетрик.НадписьСУсловнымОформлением Тогда
			
			Элементы.Заголовок.Видимость						= Истина;
			Элементы.Видимость.Видимость						= Ложь;
			Элементы.Доступность.Видимость						= Ложь;
			Элементы.ВажностьПриОтображении.Видимость			= Ложь;
			Элементы.ГруппаШиринаВысота.Видимость				= Ложь;
			Элементы.ГруппаКартинка.Видимость					= Ложь;
			Элементы.Масштабировать.Видимость					= Ложь;
			Элементы.ВысотаЗаголовка.Видимость					= Ложь;
			Элементы.ТекстНевыбраннойКартинки.Видимость 		= Ложь;		
			Элементы.РазмерКартинки.Видимость					= Ложь;
			Элементы.СтраницаУсловноеОформление.Видимость		= Истина;
			Элементы.РедактируемыйЦветТекста.Видимость			= Ложь;
			Элементы.РедактируемыйЦветФона.Видимость			= Ложь;
			Элементы.РедактируемыйЦветРамки.Видимость			= Ложь;
			Элементы.ГруппаРамка.Видимость						= Ложь;
			Элементы.ГруппаРасположение.Видимость				= Ложь;
			Элементы.Подсказка.Видимость						= Ложь;
			Элементы.ОтображениеПодсказки.Видимость				= Ложь;		
			Элементы.ТипДиаграммы.Видимость						= Ложь;
			Элементы.РежимСглаживанияДиаграммы.Видимость		= Ложь;
			Элементы.РедактируемыйШрифт.Видимость				= Истина;		
			Элементы.ОтображатьЛегенду.Видимость				= Ложь;
			Элементы.ОтображатьШкалуТочек.Видимость				= Ложь;
			Элементы.ОтображатьШкалуЗначений.Видимость			= Ложь;
			Элементы.РастягиватьПоВертикали.Видимость 			= Ложь;
			Элементы.РастягиватьПоГоризонтали.Видимость 		= Ложь;
			Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 	= Ложь;
			Элементы.ВертикальноеПоложениеВГруппе.Видимость 	= Ложь;
			Элементы.ПоложениеЗаголовка.Видимость				= Ложь;
			
			УстановитьУсловноеОформление();
			ДобавитьКолонкуНастройкиОформления();			
			
		ИначеЕсли Объект.ВидОтображенияМетрики = Перечисления.ВидыОтображенияМетрик.Диаграмма Тогда
			
			Элементы.Заголовок.Видимость						= Истина;
			Элементы.Видимость.Видимость						= Ложь;
			Элементы.Доступность.Видимость						= Ложь;
			Элементы.ВажностьПриОтображении.Видимость			= Ложь;
			Элементы.ГруппаШиринаВысота.Видимость				= Истина;
			Элементы.ГруппаКартинка.Видимость					= Ложь;
			Элементы.Масштабировать.Видимость					= Ложь;
			Элементы.ВысотаЗаголовка.Видимость					= Ложь;
			Элементы.ТекстНевыбраннойКартинки.Видимость 		= Ложь;
			Элементы.РазмерКартинки.Видимость					= Ложь;
			Элементы.СтраницаУсловноеОформление.Видимость		= Ложь;
			Элементы.РедактируемыйЦветТекста.Видимость			= Ложь;
			Элементы.РедактируемыйЦветФона.Видимость			= Истина;
			Элементы.РедактируемыйЦветРамки.Видимость			= Ложь;
			Элементы.ГруппаРамка.Видимость						= Ложь;
			Элементы.ГруппаРасположение.Видимость				= Истина;
			Элементы.Подсказка.Видимость						= Ложь;
			Элементы.ОтображениеПодсказки.Видимость				= Ложь;
			Элементы.ТипДиаграммы.Видимость						= Истина;
			Элементы.РедактируемыйШрифт.Видимость				= Ложь;
			Элементы.ОтображатьЛегенду.Видимость				= Истина;
			Элементы.ОтображатьШкалуТочек.Видимость				= Истина;
			Элементы.ОтображатьШкалуЗначений.Видимость			= Истина;
			Элементы.РастягиватьПоВертикали.Видимость 			= Истина;
			Элементы.РастягиватьПоГоризонтали.Видимость 		= Истина;
			Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 	= Ложь;
			Элементы.ВертикальноеПоложениеВГруппе.Видимость 	= Ложь;
			Элементы.ГоризонтальноеПоложение.Видимость			= Ложь;
			Элементы.ВертикальноеПоложение.Видимость			= Ложь;
			Элементы.РастягиватьПоВертикалиВариант.Видимость 	= Ложь;
			Элементы.РастягиватьПоГоризонталиВариант.Видимость 	= Ложь;
			Элементы.АвтоМаксимальнаяВысота.Видимость			= Ложь;
			Элементы.АвтоМаксимальнаяШирина.Видимость			= Ложь;
			Элементы.ПоложениеЗаголовка.Видимость				= Истина;
			Элементы.Гиперссылка.Видимость						= Ложь;
			Элементы.РежимСглаживанияДиаграммы.Видимость		= Истина;
			
		КонецЕсли;		
		
		Элементы.ВыравниваниеЭлементовИЗаголовков.Видимость		= Ложь;
 	
		// Оформление.
		Элементы.РедактируемыйЦветТекстаЗаголовка.Видимость 	= Ложь;
		Элементы.ШрифтЗаголовка.Видимость						= Ложь;		
		Элементы.ГоризонтальныйИнтервал.Видимость				= Ложь;
		Элементы.ВертикальныйИнтервал.Видимость					= Ложь;		

		// Расположение.		
		Элементы.ГоризонтальноеПоложениеПодчиненных.Видимость 	= Ложь;
		Элементы.ВертикальноеПоложениеПодчиненных.Видимость 	= Ложь;
	    Элементы.ВертикальнаяПрокруткаПриСжатии.Видимость		= Ложь;		
		
		// Действия.		
		Элементы.СтраницаДействия.Видимость 					= Объект.Гиперссылка;		
		Элементы.СтраницаНастройкаМетрик.Видимость				= Истина;	
		
ИначеЕсли ВидОбъекта = ВидыВиджетов.Кнопка Тогда	
		
		// Основные.
		Элементы.Наименование.Видимость							= Истина;
		Элементы.Заголовок.Видимость							= Истина;
		Элементы.ВидОтображенияМетрики.Видимость				= Ложь;
		Элементы.Видимость.Видимость							= Истина;
		Элементы.СтраницаНастройкаМетрик.Видимость				= Ложь;
		Элементы.Доступность.Видимость							= Истина;
		Элементы.ТолькоПросмотр.Видимость						= Ложь;
		Элементы.ВидОтображенияКнопки.Видимость					= Истина;
		Элементы.ВажностьПриОтображении.Видимость				= Истина;
		Элементы.Поведение.Видимость							= Ложь;
		Элементы.ЗаголовокСвернутогоОтображения.Видимость 		= Ложь;
		Элементы.Свернута.Видимость								= Ложь;
		Элементы.ОтображениеУправления.Видимость				= Ложь;
		Элементы.ОтображатьОтступСлева.Видимость				= Ложь;
		Элементы.РедактируемыйЦветФонаЗаголовкаСкрытогоОтображения.Видимость = Ложь;
		Элементы.Отображение.Видимость							= Ложь;
		Элементы.Группировка.Видимость 							= Ложь;
		Элементы.Объединенная.Видимость							= Ложь;
		Элементы.ВидДекорации.Видимость 						= Ложь;
		Элементы.Гиперссылка.Видимость							= Ложь;
		Элементы.СквозноеВыравнивание.Видимость					= Ложь;
		Элементы.ТипДиаграммы.Видимость							= Ложь;
		Элементы.РежимСглаживанияДиаграммы.Видимость			= Ложь;
		Элементы.ОтображатьШкалуТочек.Видимость					= Ложь;
		Элементы.ОтображатьШкалуЗначений.Видимость				= Ложь;
		Элементы.СтраницаУсловноеОформление.Видимость			= Ложь;
		Элементы.ПоложениеЗаголовка.Видимость					= Ложь;
		Элементы.ОтображатьЛегенду.Видимость					= Ложь;
		
		// Использование.
		Элементы.Подсказка.Видимость							= Истина;
		Элементы.ОтображениеПодсказки.Видимость					= Истина;		
		Элементы.ОтображениеСтраниц.Видимость					= Ложь;		
		Элементы.ОтображатьЗаголовок.Видимость					= Ложь;
		
		Элементы.ГруппаКартинка.Видимость						= Истина;
		Элементы.Масштабировать.Видимость						= Ложь;
		Элементы.ВысотаЗаголовка.Видимость						= Истина;
		Элементы.ТекстНевыбраннойКартинки.Видимость 			= Ложь;
		Элементы.РазмерКартинки.Видимость						= Ложь;
		
		Элементы.ВыравниваниеЭлементовИЗаголовков.Видимость		= Ложь;
 	
		// Оформление.
		Элементы.РедактируемыйЦветТекстаЗаголовка.Видимость 	= Ложь;
		Элементы.ШрифтЗаголовка.Видимость						= Ложь;		
		Элементы.ГоризонтальныйИнтервал.Видимость				= Ложь;
		Элементы.ВертикальныйИнтервал.Видимость					= Ложь;
		Элементы.РедактируемыйЦветТекста.Видимость				= Истина;
        Элементы.РедактируемыйШрифт.Видимость					= Истина;
		Элементы.РедактируемыйЦветФона.Видимость				= Истина;
		Элементы.РедактируемыйЦветРамки.Видимость				= Истина;
		Элементы.ГруппаРамка.Видимость							= Ложь;

		// Расположение.
		Элементы.ГруппаШиринаВысота.Видимость					= Истина;
		Элементы.АвтоМаксимальнаяВысота.Видимость				= Истина;
		Элементы.АвтоМаксимальнаяШирина.Видимость				= Истина;
		Элементы.ГоризонтальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ВертикальноеПоложениеВГруппе.Видимость 		= Истина;
		Элементы.ГоризонтальноеПоложение.Видимость				= Ложь;
		Элементы.ВертикальноеПоложение.Видимость				= Ложь;
		Элементы.РастягиватьПоВертикалиВариант.Видимость 		= Ложь;
		Элементы.РастягиватьПоГоризонталиВариант.Видимость 		= Ложь;
		Элементы.РастягиватьПоВертикали.Видимость 				= Истина;
		Элементы.РастягиватьПоГоризонтали.Видимость 			= Истина;
		Элементы.ГоризонтальноеПоложениеПодчиненных.Видимость 	= Ложь;
		Элементы.ВертикальноеПоложениеПодчиненных.Видимость 	= Ложь;
	    Элементы.ВертикальнаяПрокруткаПриСжатии.Видимость		= Ложь;		
		
		// Действия.
		Элементы.СтраницаДействия.Видимость						= Истина;
		
	КонецЕсли;
	
	Если Элементы.СтраницаДействия.Видимость = Истина Тогда
		Если Объект.ВидОбработчика = Перечисления.ВидыОбработчиковВиджетов.ПроизвольныйАлгоритм Тогда
			Элементы.ГруппаОткрытьФорму.Видимость = Ложь;		
		КонецЕсли;	
		
		Если Не ПустаяСтрока(Объект.ИмяОбъектаФормы) Тогда
			Если СтрНайти(Объект.ИмяОбъектаФормы, "Регистр") > 0 
				ИЛИ СтрНайти(Объект.ИмяОбъектаФормы, "Журнал") > 0 Тогда			
				Элементы.ВидФормы.Доступность = Ложь;
			ИначеЕсли СтрНайти(Объект.ИмяОбъектаФормы, "ОбщаяФорма") > 0
				ИЛИ СтрНайти(Объект.ИмяОбъектаФормы, "Обработка") > 0 Тогда			
				Элементы.ВидФормы.Доступность = Ложь;
			Иначе
				Элементы.ВидФормы.Доступность = Истина;
			КонецЕсли;	
		КонецЕсли;			
	КонецЕсли;
		
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьИзображениеИзНабораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат <> Неопределено Тогда
        Адрес = ПоместитьВоВременноеХранилище(Результат);
        ПоместитьФайлОбъекта(Адрес);
        Элементы.АдресКартинки.Обновить();
		ОбновитьИзображение();
    КонецЕсли;

КонецПроцедуры
	
&НаСервере
Процедура ПоместитьФайлОбъекта(Знач АдресВременногоХранилища)
	
	ЭлементСправочника 	= РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные 		= ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ЭлементСправочника.Картинка = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных());
	ЭлементСправочника.Записать();
	Модифицированность 	= Ложь;
	УдалитьИзВременногоХранилища(АдресВременногоХранилища);
	ЗначениеВРеквизитФормы(ЭлементСправочника, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображение()
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьИзображениеНаСервере()
	
	ЭлементСправочника = РеквизитФормыВЗначение("Объект");
	ЭлементСправочника.Картинка = Неопределено;
	ЭлементСправочника.Записать();
	Модифицированность = Ложь;
	ЗначениеВРеквизитФормы(ЭлементСправочника, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзображениеИзНабораНастройкиОформленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат <> Неопределено Тогда
		Адрес = ПоместитьВоВременноеХранилище(Результат);		
		ПоместитьФайлКартинкиДляСтрокиНастройкиОформления(Адрес, ДополнительныеПараметры.ТекущаяСтрока);		
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоместитьФайлКартинкиДляСтрокиНастройкиОформления(Знач АдресВременногоХранилища, Знач ТекущаяСтрока)
	
	ЭлементСправочника 	= РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные 		= ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ЭлементСправочника.НастройкиОформления[ТекущаяСтрока].Картинка 				= Новый ХранилищеЗначения(ДвоичныеДанные);
	ЭлементСправочника.НастройкиОформления[ТекущаяСтрока].КартинкаУстановлена	= Истина;
	ЭлементСправочника.НастройкиОформления[ТекущаяСтрока].НавСсылка 			= 
		ПолучитьНавигационнуюСсылку(Объект.Ссылка, "НастройкиОформления.Картинка", ТекущаяСтрока);
	ЭлементСправочника.Записать();
	Модифицированность 															= Ложь;
	УдалитьИзВременногоХранилища(АдресВременногоХранилища);
	ЗначениеВРеквизитФормы(ЭлементСправочника, "Объект");
	ЗаполнитьОбразец();	
	
КонецПроцедуры

&Насервере
Процедура ЗаполнитьОбразец()
	
	Если Элементы.СтраницаУсловноеОформление.Видимость = Истина Тогда	
		Для Каждого Строка Из Объект.НастройкиОформления Цикл
			Строка.ЦветФонаТекста = "Образец";	
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЦветаФонаИТекста(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.НастройкиОформления.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ЦветФона 	= РаботаСЦветомКлиентСервер.ЦветВHex(Результат.ЦветФона);
		ТекущиеДанные.ЦветТекста= РаботаСЦветомКлиентСервер.ЦветВHex(Результат.ЦветТекста);
		Модифицированность = Истина;
	КонецЕсли;	
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УО = УсловноеОформление.Элементы;
	УО.Очистить();
	
	мWebЦветаБелый 	= WebЦвета.Белый;
	мWebЦветаЧерный = WebЦвета.Черный;

	Для Каждого Строка Из Объект.НастройкиОформления Цикл
		Попытка
			ЦветФона 	= РаботаСЦветомКлиентСервер.HexВЦвет(Строка.ЦветФона);
			ЦветТекста 	= РаботаСЦветомКлиентСервер.HexВЦвет(Строка.ЦветТекста);
		Исключение
			ЦветФона 	= мWebЦветаБелый;
			ЦветТекста 	= мWebЦветаЧерный;
		КонецПопытки;
		
		Если ЦветФона <> мWebЦветаБелый ИЛИ ЦветТекста <> мWebЦветаЧерный Тогда
			ЭлементУО 						= УО.Добавить();
			Если ЦветФона <> мWebЦветаБелый Тогда
				ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
			КонецЕсли;
			Если ЦветТекста <> мWebЦветаЧерный Тогда
				ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
			КонецЕсли;
			
			ПолеОформления 					= ЭлементУО.Поля.Элементы.Добавить();
    		ПолеОформления.Поле 			= Новый ПолеКомпоновкиДанных("ЦветФонаТекста");
    		ПолеОформления.Использование 	= Истина;
			
			ЭлементУсловия 					= ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.НастройкиОформления.НомерСтроки");
			ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение 	= Строка.НомерСтроки;
			ЭлементУсловия.Использование 	= Истина;
			
		КонецЕсли;

	КонецЦикла;	

	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкуНастройкиОформления()
	
	МассивРеквизитов = ЭтотОбъект.ПолучитьРеквизиты("Объект.НастройкиОформления");		
	Для Каждого РеквизитФормы Из МассивРеквизитов Цикл
		Если РеквизитФормы.Имя = "ЦветФонаТекста" Тогда
			Возврат;
		КонецЕсли;	
	КонецЦикла;	
	
	ДобавленныйРеквизитСтрока 				= Новый РеквизитФормы("ЦветФонаТекста", 
		Новый ОписаниеТипов("Строка"), "Объект.НастройкиОформления", "Цвета", Ложь);	
	МассивДобавляемыхРеквизитов 			= Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(ДобавленныйРеквизитСтрока);
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	НоваяКолонка 							= Элементы.Добавить("ЦветФонаТекста", Тип("ПолеФормы"), Элементы.НастройкиОформления);
	НоваяКолонка.Вид 						= ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным 				= "Объект.НастройкиОформления.ЦветФонаТекста";	
	НоваяКолонка.КнопкаВыбора				= Истина;
	НоваяКолонка.Ширина						= 0;
	НоваяКолонка.РастягиватьПоГоризонтали 	= Ложь;
	НоваяКолонка.АвтоМаксимальнаяШирина 	= Ложь;
	НоваяКолонка.РедактированиеТекста		= Ложь;
	НоваяКолонка.УстановитьДействие("НачалоВыбора", "НастройкиОформленияЦветНачалоВыбора");	
	Элементы.Переместить(НоваяКолонка, Элементы.НастройкиОформления, Элементы.НастройкиОформленияКомментарий);
	ЗаполнитьОбразец();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДоступныхРолейТекущегоПользователя()

	ТЗ = ДанныеФормыВЗначение(Роли, Тип("ТаблицаЗначений"));
	ТЗ.Очистить();
	Для Каждого Роль Из Метаданные.Роли Цикл
		НоваяСтрока 				= ТЗ.Добавить();
		НоваяСтрока.Роль 			= Роль.Имя;
		НоваяСтрока.Представление	= ?(ПустаяСтрока(Роль.Синоним), Роль.Имя, Роль.Синоним);
		НайденныеСтроки 			= Объект.Роли.НайтиСтроки(Новый Структура("Роль", Роль.Имя));
		НоваяСтрока.Флаг 			= НайденныеСтроки.Количество() > 0;
		НоваяСтрока.НомерКартинки	= 0;
	КонецЦикла;
	ТЗ.Сортировать("Представление Возр");
	ЗначениеВДанныеФормы(ТЗ, Роли);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидВиджета()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьМетрики") <> Истина Тогда
		Элементы.Вид.РежимВыбораИзСписка = Истина;
		Элементы.Вид.СписокВыбора.Очистить();
		Элементы.Вид.СписокВыбора.Добавить(Перечисления.ВидыВиджетов.Декорация);
		Элементы.Вид.СписокВыбора.Добавить(Перечисления.ВидыВиджетов.Кнопка);
		Элементы.Вид.СписокВыбора.Добавить(Перечисления.ВидыВиджетов.ОбычнаяГруппа);
		Элементы.Вид.СписокВыбора.Добавить(Перечисления.ВидыВиджетов.Страница);
		Элементы.Вид.СписокВыбора.Добавить(Перечисления.ВидыВиджетов.Страницы);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверкаНаСервере()
	
	ВременноеХранилищеРезультата = Новый УникальныйИдентификатор();
	
	МассивВиджетов = Новый Массив;
	МассивВиджетов.Добавить(Объект.Ссылка);
	
	ПараметрыПроцедуры 					= Новый Структура;
	ПараметрыПроцедуры.Вставить("ДатаСравнения", ТекущаяДатаСеанса());			
	ПараметрыПроцедуры.Вставить("МассивВиджетов", МассивВиджетов);
	
	Обработки.РабочийСтол.ПолучитьДанные(ПараметрыПроцедуры, ВременноеХранилищеРезультата);
	
	Результат = ПолучитьИзВременногоХранилища(ВременноеХранилищеРезультата);
	УдалитьИзВременногоХранилища(ВременноеХранилищеРезультата);
	
	Если Результат.Количество() <> 1 Тогда
		Возврат НСтр("ru = 'Непредвиденный результат проверки. Ошибка.'");
	КонецЕсли;
	
	Для Каждого КЗ Из Результат Цикл 
		
		Значение = КЗ.Значение;
		Если Значение.Получить("ОписаниеОшибки") <> Неопределено Тогда
			Возврат Значение.Получить("ОписаниеОшибки");
		КонецЕсли;
		
		// Проверки таблицы
		// 1. Для надписей (строк и столбцов должно быть 1)
		Таблица = Значение.Получить("Значение");
		
		Если Таблица = Неопределено ИЛИ ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда
			Возврат НСтр("ru = 'Обработчик должен в переменной Результат вернуть таблицу значений.'");
		КонецЕсли;
		
		Если (Объект.ВидОтображенияМетрики = Перечисления.ВидыОтображенияМетрик.Надпись
			ИЛИ Объект.ВидОтображенияМетрики = Перечисления.ВидыОтображенияМетрик.НадписьСУсловнымОформлением)
			И (Таблица.Колонки.Количество() <> 1 ИЛИ Таблица.Количество() <> 1) Тогда
			
				Возврат НСтр("ru = 'Для простых метрик должен быть возврат таблицы где строк ровно одна и колонок ровно одна.'");
			
		КонецЕсли;
		
		// 2. Проверка на сложную метрику и что возвращает таблицу
		
		ТабДокумент = Новый ТабличныйДокумент;
				
		Для ИндексКолонки = 0 По Таблица.Колонки.Количество() - 1 Цикл
			ИмяКолонки = Таблица.Колонки[ИндексКолонки].Имя;
			
			ТекОбласть = ТабДокумент.Область("R"+ Формат(1, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") 
				+ "C" + Формат(ИндексКолонки + 1, "ЧРД=; ЧРГ=; ЧН=0; ЧГ="));
			ТекОбласть.Текст = ИмяКолонки;
			
		КонецЦикла;
		
		Для ИндексСтроки = 0 По Таблица.Количество() - 1 Цикл
			Строки = Таблица[ИндексСтроки];
			Для ИндексКолонки = 0 По Таблица.Колонки.Количество() - 1 Цикл
				ИмяКолонки = Таблица.Колонки[ИндексКолонки].Имя;
				
				ТекОбласть = ТабДокумент.Область("R"+ Формат(ИндексСтроки + 2, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") 
					+ "C" + Формат(ИндексКолонки + 1, "ЧРД=; ЧРГ=; ЧН=0; ЧГ="));
				ТекОбласть.Текст = Строка(Строки[ИмяКолонки]);
				
			КонецЦикла;
		КонецЦикла;        
		
		Возврат ТабДокумент;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте 
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Текст = Неопределено Тогда 		
		Элементы.КодОбработчикаЗначенияМетрик.ВыделенныйТекст = ТекстЗапросаДляКонфигуратора(Текст);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ТекстЗапросаДляКонфигуратора(Знач Текст)
		
	Результат 		= "";	
	ПереводСтроки 	= Символы.ВК + Символы.ПС;
	Для Счетчик = 1 По СтрЧислоСтрок(Текст) Цикл
		ТекСтрока = СтрПолучитьСтроку(Текст, Счетчик);
		Если Счетчик > 1 Тогда 
			ТекСтрока = СтрЗаменить(ТекСтрока, """", """""");
			Результат = Результат + ПереводСтроки + "|"+ ТекСтрока;
		Иначе	
			ТекСтрока = СтрЗаменить(ТекСтрока, """", """""");
			Результат = Результат + ТекСтрока;
		КонецЕсли;	
	КонецЦикла;		
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьКартинкуИзФайла(Команда)
	
	Перем ВыбранноеИмя;
	Перем АдресВременногоХранилища;

	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		Режим 									= РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";		
		ДиалогОткрытияФайла.Фильтр 				= УправлениеITОтделом8УФКлиентСервер.ПолучитьФильтрИзображений();
		ДиалогОткрытияФайла.МножественныйВыбор	= Ложь;
		ДиалогОткрытияФайла.Заголовок			= НСтр("ru = 'Выберите изображение'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ВыбранноеИмя = ДиалогОткрытияФайла.ПолноеИмяФайла;
			НачатьПомещениеФайла(Новый ОписаниеОповещения("ВыбратьКартинкуИзФайлаЗавершение", ЭтотОбъект, 
				Новый Структура("АдресВременногоХранилища", АдресВременногоХранилища)), АдресВременногоХранилища, 
					ВыбранноеИмя, Ложь,);	
		КонецЕсли;
	Иначе		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Данная возможность недоступна, так как не подключено расширение работы с файлами.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзФайлаЗавершение(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
    
    Если Результат Тогда
        ПоместитьФайлОбъекта(Адрес);
        Элементы.АдресКартинки.Обновить();
		ОбновитьИзображение();
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
