////////////////////////////////////////////////////////////////////////////////
// Модуль редактирования кода.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ЗакомментироватьБлок(Форма, ЭУ, РеквезитЭУ) Экспорт
	
	НачалоСтроки = 0; НачалоКолонки = 0; КонецСтроки = 0; КонецКолонки = 0;
	
	ЭУ.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(РеквезитЭУ);
	
	ПоследняяСтрока = ТекстовыйДокумент.ПолучитьСтроку(КонецСтроки);
	ВыделеноСимволовНаПоследнейСтроке = СтрДлина(Лев(ПоследняяСтрока, КонецКолонки - 1));
	ЗакомментироватьПоследнююСтроку = Истина;
	Если (НачалоСтроки <> КонецСтроки) И ВыделеноСимволовНаПоследнейСтроке = 0 Тогда
		ЗакомментироватьПоследнююСтроку = Ложь;
	КонецЕсли;
	
	МаксимальныйОтступ = 0;
	МинимальныйОтступ = 0;
	Для Индекс = НачалоСтроки По КонецСтроки Цикл
		Строка = ТекстовыйДокумент.ПолучитьСтроку(Индекс);
		Строка = СтрЗаменить(Строка, "  ", "    ");
		СимволовСлева = СтрНайти(Строка, СокрЛП(Строка));
		МаксимальныйОтступ = Макс(СимволовСлева, МаксимальныйОтступ);
		МинимальныйОтступ = ?(МинимальныйОтступ = 0, МаксимальныйОтступ, МинимальныйОтступ);
		МинимальныйОтступ  = Мин(МаксимальныйОтступ, МинимальныйОтступ );
	КонецЦикла;
	
	ТексДляВыделения = "";
	КонСтроки = ?(ЗакомментироватьПоследнююСтроку, КонецСтроки, КонецСтроки - 1); 
	Для Индекс = НачалоСтроки По КонСтроки Цикл
		Строка = ТекстовыйДокумент.ПолучитьСтроку(Индекс);
		Строка = СтрЗаменить(Строка, "  ", "    ");
		Строка = Лев(Строка, МинимальныйОтступ-1) + "//" + Сред(Строка, МинимальныйОтступ);
		ТекстовыйДокумент.ЗаменитьСтроку(Индекс, Строка);
		ТексДляВыделения = ТексДляВыделения + Символы.ПС + Строка;
	КонецЦикла;
	
	РеквезитЭУ = ТекстовыйДокумент.ПолучитьТекст();
	
	Форма.ТекущийЭлемент = ЭУ;
	ЭУ.УстановитьГраницыВыделения(НачалоСтроки, 1, КонецСтроки + ?(ЗакомментироватьПоследнююСтроку, 1, 0), 1);
	
КонецПроцедуры

Процедура РаскомментироватьБлок(Форма, ЭУ, РеквезитЭУ) Экспорт
	
	НачалоСтроки = 0; НачалоКолонки = 0; КонецСтроки = 0; КонецКолонки = 0;
	ЭУ.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);		
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(РеквезитЭУ);
	
	ПоследняяСтрока = ТекстовыйДокумент.ПолучитьСтроку(КонецСтроки);
	ВыделеноСимволовНаПоследнейСтроке = СтрДлина(Лев(ПоследняяСтрока, КонецКолонки - 1));
	ЗакомментироватьПоследнююСтроку = Истина;
	Если (НачалоСтроки <> КонецСтроки) И ВыделеноСимволовНаПоследнейСтроке = 0 Тогда
		ЗакомментироватьПоследнююСтроку = Ложь;
	КонецЕсли;
	
	КонСтроки = ?(ЗакомментироватьПоследнююСтроку, КонецСтроки, КонецСтроки - 1); 
	Для Индекс = НачалоСтроки По КонСтроки Цикл
		Строка = ТекстовыйДокумент.ПолучитьСтроку(Индекс);
		Вхождение = СтрНайти(Строка, "//");
		Если Вхождение > 0 Тогда
			Строка = Лев(Строка, Вхождение-1) + Сред(Строка, Вхождение + 2);
		КонецЕсли; 
		ТекстовыйДокумент.ЗаменитьСтроку(Индекс, Строка);
	КонецЦикла;
	
	РеквезитЭУ = ТекстовыйДокумент.ПолучитьТекст();	
	Форма.ТекущийЭлемент = ЭУ;
	ЭУ.УстановитьГраницыВыделения(НачалоСтроки, 1, КонецСтроки + ?(ЗакомментироватьПоследнююСтроку, 1, 0), 1);
	
КонецПроцедуры

Функция ПроверитьКод(Код, СкрытыйКод, ЭУ=Неопределено, НаСервере) Экспорт
	
	Ответ = ?(НаСервере, РедактированиеКодаСервер.КодПроверитьНаСервере(Код, СкрытыйКод), КодПроверитьНаКлиенте(Код, СкрытыйКод));
	Если Ответ <> Истина Тогда
		тОш = НСтр("ru = 'Ошибка компиляции при вычислении выражения или выполнении фрагмента кода:'") + " {(";
		П = СтрНайти(Ответ, тОш);
		Если П > 0 Тогда
			Ответ = Сред(Ответ, П+СтрДлина(тОш));
			П = СтрНайти(Ответ, ")}");
			тОш = Лев(Ответ, П-1);			
			Ответ = Сред(Ответ, П+2);
			П = СтрНайти(тОш, ",");
			Если П>0 Тогда
				Попытка
					НС = Число(СтрЗаменить(СокрЛП(Лев(тОш, П-1)), Символы.НПП, ""));
					НК = Число(СтрЗаменить(СокрЛП(Сред(тОш, П+1)), Символы.НПП, ""));
					НС = НС - 1;
					тОш = ""+НС+","+НК;
					Если ЭУ <> Неопределено Тогда
						ЭУ.УстановитьГраницыВыделения(НС, НК, НС, НК);
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			Ответ = "(" + тОш + ")" + Ответ;
		КонецЕсли;		
		Возврат ?(ПустаяСтрока(Ответ), НСтр("ru = 'Неизвестная ошибка.'"), Ответ);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодПроверитьНаКлиенте(Код, СкрытыйКод)
	
	Перем Задание, Параметры;
	
	Попытка
		Выполнить("Если 1 = 2 Тогда " + СкрытыйКод + Символы.ПС + Код + Символы.ПС + "КонецЕсли;");
		Возврат Истина;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

#КонецОбласти

