
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	Если ОтображениеСостояния.Видимость = Истина
		И ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отчет не сформирован. Для отправки отчета необходимо его сформировать'"));
		Возврат;
	Иначе
		ПоказатьДиалогОтправкиПоЭлектроннойПочте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогОтправкиПоЭлектроннойПочте()
		
	АдресВложения 					= ПоместитьВоВременноеХранилище(Результат, Новый УникальныйИдентификатор());	
	ЗаголовокСохранения 			= НСтр("ru = 'Бюджетная ведомость'");		
	МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
	ПараметрыОтправкиПисьма 		= МодульРаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();	
	ПараметрыОтправкиПисьма.Тема 	= НСтр("ru = 'Бюджетная ведомость'");
	
	Вложения = Новый Массив;
	Вложение = Новый Структура();
	Вложение.Вставить("Представление", ЗаголовокСохранения);
	Вложение.Вставить("АдресВоВременномХранилище", АдресВложения);
	Вложения.Добавить(Вложение);
	ПараметрыОтправкиПисьма.Вложения = Вложения;
	
	МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправкиПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьСумму(Команда)
	
	УправлениеITОтделом8УФКлиент.ПоказатьРасчетЯчеек(ЭтотОбъект, Результат);
	
КонецПроцедуры

#КонецОбласти