
#Область ПрограммныйИнтерфейс

Функция ПолучитьУзелДляРегистрацииДанных() Экспорт

	УзелОбменаСсылка = ПланыОбмена.РасчетМетрик.НайтиПоКоду("1");

	Если Не ЗначениеЗаполнено(УзелОбменаСсылка) Тогда

		УзелОбменаОбъект = ПланыОбмена.РасчетМетрик.СоздатьУзел();

		УзелОбменаОбъект.Код          = "1";
		УзелОбменаОбъект.Наименование = НСтр("ru = 'Единый узел для регистрации всех данных для расчета метрик'");

		УзелОбменаОбъект.Записать();

		Возврат УзелОбменаОбъект.Ссылка;

	Иначе

		Возврат УзелОбменаСсылка;

	КонецЕсли;

КонецФункции

#КонецОбласти