///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Задает типы предметов взаимодействий, например: заказы, вакансии и т.п.
// Используется, если в конфигурации определен хотя бы один предмет взаимодействий. 
//
// Параметры:
//  ТипыПредметов  - Массив - предметы взаимодействий (Строка),
//                            например, "ДокументСсылка.ЗаказПокупателя" и т.п.
//
Процедура ПриОпределенииВозможныхПредметов(ТипыПредметов) Экспорт
	
	//<< УИТ
	ТипыПредметов.Добавить("СправочникСсылка.ДоговорыКонтрагентов");
	ТипыПредметов.Добавить("СправочникСсылка.ПервичныеДокументы");
	ТипыПредметов.Добавить("СправочникСсылка.Проекты");
	ТипыПредметов.Добавить("ДокументСсылка.Задание");
	ТипыПредметов.Добавить("ДокументСсылка.ЗаказПоставщику");
	ТипыПредметов.Добавить("ДокументСсылка.ЗаказКлиента");
	ТипыПредметов.Добавить("ДокументСсылка.ЕжедневныйОтчет");
	ТипыПредметов.Добавить("ДокументСсылка.ЗакреплениеСотрудников");
	ТипыПредметов.Добавить("ДокументСсылка.ИзменениеПоказателейОборудования");
	ТипыПредметов.Добавить("ДокументСсылка.Инвентаризация");
	ТипыПредметов.Добавить("ДокументСсылка.ЛистУчетаРабочегоВремени");
	ТипыПредметов.Добавить("ДокументСсылка.НарядНаРаботы");
	ТипыПредметов.Добавить("ДокументСсылка.НачалоОбслуживания");
	ТипыПредметов.Добавить("ДокументСсылка.ОкончаниеОбслуживания");
	ТипыПредметов.Добавить("ДокументСсылка.Перемещение");
	ТипыПредметов.Добавить("ДокументСсылка.ПеремещениеСотрудников");
	ТипыПредметов.Добавить("ДокументСсылка.ПланированиеБюджета");
	ТипыПредметов.Добавить("ДокументСсылка.Поступление");
	ТипыПредметов.Добавить("ДокументСсылка.ПраваДоступаКИнформационнымРесурсам");
	ТипыПредметов.Добавить("ДокументСсылка.Продажа");
	ТипыПредметов.Добавить("ДокументСсылка.РазбиениеКомплектации");	
	ТипыПредметов.Добавить("ДокументСсылка.СборкаКомплектация");
	ТипыПредметов.Добавить("ДокументСсылка.СнятиеЗакрепленияСотрудников");
	ТипыПредметов.Добавить("ДокументСсылка.СоглашениеSLA");
	ТипыПредметов.Добавить("ДокументСсылка.Списание");
	ТипыПредметов.Добавить("ДокументСсылка.УчетДенежныхСредств");
	ТипыПредметов.Добавить("ДокументСсылка.Проблема");
	//>>	
	
КонецПроцедуры

// Задает описания возможных типов контактов взаимодействий, например: партнеры, контактные лица и т.п.
// Используется, если в конфигурации определен хотя бы один тип контактов взаимодействий,
// помимо справочника Пользователи. 
//
// Параметры:
//  ТипыКонтактов - Массив - содержит описания типов контактов взаимодействий (Структура) и их свойства:
//     * Тип                               - Тип    - тип ссылки контакта.
//     * Имя                               - Строка - имя типа контакта , как оно определено в метаданных.
//     * Представление                     - Строка - представление типа контакта для отображения пользователю.
//     * Иерархический                     - Булево - признак того, является ли справочник иерархическим.
//     * ЕстьВладелец                      - Булево - признак того, что у контакта есть владелец.
//     * ИмяВладельца                      - Строка - имя владельца контакта, как оно определено в метаданных.
//     * ИскатьПоДомену                    - Булево - признак того, что контакты данного типа будет подбираться
//                                                    по совпадению домена, а не по полному адресу электронной почты.
//     * Связь                             - Строка - описывает возможную связь данного контакта с другим контактом, в
//                                                    случае когда текущий контакт является реквизитом другого контакта.
//                                                    Описывается следующей строкой "ИмяТаблицы.ИмяРеквизита".
//     * ИмяРеквизитаПредставлениеКонтакта - Строка - имя реквизита контакта, из которого будет получено
//                                                    представление контакта. Если не указано, то используется
//                                                    стандартный реквизит Наименование.
//     * ВозможностьИнтерактивногоСоздания - Булево - признак возможности интерактивного создания контакта из
//                                                    документов - взаимодействий.
//     * ИмяФормыНовогоКонтакта            - Строка - полное имя формы для создания нового контакта.
//                                                    Например, "Справочник.Партнеры.Форма.ПомощникНового".
//                                                    Если не заполнено, то открывается форма элемента по умолчанию.
//
Процедура ПриОпределенииВозможныхКонтактов(ТипыКонтактов) Экспорт

	//<< УИТ	
	Контакт = ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.ФизическиеЛица");
	Контакт.Имя = "ФизическиеЛица";
	Контакт.Представление = НСтр("ru = 'Физические лица'");
	Контакт.Иерархический = Истина;
	ТипыКонтактов.Добавить(Контакт);
	
	Контакт = ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.Сотрудники");
	Контакт.Имя = "Сотрудники";
	Контакт.Представление = НСтр("ru = 'Сотрудники'");
	Контакт.Иерархический = Истина;
	ТипыКонтактов.Добавить(Контакт);
	
	Контакт = ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.Контрагенты");
	Контакт.Имя = "Контрагенты";
	Контакт.Представление = НСтр("ru = 'Контрагенты'");
	Контакт.Иерархический = Истина;
	ТипыКонтактов.Добавить(Контакт);
	
	Контакт = ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.КонтактныеЛица");
	Контакт.Имя = "КонтактныеЛица";
	Контакт.Представление = НСтр("ru = 'Контактные лица'");
	Контакт.Иерархический = Ложь;
	Контакт.ЕстьВладелец = Истина;
	Контакт.ИмяВладельца = "Контрагенты";
	ТипыКонтактов.Добавить(Контакт);
	
	Контакт = ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.Организации");
	Контакт.Имя = "Организации";
	Контакт.Представление = НСтр("ru = 'Организации'");
	Контакт.Иерархический = Ложь;
	ТипыКонтактов.Добавить(Контакт);	
	
	Контакт = ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.ПотенциальныеКлиенты");
	Контакт.Имя = "ПотенциальныеКлиенты";
	Контакт.Представление = НСтр("ru = 'Потенциальные клиенты'");
	Контакт.Иерархический = Ложь;
	ТипыКонтактов.Добавить(Контакт);	
	//>>	

КонецПроцедуры

#КонецОбласти



