
#Область ПрограммныйИнтерфейс

Функция ПолучитьВсехПользователейПоЗаданию(Знач ЗаданиеСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СведенияОДоступностиЗаданийПользователям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(ЗаданиеСсылка);
	НаборЗаписей.Прочитать();
	
	Результат = Новый Массив;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Результат.Добавить(Запись.Пользователь);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаданиеДоступноПользователю(Пользователь, Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СведенияОДоступностиЗаданийПользователям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Возврат НаборЗаписей[0].Доступность;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции	

#КонецОбласти