#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	мВиды = Перечисления.TelegramВидыСравнения;
	Назначение = Неопределено;
	Если Параметры.Свойство("Назначение", Назначение) Тогда
		Если Назначение = "ВходящийТекст" Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мВиды.Равно);
			ДанныеВыбора.Добавить(мВиды.НеРавно);
			ДанныеВыбора.Добавить(мВиды.Содержит);
			ДанныеВыбора.Добавить(мВиды.НеСодержит);
			ДанныеВыбора.Добавить(мВиды.Заполнено);
			ДанныеВыбора.Добавить(мВиды.НеЗаполнено);
			ДанныеВыбора.Добавить(мВиды.НачинаетсяС);
			ДанныеВыбора.Добавить(мВиды.НеНачинаетсяС);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли