
#Область ПрограммныйИнтерфейс

// Возвращает контактные данные по переданному e-mail.
//
// Параметры:
//	ПочтовыйАдрес - Строка - e-mail.
//
// Возвращаемое значение:
//	Структура
//		* Адрес - Строка - адрес контакта.
//		* Представление - Строка - представление контакты.
//		* Контакт - СправочникСсылка - на контакт.
//
Функция ПолучитьКонтактыПоEMail(Знач ПочтовыйАдрес, Знач Представление = "") Экспорт
		
	МассивКонтактов = КомментарииСервер.ВзаимодействияПолучитьВсеКонтактыПоEmail(ПочтовыйАдрес);	
	Если МассивКонтактов.Количество() = 0 Тогда
		МассивКонтактов.Добавить(
			Новый Структура("Адрес, Представление, Контакт",
				ПочтовыйАдрес, ?(ПустаяСтрока(Представление), ПочтовыйАдрес, Представление), Неопределено));
	КонецЕсли;
	
	Возврат МассивКонтактов;
	
КонецФункции

#КонецОбласти