#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет состояния обслуживаний по умолчанию.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьСостоянияОбслуживанияПриПервоначальномЗаполнении() Экспорт
	
	// Описываем стуктуру
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("СтатусРемонта");
	ТЗ.Колонки.Добавить("Цвет");
	
	СЗП = Справочники.СостоянияОбслуживания;
	
	ДобавитьВТаблицуЗначений(ТЗ, СЗП.Отменен,	НСтр("ru = 'Отменен'"),		Перечисления.СтатусыРемонтов.Отменен, 	WebЦвета.Серый);
	ДобавитьВТаблицуЗначений(ТЗ, СЗП.Открыт,	НСтр("ru = 'Открыт'"),		Перечисления.СтатусыРемонтов.Открыт, 	WebЦвета.ТемноГрифельноСиний);
	ДобавитьВТаблицуЗначений(ТЗ, СЗП.Выполнен, 	НСтр("ru = 'Выполнен'"), 	Перечисления.СтатусыРемонтов.Выполнен, 	WebЦвета.Зеленый);
	ДобавитьВТаблицуЗначений(ТЗ, СЗП.ВРаботе,	НСтр("ru = 'В работе'"),	Перечисления.СтатусыРемонтов.ВРаботе, 	WebЦвета.Синий);
		
	// Записываем
	Для Каждого Строки Из ТЗ Цикл
		Объект = Строки.Объект.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Записать();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет в таблицу значений данные по заполняемым объектам.
//
// Параметры:
//   ТЗ 	- ТаблицаЗначений - таблица, куда надо добавить.
//	 Наименование - Строка - наименование элемента.
//	 Объект - Справочники.СостоянияЗаказовПоставщикам - предопределенный элемент.
//	 СтатусРемонта - ПеречислениеСсылка.СтатусыРемонтов - статусы расширенные.
//	 Цвет	- ХранилищеЗначения - цвет сохраненный в хранилище значений.
//
Процедура ДобавитьВТаблицуЗначений(ТЗ, Объект, Наименование, СтатусРемонта, Цвет)
	
	НоваяСтрока 				= ТЗ.Добавить();
	НоваяСтрока.Объект		 	= Объект;
	НоваяСтрока.Наименование 	= Наименование;
	НоваяСтрока.СтатусРемонта 	= СтатусРемонта;
	НоваяСтрока.Цвет		 	= Новый ХранилищеЗначения(Цвет);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

