
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектСсылка") Тогда
		ОбъектСсылка = Параметры.ОбъектСсылка;
		ЗаполнитьТаблицуПроблем();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроблемы

&НаКлиенте
Процедура ПроблемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение( ,Проблемы.НайтиПоИдентификатору(ВыбраннаяСтрока).Проблема);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПроблем()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПроблемаЗадания.Ссылка КАК Проблема,
		|	ПроблемаЗадания.Ссылка.Статус КАК Статус,
		|	ПроблемаЗадания.Ссылка.Приоритет КАК Приоритет,
		|	ПроблемаЗадания.Ссылка.Сервис КАК Сервис,
		|	ПроблемаЗадания.Ссылка.Категория КАК Категория,
		|	ПроблемаЗадания.Ссылка.Исполнитель КАК Исполнитель,
		|	ПроблемаЗадания.Ссылка.Организация КАК Организация,
		|	ПроблемаЗадания.Ссылка.КраткоеОписание КАК КраткоеОписание
		|ИЗ
		|	Документ.Проблема.Задания КАК ПроблемаЗадания
		|ГДЕ
		|	ПроблемаЗадания.Задание = &Задание
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроблемаЗадания.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Задание", ОбъектСсылка);		
	ТЗ = Запрос.Выполнить().Выгрузить();
	Проблемы.Загрузить(ТЗ);
	
КонецПроцедуры 	

#КонецОбласти
