
// Главная функция HTTP-сервиса. Все GET запросы выполняются здесь.
// 
// Параметры:
// 	Запрос - HTPPСервисЗапрос - Запрос HTTP.
// 
// Возвращаемое значение:
// 	HTTPСервисОтвет - ответ HTTP.
//
// Алгоритм:
//	1. Обработка запроса;
//  	1.а Чтение JSON;
// 	2. Формирование ответа;
// 		2.а Запись ответа в JSON;
// 	3. Отправление ответа.
//
Функция ZabbixAPIGET(Запрос)	
	
	GET = Запрос.HTTPMethod;
	Возврат HTTPZabbixСервис.ОбработкаЗапроса(Запрос, GET);
		
КонецФункции

// Вспомогательная функция HTTP-сервиса. Все POST запросы выполняются здесь.
// 
// Параметры:
// 	Запрос - HTPPСервисЗапрос - Запрос HTTP.
// 
// Возвращаемое значение:
// 	HTTPСервисОтвет - ответ HTTP.
//
// Алгоритм:
//	1. Обработка запроса;
//  	1.а Чтение JSON;
// 	2. Формирование ответа;
// 		2.а Запись ответа в JSON;
// 	3. Отправление ответа.
//
Функция ZabbixAPIPOST(Запрос)
	
	POST = Запрос.HTTPMethod;
	Возврат HTTPZabbixСервис.ОбработкаЗапроса(Запрос, POST);
	
КонецФункции
