
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Массив = Новый Массив;
	Массив.Добавить(ПараметрКоманды);
	
	СтруктураОтветственный = Новый Структура("ОтветственныйСотрудник", ПараметрКоманды);
	
	ОткрытьФорму("Отчет.ОстаткиНаСкладах.Форма",
		Новый Структура("КлючНазначенияИспользования, Отбор, СформироватьПриОткрытии", Массив, СтруктураОтветственный, Истина),, "ОтветственныйСотрудник=" + ПараметрКоманды, ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры
	
#КонецОбласти