#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяРеквизитаВозврата") Тогда
		ИмяРеквизитаВозврата = Параметры.ИмяРеквизитаВозврата;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Организации.Ссылка,
		|	Организации.Наименование КАК Наименование,
		|	0 КАК Порядок,
		|	Организации.ИНН,
		|	Организации.КПП
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.Наименование,
		|	1,
		|	Контрагенты.ИНН,
		|	Контрагенты.КПП
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.УчетОстатков
		|	И НЕ Контрагенты.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Наименование";	
	
		СписокТЗ = Запрос.Выполнить().Выгрузить();
		Если СписокТЗ.Количество() > 0 Тогда
			ЗначениеВДанныеФормы(СписокТЗ, Список);			
			Если Параметры.Свойство("ТекущаяОрганизация") И ЗначениеЗаполнено(Параметры.ТекущаяОрганизация) Тогда
				Отбор = Новый Структура("Ссылка", Параметры.ТекущаяОрганизация);
				МассивСтрок = Список.НайтиСтроки(Отбор);
				Если МассивСтрок.Количество() > 0 Тогда
					Элементы.Список.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные 		 = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ПустаяСтрока(ИмяРеквизитаВозврата) Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка);
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Ссылка", 			   ТекущиеДанные.Ссылка);
		Результат.Вставить("ИмяРеквизитаВозврата", ИмяРеквизитаВозврата);
	    ОповеститьОВыборе(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ПустаяСтрока(ИмяРеквизитаВозврата) Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка);
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Ссылка", 			   ТекущиеДанные.Ссылка);
		Результат.Вставить("ИмяРеквизитаВозврата", ИмяРеквизитаВозврата);
	    ОповеститьОВыборе(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти