
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УО = УсловноеОформление.Элементы;	
	УО.Очистить();
	
    ЭлементУО 						= УО.Добавить();
    ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
    ЭлементУсловия 					= ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Список.Активность");
    ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
    ЭлементУсловия.ПравоеЗначение 	= Ложь;
    ПолеОформления 					= ЭлементУО.Поля.Элементы.Добавить();
   	ПолеОформления.Поле 	    	= Новый ПолеКомпоновкиДанных("Список");
    ПолеОформления.Использование 	= Истина;
	
КонецПроцедуры

#КонецОбласти