#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Картинка.Получить() = Неопределено Тогда 
		Картинка = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;	
	
	Если Ссылка.Пустая() Тогда
		НовыйУИД = Новый УникальныйИдентификатор;
		НоваяСсылка = Справочники.Проекты.ПолучитьСсылку(НовыйУИД);
		УстановитьСсылкуНового(НоваяСсылка);		
		НавСсылка = ПолучитьНавигационнуюСсылку(НоваяСсылка, "Картинка");
	Иначе
		НавСсылка = ПолучитьНавигационнуюСсылку(ЭтотОбъект, "Картинка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Родитель = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли