#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мПериоды		= Перечисления.ПериодыПервичныхДокументов;
	мВидПериода		= Неопределено;
	Если Параметры.Отбор.Свойство("ВидПериода", мВидПериода) Тогда
		Если мВидПериода = Перечисления.ВидПериодаПервичногоДокумента.Месяц Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мПериоды.Январь);
			ДанныеВыбора.Добавить(мПериоды.Февраль);
			ДанныеВыбора.Добавить(мПериоды.Март);
			ДанныеВыбора.Добавить(мПериоды.Апрель);
			ДанныеВыбора.Добавить(мПериоды.Май);
			ДанныеВыбора.Добавить(мПериоды.Июнь);
			ДанныеВыбора.Добавить(мПериоды.Июль);
			ДанныеВыбора.Добавить(мПериоды.Август);
			ДанныеВыбора.Добавить(мПериоды.Сентябрь);
			ДанныеВыбора.Добавить(мПериоды.Октябрь);
			ДанныеВыбора.Добавить(мПериоды.Ноябрь);
			ДанныеВыбора.Добавить(мПериоды.Декабрь);
			
		ИначеЕсли мВидПериода = Перечисления.ВидПериодаПервичногоДокумента.Квартал Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мПериоды.ПервыйКвартал);
			ДанныеВыбора.Добавить(мПериоды.ВторойКвартал);
			ДанныеВыбора.Добавить(мПериоды.ТретийКвартал);
			ДанныеВыбора.Добавить(мПериоды.ЧетвертыйКвартал);
			
		Иначе			
			ДанныеВыбора = Новый СписокЗначений;			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли