
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БазовыеЦвета 	= ЗначениеИзСтрокиВнутр(ПолучитьОбщийМакет("БазовыеЦвета").ПолучитьТекст());
	
	Если Параметры.Свойство("ЦветФона") И Не ПустаяСтрока(Параметры.ЦветФона)
		И Параметры.Свойство("ЦветТекста") И Не ПустаяСтрока(Параметры.ЦветТекста) Тогда
		Попытка
			ЦветФона   = РаботаСЦветомКлиентСервер.HexВЦвет(Параметры.ЦветФона);
			ЦветТекста = РаботаСЦветомКлиентСервер.HexВЦвет(Параметры.ЦветТекста);
		Исключение
			ЦветФона   = WebЦвета.Белый;
			ЦветТекста = WebЦвета.Черный;
		КонецПопытки;		
	Иначе
		ЦветФона	= WebЦвета.Белый;
		ЦветТекста	= WebЦвета.Черный;
	КонецЕсли;	
	
	ОбновитьОбразец();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЦветФонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЦветФонаНачалоВыбораНачалоВыбораЗавершение", ЭтотОбъект), 
		БазовыеЦвета, 
		Элемент, 
		БазовыеЦвета.НайтиПоЗначению(ЦветФона));

КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаПриИзменении(Элемент)
	
	ОбновитьОбразец();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаПриИзменении(Элемент)
	
	ОбновитьОбразец();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;		
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЦветТекстаНачалоВыбораЗавершение", ЭтотОбъект), 
		БазовыеЦвета, 
		Элемент, 
		БазовыеЦвета.НайтиПоЗначению(ЦветТекста));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ЦветФона", 		ЦветФона);
	Результат.Вставить("ЦветТекста",	ЦветТекста);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОбразец()
	
	Элементы.Образец.ЦветФона 	= ЦветФона;
	Элементы.Образец.ЦветТекста = ЦветТекста;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЦветТекстаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
		ПараметрыФормы = Новый Структура("РедактируемыйЦвет", ЦветТекста);
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.ЦветТекста, , , , 
			Новый ОписаниеОповещения("ЦветТекстаНачалоВыбораЗавершение2", ЭтотОбъект, Новый Структура("Результат", Результат)),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;
	Иначе
		ЦветТекста			= Результат.Значение;
		ОбновитьОбразец();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаНачалоВыбораЗавершение2(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьОбразец();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаНачалоВыбораНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
		ПараметрыФормы = Новый Структура("РедактируемыйЦвет", ЦветФона);
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦвета", ПараметрыФормы, Элементы.ЦветФона, , , , 
			Новый ОписаниеОповещения("ЦветФонаНачалоВыбораНачалоВыбораЗавершение2", ЭтотОбъект, 
			Новый Структура("Результат", Результат)),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;
	Иначе
		ЦветФона			= Результат.Значение;
		ОбновитьОбразец();
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЦветФонаНачалоВыбораНачалоВыбораЗавершение2(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьОбразец();
	
КонецПроцедуры

#КонецОбласти