
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
    
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УО = ЭтаФорма.УсловноеОформление.Элементы;	
	УО.Очистить();
	
    ЭлементУО 						= УО.Добавить();
    ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
    ЭлементУсловия 					= ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Список.Активность");
    ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
    ЭлементУсловия.ПравоеЗначение 	= Ложь;
    ПолеОформления 					= ЭлементУО.Поля.Элементы.Добавить();
   	ПолеОформления.Поле 	    	= Новый ПолеКомпоновкиДанных("Список");
    ПолеОформления.Использование 	= Истина;
	
КонецПроцедуры

#КонецОбласти