#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мСобытиеОбслуживания= Перечисления.СобытиеОбслуживания;
	мВидСобытия			= Неопределено;
	Если Параметры.Отбор.Свойство("ВидОкончанияОбслуживания", мВидСобытия) Тогда
		Если мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ВнутреннееОбслуживание
			Или мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ВнутреннееОбслуживаниеПроизведеноСразу
			Или мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ОбслуживаниеКонтрагентом
			Или мВидСобытия = Перечисления.ВидыОкончанияОбслуживания.ОбслуживаниеКонтрагентомПроизведеноСразу Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мСобытиеОбслуживания.Списание);
			ДанныеВыбора.Добавить(мСобытиеОбслуживания.НаСклад);
		Иначе			
			ДанныеВыбора = Новый СписокЗначений;					
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли