
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Массив = Новый Массив;
	Массив.Добавить(ПараметрКоманды);
	
	ОткрытьФорму("Отчет.ИсторияКарточкиНоменклатурыПоМестамХранения.Форма",
		Новый Структура("КлючНазначенияИспользования, Отбор, СформироватьПриОткрытии", Массив, Новый Структура("Номенклатура", ПараметрКоманды), Истина),, "Номенклатура=" + ПараметрКоманды, ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

#КонецОбласти