
&НаКлиенте
// Процедура - обработчик выполнения команды
//
// Параметры:
//	ПараметрКоманды				- Произвольный	- Параметр команды
//	ПараметрыВыполненияКоманды	- Структура		- Параметры выполнения команды
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("КлючВарианта",	"ОтчетПоВсемЗвонкам");
	ОткрытьФорму("Отчет.сфпОтчетПоВсемЗвонкам.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, Новый УникальныйИдентификатор(), ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры // ОбработкаКоманды()
