#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьВидыПомещенийПриПервоначальномЗаполнении() Экспорт
	
	// Описываем стуктуру.
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("Картинка");
	
	ВД = Справочники.ВидыМестоположений;
	
	// Заполняем реквизитами.
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Здание,		"Здание", 		БиблиотекаКартинок.впЗдание);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Корпус,		"Корпус", 		БиблиотекаКартинок.впКорпус);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Коридор,		"Коридор", 		БиблиотекаКартинок.впКоридор);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Помещение,	"Помещение", 	БиблиотекаКартинок.впПомещение);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Территория,	"Территория", 	БиблиотекаКартинок.впТерритория);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Этаж,		"Этаж", 		БиблиотекаКартинок.впЭтаж);
	
	// Записываем.
	Для Каждого Строки Из ТЗ Цикл
		Объект = Строки.Объект.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Картинка = Новый ХранилищеЗначения(Строки.Картинка.Получить());
		Объект.Записать();
	КонецЦикла;

	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВТаблицуЗначений(ТЗ, Объект, Наименование, Картинка = Неопределено)
	
	НоваяСтрока 				= ТЗ.Добавить();
	НоваяСтрока.Объект		 	= Объект;
	НоваяСтрока.Наименование 	= Наименование;
	Если Картинка <> Неопределено Тогда
		НоваяСтрока.Картинка 	= Новый ХранилищеЗначения(Картинка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли