////////////////////////////////////////////////////////////////////////////////
// Подсистема "Подключаемое оборудование".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Настраивает подключаемое оборудование в форме,
//  устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма	 - 	 - Форма, в которой необходимо настроить подключаемое оборудование.
//
Процедура НастроитьПодключаемоеОборудование(Форма) Экспорт
	
	ТипыПодключенногоОборудования =  УправлениеITОтделом8УФПовтИсп.ТипыПодключенногоОборудования();
	
	Форма.ИспользоватьПодключаемоеОборудование = УправлениеITОтделом8УФПовтИсп.ИспользоватьПодключаемоеОборудование();
	
	ЕстьТСД  =
		ТипыПодключенногоОборудования <> Неопределено
		И ТипыПодключенногоОборудования.Найти(Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных) <> Неопределено;
	
	УправлениеITОтделом8УФКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ТоварыЗагрузитьДанныеИзТСД",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьТСД);
	
	УправлениеITОтделом8УФКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВыгрузитьДанныеВТСД",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьТСД);
	
КонецПроцедуры

#КонецОбласти