
#Область ПрограммныйИнтерфейс

// Выполняет запуск всех проверок на клиенте.
//
// Параметры:
//	Нет
//
Процедура Старт() Экспорт
	
	//@skip-warning
	//РезультатСтарта = СЛС.Старт();
	//Если РезультатСтарта > 0 Тогда
	//	
	//	ОткрытьФорму("ОбщаяФорма.СЛСАктивация", 
	//		Новый Структура("РезультатСтарта", РезультатСтарта),,,,, 
	//		Новый ОписаниеОповещения("СтартЗавершение", ЭтотОбъект), 
	//		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура СтартЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	//Если Результат <> Неопределено Тогда
	//	
	//	Если Результат.Свойство("НеобходимПерезапуск") Тогда
	//		ЗавершитьРаботуСистемы(Ложь, Истина);
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Если Результат.Свойство("НеобходимоЗавершениеРаботы") Тогда
	//		ЗавершитьРаботуСистемы(Ложь, Ложь);
	//		Возврат;
	//	КонецЕсли;
	//	
	//	КомпонентаЗагруженаУспешно = Результат.КомпонентаЗагруженаУспешно;
	//	ТекстСообщения = Результат.ТекстСообщения;
	//	Если ТипЗнч(КомпонентаЗагруженаУспешно) = Тип("Строка") Тогда
	//		СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения();
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Если КомпонентаЗагруженаУспешно Тогда
	//		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
	//			#Если ВебКлиент Тогда
	//				ЗавершитьРаботуСистемы(Ложь);
	//				Возврат;				
	//			#Иначе
	//			Если Вопрос(ТекстСообщения,РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
	//				ЗавершитьРаботуСистемы(Ложь);
	//				Возврат;
	//			КонецЕсли;
	//			#КонецЕсли
	//		КонецЕсли;
	//		Старт();
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Если ПустаяСтрока(ТекстСообщения) Тогда			
	//		ТекстСообщения = 
	//			НСтр("ru = '	Из-за возникших ошибок система защиты типового решения не была подключена.
	//                  |Рекомендуется исправить возникшие проблемы перед следующей попыткой запуска программы.
	//                  |(возможно вам следует заново установить систему защиты типового решения)'");
	//	КонецЕсли;
	//	
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьЗащитуЗавершение", ЭтотОбъект), 
	//		СтрШаблон(НСтр("ru = '%1
	//                        |Нажатие на кнопку ""Да"" откроет форму активации.
	//                        |Нажатие на кнопку ""Нет"" приведет к НЕМЕДЛЕННОМУ ЗАВЕРШЕНИЮ РАБОТЫ'"), ТекстСообщения),
	//			РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);		
	//Иначе
	//		
	//	Старт();
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗащитуЗавершение(РезультатВопроса, ДополнительныеПараметры1) Экспорт
    
	//ОтветПользователя = РезультатВопроса;
	//
	//Если ОтветПользователя = КодВозвратаДиалога.Отмена Тогда
	//    ЗавершитьРаботуСистемы(Ложь);
	//	Возврат;
	//ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Да Тогда
	//	// Ничего не делаем
	//Иначе
	//    ЗавершитьРаботуСистемы(Ложь);
	//    Возврат;
	//КонецЕсли;
	//
	//Старт();

КонецПроцедуры

#КонецОбласти