#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "Основной");
	Вариант.Описание = НСтр("ru = 'Информация о рейтингах по инициаторам'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "ПоПодразделениям");
	Вариант.Описание = НСтр("ru = 'Информация о рейтингах по подразделениям'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "ПоДнямНедели");
	Вариант.Описание = НСтр("ru = 'Информация о рейтингах по дням недели'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "ПоОрганизациям");
	Вариант.Описание = НСтр("ru = 'Информация о рейтингах по организациям'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "ПоПроцессам");
	Вариант.Описание = НСтр("ru = 'Информация о рейтингах по процессам'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "ПоСпособуСоздания");
	Вариант.Описание = НСтр("ru = 'Информация о рейтингах по способу создания'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "ПоТипамПроцессов");
	Вариант.Описание = НСтр("ru = 'Информация о рейтингах по типам процессов'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РейтинговыйОтчет, "Динамика");
	Вариант.Описание = НСтр("ru = 'Динамика обращений пользователей'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли