#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки 							= КомпоновщикНастроек.Настройки;
	мПользователиТекущийПользователь 	= Пользователи.ТекущийПользователь();	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокПользователейИГруппПользователей",			 
		УправлениеITОтделом8УФ.СписокПодчиненныхИГруппПользователя(мПользователиТекущийПользователь));		
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДоступностьРолиПросмотраЧужихЗаданий", 			 
		УправлениеITОтделом8УФПовтИсп.Право("ServiceDeskПросмотрЧужихЗаданий"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДоступностьРолиПросмотраНеРаспределенныхЗаданий", 
		УправлениеITОтделом8УФПовтИсп.Право("ServiceDeskПросмотрНеРаспределенныхЗаданий"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДоступностьРолиПолныеПрава", 					 
		УправлениеITОтделом8УФПовтИсп.Право("ПолныеПрава"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли