#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Интеграция1СБухфон
	Если ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.СвязатьсяСоСпециалистомОнлайнПоддержки) Тогда
		ВызовОнлайнПоддержки.ПриСозданииНаСервере(Элементы.ОбщаяКомандаЗапустить1СБухфон);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Интеграция1СБухфон
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	// СтандартныеПодсистемы.Интеграция1СБухфон
	Если Элементы.Найти("ОбщаяКомандаЗапустить1СБухфон") <> Неопределено Тогда
		ВызовОнлайнПоддержкиКлиент.ОбработкаОповещения(ИмяСобытия, Элементы.ОбщаяКомандаЗапустить1СБухфон);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Интеграция1СБухфон
	
КонецПроцедуры

#КонецОбласти



