#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет предопределенные этапы процессов.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьКанбанДоскиПриПервоначальномЗаполнении() Экспорт
	
	ГД = Справочники.ГруппыКанбанДоски;
	
	НачатьТранзакцию();
	
	Попытка
		
		Объект = Справочники.КанбанДоски.ГлавнаяДоска.ПолучитьОбъект();
		Объект.Наименование = НСтр("ru = 'Главная доска'");
		Объект.Группы.Очистить();
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.Новые;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Истина;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.ПоВыполнениюСрочностиИДате;
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.Backlog;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Ложь;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.Авто;
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.ВРаботе;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Ложь;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.ПоВыполнениюСрочностиИДате;
		
		НоваяСтрока 						= Объект.Группы.Добавить();
		НоваяСтрока.Группа 					= ГД.Выполненные;
		НоваяСтрока.ИспользоватьЛимитЗадач 	= Истина;
		НоваяСтрока.ЛимитЗадач 				= 50;
		НоваяСтрока.Сортировка				= Перечисления.СортировкаКанбанДоски.ПоДатеПоследнегоИзмененияПоУбыванию;
		
		Объект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли