
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ПустаяСтрока(ЦветФона) Тогда
		
		ЦветФона 	= РаботаСЦветомКлиентСервер.ЦветВHex(РаботаСЦветомКлиентСервер.СлучайныйЦвет());
		ЦветТекста 	= РаботаСЦветомКлиентСервер.ЦветВHex(РаботаСЦветомКлиентСервер.КонтрастныйЦвет(ЦветФона));
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти
	
#КонецЕсли