#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗафиксироватьВыполнениеПравила(Знач Правило, Знач СозданныйОбъект, Знач Действие,
	Знач ДатаВыполнения = Неопределено, Знач Результат = "", Знач ТипСобытия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ВыполнениеПравилСобытий.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Правило				= Правило;
	МенеджерЗаписи.СозданныйОбъект		= СозданныйОбъект;
	МенеджерЗаписи.Действие				= Действие;
	Если ДатаВыполнения = Неопределено Тогда
		МенеджерЗаписи.ДатаВыполнения	= ТекущаяДатаСеанса();
	Иначе
		МенеджерЗаписи.ДатаВыполнения	= ДатаВыполнения;
	КонецЕсли;	
	МенеджерЗаписи.Результат			= Результат;
	МенеджерЗаписи.КлючУникальности		= Новый УникальныйИдентификатор;
	Если ЗначениеЗаполнено(ТипСобытия) Тогда
		МенеджерЗаписи.ТипСобытия 		= ТипСобытия;
	КонецЕсли;	
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли