////////////////////////////////////////////////////////////////////////////////
// Работа с трудозатратами на клиенте.
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Обновляет список выбора элемента формы и заполняет его временем.
//
// Параметры:
//	ЭлементФормы - Элемент - элемент, выпадающий список выбора которого будет заполнен.
//	ДатаНачала - ДатаВремя - дата с которой надо начать. 
//
Процедура ОбновитьСписокВыбораВремени(ЭлементФормы, Знач ДатаНачала) Экспорт
	
	мДатаНачала = НачалоДня(ДатаНачала);
	ЭлементФормы.СписокВыбора.Очистить();		
	НачалоПериода = 7 * 3600;	
	КонецПериода = 19 * 3600;
	Сек = НачалоПериода;
	Пока Сек <= КонецПериода Цикл
		мДатаНачала = мДатаНачала + Сек;
		Если мДатаНачала >= ДатаНачала Тогда
			ЭлементФормы.СписокВыбора.Добавить(мДатаНачала);
		КонецЕсли;
		Сек = Сек + 600;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает строку с описание затрат времени.
//
// Параметры:
//	Длительность - Число - число секунд, которые необходим перевести в строку.
//
// Возвращаемое значение:
//	Строка - Строковое представление во времени секунд.
//
Функция РассчитатьЗатратыВремени(Знач Длительность) Экспорт
	
	ЗатратыВремени = "";
	
	Если Длительность >= 0 Тогда
		Дней = Цел(Длительность / 86400);		
		Час  = Цел((Длительность  - Дней * 86400) / 3600);			
		Мин  = Окр((Длительность - Дней * 86400 - Час * 3600) / 60);
		Если Мин = 60 Тогда		
			Час = Час + 1;
			Мин = 0;
		КонецЕсли;		
		Если Час = 24 Тогда
			Дней = Дней + 1;
			Час = 0;
		КонецЕсли;
		Если Цел(Дней) > 0 Тогда
				ЗатратыВремени = "00:00";			
		Иначе
				ЗатратыВремени = УправлениеITОтделом8УФКлиентСервер.ЧислоВоВремя(Длительность);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗатратыВремени;
	
КонецФункции

#КонецОбласти