#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("ИгнорироватьЗапись") Тогда
		Возврат;
	КонецЕсли;
    
	Если ЗначениеЗаполнено(Идентификатор) И ДополнительныеСвойства.Свойство("ИгнорированиеПроверок") = Ложь Тогда
        ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нельзя изменять ключевые реквизиты предопределенных элеметов дел'"));
        Отказ = Истина;
        Возврат;
	КонецЕсли;
    
	мТекДата = ТекущаяДатаСеанса();
	
	// Даты.
	Если ДатаСоздания = Дата(1, 1, 1) Тогда
		ДатаСоздания = мТекДата;
	КонецЕсли;
	ДатаВыполнения 		= ?(Выполнено = Истина, мТекДата, Дата(1, 1, 1));
	ДатаКорректировки 	= мТекДата;
		
	ИспользоватьСтиль = НЕ ПустаяСтрока(Стиль);
	
	Если ЭтоПапка = Истина Тогда
		Выполнено = Ложь;
	КонецЕсли;
		
	Если ЭтоНовый() Тогда
		Важность 	= 100;
		Срочность 	= 100;
		Усилие		= 100;
		Обзор		= Ложь;
		ОбзорКаждые = 1;
		ОбзорПериод = 1;
		Картинка	= -1;
        ВидЦели     = Перечисления.ВидЦелиДела.Нет;
        СтатусПроекта = Перечисления.СтатусыПроектовДел.НеНачался;
    	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
    		Пользователь = Пользователи.ТекущийПользователь();
    	КонецЕсли;
	КонецЕсли;
	
	ЕстьОписание = НЕ ПустаяСтрока(Описание);
	ЕстьКонтексты = Контексты.Количество() > 0;
	
	ОбзорКаждыеСтрокой = Формат(ОбзорКаждые, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") + " ";
	Если ОбзорПериод = 0 Тогда
		ОбзорКаждыеСтрокой = ОбзорКаждыеСтрокой + НСтр("ru = 'дн.'");
	ИначеЕсли ОбзорПериод = 1 Тогда
		ОбзорКаждыеСтрокой = ОбзорКаждыеСтрокой + НСтр("ru = 'нед.'");
	ИначеЕсли ОбзорПериод = 2 Тогда
		ОбзорКаждыеСтрокой = ОбзорКаждыеСтрокой + НСтр("ru = 'мес.'");
	КонецЕсли;
	    
    #Область ИзменениеЭтоПроект    
    // Перезаписываем реквизит "ЭтоПроект"
    Если ЭтоНовый() ИЛИ Ссылка.ЭтоПроект <> ЭтоПроект Тогда
        
        Если ЭтоНовый() Тогда
        	Проект = Родитель.Проект;
        Иначе            
            Запрос = Новый Запрос();
            Запрос.УстановитьПараметр("Ссылка", Ссылка);
            Если ЭтоПроект = Истина Тогда
                Запрос.Текст =
                    "ВЫБРАТЬ
                    |   Дела.Ссылка КАК Ссылка,
                    |   Дела.ЭтоПроект КАК ЭтоПроект,
                    |   Дела.Родитель КАК Родитель
                    |ИЗ
                    |   Справочник.Дела КАК Дела
                    |ГДЕ
                    |   Дела.ПометкаУдаления = ЛОЖЬ
                    |   И Дела.Ссылка В ИЕРАРХИИ(&Ссылка)
                    |   И Дела.Ссылка <> &Ссылка
                    |
                    |УПОРЯДОЧИТЬ ПО
                    |   Ссылка ИЕРАРХИЯ";
                
                МассивИгнорируемыхДел = Новый Массив;
                Выборка = Запрос.Выполнить().Выбрать();
                Пока Выборка.Следующий() Цикл
                    
                    Если Выборка.ЭтоПроект Тогда
                        Об          = Выборка.Ссылка.ПолучитьОбъект();
                        Об.Проект   = Ссылка;
                        ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                        Об.Записать();                    
                    	МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                    Иначе
                        Если МассивИгнорируемыхДел.Найти(Выборка.Родитель) <> Неопределено Тогда
                        	МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                        Иначе
                            Об          = Выборка.Ссылка.ПолучитьОбъект();
                            Об.Проект   = Ссылка;
                            ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                            Об.Записать();                    
                        КонецЕсли; 
                    КонецЕсли; 
                                
                КонецЦикла;
            Иначе
                Запрос.Текст =
                    "ВЫБРАТЬ
                    |   Дела.Ссылка КАК Ссылка
                    |ИЗ
                    |   Справочник.Дела КАК Дела
                    |ГДЕ
                    |   Дела.ПометкаУдаления = ЛОЖЬ
                    |   И Дела.Проект = &Ссылка";
                
                Выборка = Запрос.Выполнить().Выбрать();
                Пока Выборка.Следующий() Цикл
                    Об          = Выборка.Ссылка.ПолучитьОбъект();
                    Об.Проект   = Проект;
                    ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                    Об.Записать();                    
                КонецЦикла;                
            КонецЕсли; 
        	
        КонецЕсли; 
                   
    КонецЕсли;
    #КонецОбласти
    
    #Область ИзменениеРодитель
    Если ЭтоНовый() = Ложь И Ссылка.Родитель <> Родитель Тогда
		
		Если ЗначениеЗаполнено(Родитель) Тогда
        	РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, "ЭтоПроект,Проект");
  	    	Проект = ?(РеквизитыРодителя.ЭтоПроект, Родитель, РеквизитыРодителя.Проект);
	  	Иначе
			Если ЭтоПроект = Ложь Тогда
				Проект = Справочники.Дела.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
        
        Запрос = Новый Запрос();
        Запрос.УстановитьПараметр("Ссылка", Ссылка);
        Запрос.Текст =
            "ВЫБРАТЬ
            |   Дела.Ссылка КАК Ссылка,
            |   Дела.ЭтоПроект КАК ЭтоПроект,
            |   Дела.Родитель КАК Родитель
            |ИЗ
            |   Справочник.Дела КАК Дела
            |ГДЕ
            |   Дела.ПометкаУдаления = ЛОЖЬ
            |   И Дела.Ссылка В ИЕРАРХИИ(&Ссылка)
            |   И Дела.Ссылка <> &Ссылка
            |
            |УПОРЯДОЧИТЬ ПО
            |   Ссылка ИЕРАРХИЯ";
        
        Выборка = Запрос.Выполнить().Выбрать();
        Если ЭтоПроект = Ложь Тогда
                        
            МассивИгнорируемыхДел = Новый Массив;
            Пока Выборка.Следующий() Цикл
                
                Если Выборка.ЭтоПроект Тогда
                    МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                Иначе
                    Если МассивИгнорируемыхДел.Найти(Выборка.Родитель) <> Неопределено Тогда
                        МассивИгнорируемыхДел.Добавить(Выборка.Ссылка);
                    Иначе
                        Об          = Выборка.Ссылка.ПолучитьОбъект();
                        Об.Проект   = Проект;
                        ДополнительныеСвойства.Вставить("ИгнорироватьЗапись", Истина);
                        Об.Записать();                    
                    КонецЕсли; 
                КонецЕсли; 
                            
            КонецЦикла;
            
            Выборка.Сбросить();
        КонецЕсли;
        
    КонецЕсли;
    #КонецОбласти
		
	ДополнительныеСвойства.Вставить("НеВыполнятьПравилаСобытий", Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли