
#Область ПроцедурыИФункцииПодсистемыЗаработнаяПлата

// Функция определяет вводился ли раннее элемент расчета или вид начисления
//
// ЗначениеИдентификатора (Строка) - значение реквизита Идентификатор элемента справочника ПараметрыРасчетов
//
Функция ПараметрРасчетаСуществует(Идентификатор) Экспорт
	
	Если ПустаяСтрока(Идентификатор)Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Не Справочники.ПараметрыРасчетов.НайтиПоРеквизиту("Идентификатор", Идентификатор) = Справочники.ПараметрыРасчетов.ПустаяСсылка();
	
КонецФункции // ПараметрРасчетаСуществует()

// Функция определяет вводился ли раннее элемент вида начисления или удержания
//
// Наименование (Строка) - значение реквизита Наименование элемента справочника ВидыНачисленийИУдержаний
//
Функция ВидНачисленияУдержанияСуществует(Идентификатор) Экспорт
	
	Если ПустаяСтрока(Идентификатор) Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Не Справочники.ВидыНачисленийИУдержаний.НайтиПоРеквизиту("Идентификатор", Идентификатор) = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
	
КонецФункции

#КонецОбласти