
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорииБазыЗнанийПриАктивизацииСтроки(Элемент)
	
	Если Элементы.КатегорииБазыЗнаний.ТекущиеДанные = Неопределено Тогда
		
		РаботаСОтборамиКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Категории.Категория");
		
	Иначе	
		
		РаботаСОтборамиКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Категории.Категория");
		РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Категории.Категория", 
			Элементы.КатегорииБазыЗнаний.ТекущиеДанные.Ссылка, ,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорииБазыЗнанийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорииБазыЗнанийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти