#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, "ПоВидамРабот");
	Вариант.Описание = НСтр("ru = 'Учет времени по видам работ'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, "СтатистикаПоВидамРабот");
	Вариант.Описание = НСтр("ru = 'Статистика затрат времени по видам работ'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, "ПоПодразделениям");
	Вариант.Описание = НСтр("ru = 'Учет времени по подразделениям'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, "ПоПроектам");
	Вариант.Описание = НСтр("ru = 'Учет времени по проектам'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, "Детализация");
	Вариант.Описание = НСтр("ru = 'Детализация по учету времени'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, "СтатистикаПоПроектам");
	Вариант.Описание = НСтр("ru = 'Статистика затрат времени по проектам'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, 
		"ДинамикаРабочегоВремениПоМесяцам");
	Вариант.Описание = НСтр("ru = 'Динамика рабочего времени (по месяцам)'");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.УчетВремени, 
		"ДинамикаРабочегоВремениПоДням");
	Вариант.Описание = НСтр("ru = 'Динамика рабочего времени (по дням)'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли