#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокПодчиненных", 								 
		УправлениеITОтделом8УФ.СписокПодчиненныхПользователей(Пользователи.ТекущийПользователь()));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДоступностьРолиПолныеПрава", 					 
		УправлениеITОтделом8УФПовтИсп.Право("ПолныеПрава"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли