
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПараметрыРасчетов() Экспорт // Заполнение параметров расчетов
	
	// Фиксированная сумма
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("ФиксированнаяСумма") Тогда
		
		ПараметрРасчетовФиксированнаяСумма = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовФиксированнаяСумма.Наименование 				= НСтр("ru = 'Фиксированная сумма'");
		ПараметрРасчетовФиксированнаяСумма.Идентификатор 	 			= "ФиксированнаяСумма";
		ПараметрРасчетовФиксированнаяСумма.Записать();

	КонецЕсли;
	
	// Норма дней
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("НормаДней") Тогда 
		
		ПараметрРасчетовНормаДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаДней.Наименование							= НСтр("ru = 'Норма дней (производственный календарь)'");
		ПараметрРасчетовНормаДней.Идентификатор							= "НормаДней";
		ПараметрРасчетовНормаДней.Записать();
		
	КонецЕсли;
	
	// Норма часов
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("НормаЧасов") Тогда 
		
		ПараметрРасчетовНормаЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаЧасов.Наименование							= НСтр("ru = 'Норма часов (производственный календарь)'");
		ПараметрРасчетовНормаЧасов.Идентификатор						= "НормаЧасов";
		ПараметрРасчетовНормаЧасов.Записать();
		
	КонецЕсли;
	
	// Норма дней по графику
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("НормаДнейГрафикСотрудника") Тогда 
		
		ПараметрРасчетовНормаДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаДней.Наименование							= НСтр("ru = 'Норма дней (график работы сотрудника)'");
		ПараметрРасчетовНормаДней.Идентификатор							= "НормаДнейГрафикСотрудника";
		ПараметрРасчетовНормаДней.Записать();
		
	КонецЕсли;
	
	// Норма часов по графику
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("НормаЧасовГрафикСотрудника") Тогда 
		
		ПараметрРасчетовНормаЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовНормаЧасов.Наименование							= НСтр("ru = 'Норма часов (график работы сотрудника)'");
		ПараметрРасчетовНормаЧасов.Идентификатор						= "НормаЧасовГрафикСотрудника";
		ПараметрРасчетовНормаЧасов.Записать();
		
	КонецЕсли;
	
	// Отработано дней
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("ОтработаноДней") Тогда
		
		ПараметрРасчетовОтработаноДней = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовОтработаноДней.Наименование						= НСтр("ru = 'Отработано дней'");
		ПараметрРасчетовОтработаноДней.Идентификатор					= "ОтработаноДней";
		ПараметрРасчетовОтработаноДней.Записать();
		
	КонецЕсли;
	
	// Отработано часов
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("ОтработаноЧасов") Тогда
		
		ПараметрРасчетовОтработаноЧасов = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовОтработаноЧасов.Наименование 	   = НСтр("ru = 'Отработано часов'");
		ПараметрРасчетовОтработаноЧасов.Идентификатор 	   = "ОтработаноЧасов";
		ПараметрРасчетовОтработаноЧасов.Записать();
		
	КонецЕсли;
	
	// Тарифная ставка
	Если Не ЗаработнаяПлатаСервер.ПараметрРасчетаСуществует("ТарифнаяСтавка") Тогда
		
		ПараметрРасчетовТарифнаяСтавка = Справочники.ПараметрыРасчетов.СоздатьЭлемент();
		ПараметрРасчетовТарифнаяСтавка.Наименование 	  = НСтр("ru = 'Тарифная ставка'");
		ПараметрРасчетовТарифнаяСтавка.Идентификатор 	  = "ТарифнаяСтавка";
		ПараметрРасчетовТарифнаяСтавка.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли