#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если ВидимостьШаблона = Перечисления.ВидимостьШаблонов.ГруппыПользователей Тогда
		Если НЕ ЗначениеЗаполнено(ВладелецШаблона) 
			ИЛИ ТипЗнч(ВладелецШаблона) <> Тип("СправочникСсылка.ГруппыПользователей") Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.ВладелецШаблона",
				НСтр("ru = 'Не заполнен вледелец шаблона.'"),
				"");
				
		КонецЕсли;
	КонецЕсли;
	
	Если ВидимостьШаблона = Перечисления.ВидимостьШаблонов.Личный Тогда
		Если НЕ ЗначениеЗаполнено(ВладелецШаблона) 
			ИЛИ ТипЗнч(ВладелецШаблона) <> Тип("СправочникСсылка.Пользователи") Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.ВладелецШаблона",
				НСтр("ru = 'Не заполнен вледелец шаблона.'"),
				"");
				
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли