
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Родитель = Справочники.Дела.Inbox();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки.Получить("УмныйАнализВвода") = Неопределено Тогда
		ВводНесколькихЗадач = Истина;
		НаследоватьРодительскиеКонтексты = Истина;
		УмныйАнализВвода = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДела(Команда)
	
	Форма = ПолучитьФорму("Справочник.Дела.ФормаСписка");
	Если Форма.Открыта() Тогда
		Форма.Активизировать();
	Иначе
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДела(Команда)
	
	// Добавляем дела
	СозданиеДел();
	
	Оповестить("Запись_БыстрогоВводаДел");
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СозданиеДел()
	
	УправлениеДелами.БыстрыйВводДел(Родитель, Текст, ВводНесколькихЗадач, УмныйАнализВвода, НаследоватьРодительскиеКонтексты);
	
КонецПроцедуры

#КонецОбласти

