
#Область ПрограммныйИнтерфейс

//Пример:
//Если ИмяИсточника = "Документ.Задание" Тогда
//	Результат.Добавить("Комментарий");
//КонецЕсли;
//
//@skip-warning
Процедура СписокРеквизитовИсключенийПоИмениИсточника(Знач ИмяИсточника, Результат) Экспорт
			
КонецПроцедуры

//Пример:
//Если ИмяИсточника = "Документ.Задание" Тогда
//	Результат.Добавить("[Комментарий]");
//КонецЕсли;
//
//@skip-warning
Процедура СписокВычисляемыхРеквизитовПоИмениИсточника(Знач ИмяИсточника, Результат) Экспорт
	
КонецПроцедуры

//Пример:
//Если ИмяИсточника = "Документ.Задание" Тогда
//	Результат.МассивПользовательскихРеквизитов("Родитель");
//КонецЕсли;
//
//@skip-warning
Процедура ДополнитьМассивРеквизитовОснования(Знач ИмяИсточника, МассивПользовательскихРеквизитов) Экспорт
	
КонецПроцедуры

//Пример:
//Если Источник.Метаданные().ПолноеИмя() = "Документ.Задание" Тогда
//	СоответствиеРеквизитЗначение.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
//КонецЕсли;
//
//@skip-warning
Процедура ДополнитьСоответствиеРеквизитЗначениеИсточника(Знач Источник, Знач СтруктураПередЗаписью, 
	СоответствиеРеквизитЗначение, МассивВычисляемыхРеквизитов) Экспорт
	
КонецПроцедуры	

#КонецОбласти