
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ОбновитьВидимостьСтраницы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантРасчетаПриИзменении(Элемент)
	
	ОбновитьВидимостьСтраницы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДниНедели(Команда)
	
	ЗаполнитьДниНеделиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПриоритетам(Команда)
	
	ЗаполнитьПоПриоритетамНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьСтраницы()
	
	Если НЕ ЗначениеЗаполнено(Объект.ВариантРасчета) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Нет;
		Возврат;
	КонецЕсли;
	
	ЗначениеПеречисления = Объект.ВариантРасчета;
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	ИмяВкладки = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;	
	Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяВкладки];
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДниНеделиНаСервере()
	
	Объект.ДниНедели.Очистить();
	Для Каждого Эл Из Метаданные.Перечисления.ДниНедели.ЗначенияПеречисления Цикл
		НоваяСтрока = Объект.ДниНедели.Добавить();
		НоваяСтрока.ДеньНедели = Перечисления.ДниНедели[Эл.Имя];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПриоритетамНаСервере()
	
	Объект.Приоритеты.Очистить();
	Для Каждого Эл Из Метаданные.Перечисления.ПриоритетЗадания.ЗначенияПеречисления Цикл
		НоваяСтрока = Объект.Приоритеты.Добавить();
		НоваяСтрока.Приоритет = Перечисления.ПриоритетЗадания[Эл.Имя];
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти
