////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
// Обработчик события ОбработкаЗаписиНового.
//
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.ТекущаяСтрока = НовыйОбъект;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события Действие команды КомандаПодборИзКлассификатора.
//
Процедура ПодобратьИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторЕдиницИзмерения.Форма.КлассификаторЕдиницИзмерения",,,,,, Новый ОписаниеОповещения("ПодобратьИзКлассификатораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы.Список.Обновить();
    
КонецПроцедуры


