////////////////////////////////////////////////////////////////////////////////
// Модуль для генерации HTML-документов с использованием Bootstrap.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает текст из двоичных данных.
//
// Параметры:
//	
//
// Возвращаемое значение:
//	
//
Функция ПолучитьТекстИзДвоичныхДанных(Знач Данные) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		Возврат Данные;
	ИначеЕсли ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		Возврат "";
	КонецЕсли;
	
    Возврат ПолучитьСтрокуИзДвоичныхДанных(Данные);
	
КонецФункции

// Функция - Тип файла
//
// Параметры:
//  ИмяФайла - Строка	 - имя файла.
// 
// Возвращаемое значение:
//  Строка - тип файла по MIME/
//
Функция ТипФайла(Знач ИмяФайла) Экспорт
	
	Перем тТип, чСтрок;
	тТип = СтрЗаменить(ИмяФайла, ".", Символы.ПС);
	чСтрок = СтрЧислоСтрок(тТип);
	Если чСтрок<2 Тогда
		Возврат "";
	КонецЕсли;
	тТип = НРег(СтрПолучитьСтроку(тТип, чСтрок));
	
	Если тТип="htm" ИЛИ тТип="html" Тогда
		
		Возврат "text/html";
		
	ИначеЕсли тТип="css" Тогда
		
		Возврат "text/css";
		
	ИначеЕсли тТип="js" ИЛИ тТип="javascript" Тогда
		
		Возврат "text/JavaScript";
		
	ИначеЕсли тТип="ico" Тогда
		
		Возврат "image/ico";
		
	ИначеЕсли тТип="png" Тогда
		
		Возврат "image/png";
		
	ИначеЕсли тТип="jpg" ИЛИ тТип="jpeg" ИЛИ тТип="jpe" Тогда
		
		Возврат "image/jpeg";
		
	ИначеЕсли тТип="gif" Тогда
		
		Возврат "image/gif";
		
	ИначеЕсли тТип="tiff" ИЛИ тТип="tif" Тогда
		
		Возврат "image/tiff";
		
	ИначеЕсли тТип="svg" Тогда
		
		Возврат "image/SVG";
		
	ИначеЕсли тТип="bmp" Тогда
		
		Возврат "image/BMP";
		
	ИначеЕсли тТип="pdf" ИЛИ тТип="rtf" ИЛИ тТип="zip" Тогда
		
		Возврат "application/"+тТип;
		
	ИначеЕсли тТип="txt" Тогда
		
		Возврат "text/plain";
		
	ИначеЕсли тТип="aif" ИЛИ тТип="aiff" ИЛИ тТип="aifc" Тогда
		
		Возврат "audio/x-aiff";
		
	ИначеЕсли тТип="wav" Тогда
		
		Возврат "audio/x-wav";
		
	ИначеЕсли тТип="pdf" ИЛИ тТип="rtf" ИЛИ тТип="zip" Тогда
		
		Возврат "application/"+тТип;
				
	ИначеЕсли тТип="doc" ИЛИ тТип="docx" Тогда
	
		Возврат "application/msword";
	
	ИначеЕсли тТип="xls" ИЛИ тТип="xlsx" ИЛИ тТип="mxl" Тогда
	
		Возврат "application/vnd.ms-excel";
		
	ИначеЕсли тТип="swf" Тогда
		
		Возврат "application/x-shockwave-flash";
		
	ИначеЕсли тТип="pps" ИЛИ тТип="ppt" Тогда
		
		Возврат "application/vnd.ms-powerpoint"
		
	ИначеЕсли тТип="msg" Тогда
		
		Возврат "application/vnd.ms-outlook"
		
	ИначеЕсли тТип="mpeg" ИЛИ тТип="mpg" ИЛИ тТип="mpe" Тогда
		
		Возврат "video/mpeg";
		
	ИначеЕсли тТип="qt" ИЛИ тТип="mov" Тогда
		
		Возврат "video/quicktime";
		
	ИначеЕсли тТип="avi" Тогда
		
		Возврат "video/x-msvideo";
		
	ИначеЕсли тТип="movie" Тогда
		
		Возврат "video/x-sgi-movie";
		
	ИначеЕсли тТип="eot" Тогда
		
		Возврат "application/vnd.ms-fontobject";
		
	ИначеЕсли тТип="ttf" Тогда
		
		Возврат "application/x-font-ttf";
		
	ИначеЕсли тТип="woff" Тогда
		
		Возврат "application/font-woff";
		
	ИначеЕсли тТип="woff2" Тогда
		
		Возврат "application/font-woff";
		
	КонецЕсли;
	
	Возврат "application/unknown";
	
КонецФункции

#КонецОбласти