#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСвязьПервичногоДокумента(Знач ПервичныйДокумент, Знач ОбъектСсылка) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи 					= РегистрыСведений.СвязьПервичныхДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПервичныйДокумент= ПервичныйДокумент;
	МенеджерЗаписи.Объект			= ОбъектСсылка;
	МенеджерЗаписи.Дата				= ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь		= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьСвязьПервичногоДокумента(Знач ПервичныйДокумент, Знач ОбъектСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи 					= РегистрыСведений.СвязьПервичныхДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПервичныйДокумент= ПервичныйДокумент;
	МенеджерЗаписи.Объект			= ОбъектСсылка;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли