#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(Автор) Тогда
			Автор = Пользователи.ТекущийПользователь();
		КонецЕсли;
		Если ДатаСоздания = Дата(1, 1, 1) Тогда
			ДатаСоздания = ТекущаяДатаСеанса();
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(АвторКорректировки) Тогда
			АвторКорректировки = Пользователи.ТекущийПользователь();
		КонецЕсли;
		Если ДатаКорректировки = Дата(1, 1, 1) Тогда
			ДатаКорректировки = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли