#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьСозданныйОбъект(Знач УчетнаяЗаписьЭлектроннойПочты, Знач ИдентификаторСообщения, Знач ДатаСоздания) Экспорт
	
	МенеджерЗаписи									= РегистрыСведений.СозданныеОбъектыНаОснованииВходящихПисем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетнаяЗаписьЭлектроннойПочты 	= УчетнаяЗаписьЭлектроннойПочты;
	МенеджерЗаписи.ИдентификаторСообщения 			= ИдентификаторСообщения;
	МенеджерЗаписи.ДатаСоздания 					= ДатаСоздания;
	МенеджерЗаписи.Записать();		
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли