#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мВидыОпераций	= Перечисления.ВидДокументаУчетДенежныхСредств;
	мВидОперации	= Неопределено;
	
	Если Параметры.Отбор.Свойство("ВидДвиженияДенежныхСредств", мВидОперации) Тогда
		Если мВидОперации = Перечисления.ВидыДоходовРасходов.Доход Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мВидыОпераций.ОплатаПокупателя);			
			ДанныеВыбора.Добавить(мВидыОпераций.ВозвратПоставщика);
			ДанныеВыбора.Добавить(мВидыОпераций.ПрочийДоход);
		ИначеЕсли мВидОперации = Перечисления.ВидыДоходовРасходов.Расход Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мВидыОпераций.ВозвратПокупателю);
			ДанныеВыбора.Добавить(мВидыОпераций.ЗаработнаяПлата);
			ДанныеВыбора.Добавить(мВидыОпераций.ОплатаПоставщику);
			ДанныеВыбора.Добавить(мВидыОпераций.ПрочийРасход);
		Иначе			
			ДанныеВыбора = Новый СписокЗначений;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли