
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Ссылка", ПланыОбмена.МобильноеПриложение.ЭтотУзел());
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПользователяМобильногоПриложения(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПользовательУзла = ТекущиеДанные.Пользователь;
	НастройкиПользователя = НастройкиПользователяМобильногоПриложенияНаСервере(ПользовательУзла);
	ПараметрыФормы   = Новый Структура("Ключ", НастройкиПользователя);
	ОткрытьФорму("Справочник.ПользователиМобильныхПриложений.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НастройкиПользователяМобильногоПриложенияНаСервере(Пользователь)
	
	Возврат ОбменМобильноеПриложениеПовтИсп.НастройкиПользователяМобильногоПриложения(Пользователь);
	
КонецФункции	

#КонецОбласти