////////////////////////////////////////////////////////////////////////////////
// КОД ПРОЦЕДУР И ФУНКЦИЙ модуля ДатыЗапретаИзмененияПереопределяемый.
// для поддержки библиотечного подхода разработки.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  НастройкиРаботыИнтерфейса	 - Структура	 - содержит все настройки интерфейса.
//
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Истина;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  ИсточникиДанных	 - Таблица	 - таблица формы.
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	УИТ = "УправлениеITОтделом8УФ";
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПланированиеБюджета"					, "Дата", УИТ, "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПоказателейОборудования"	, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакреплениеСотрудников"				, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеСотрудников"				, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СнятиеЗакрепленияСотрудников"		, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УчетДенежныхСредств"					, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику"						, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Поступление"							, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Перемещение"					 , "Дата", УИТ, "ОрганизацияРасхода");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Списание"							, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачалоОбслуживания"					, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОкончаниеОбслуживания"				, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Продажа"								, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СборкаКомплектация"					, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РазбиениеКомплектации"				, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Инвентаризация"						, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СоглашениеSLA"						, "Дата", УИТ, "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НарядНаРаботы"						, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Доверенность"						, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПраваДоступаКИнформационнымРесурсам"	, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЛистУчетаРабочегоВремени"			, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЕжедневныйОтчет"						, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Проблема"							, "Дата", УИТ, "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаЗначенийМетрик"				, "Дата", УИТ, "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПричиныОтклоненияОтГрафика"			, "Дата", УИТ, "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаЦенУслуг"					, "Дата", УИТ, "");
	
КонецПроцедуры

Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "УправлениеITОтделом8УФ";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("6e3fec34-6af1-4ec3-ab66-def220d7b59e");
	Раздел.Представление = НСтр("ru = 'Управление IT Отделом 8'");
	
КонецПроцедуры	

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  Объект						 - 	 - 
//  СтандартнаяОбработка		 - 	 - 
//  ПроверятьПриОбменеДанными	 - 	 - 
//
//@skip-warning
Процедура ПередПроверкойЗапретаИзменения(Объект, СтандартнаяОбработка, ПроверятьПриОбменеДанными) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти