#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьУзелОбмена(КодМобильногоКлиента, Пользователь) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	УзелОбмена = ПланыОбмена.МобильноеПриложение.НайтиПоКоду(КодМобильногоКлиента); 
	Если УзелОбмена.Пустая() Тогда
		
		УзелОбъект = ПланыОбмена.МобильноеПриложение.СоздатьУзел();
		УзелОбъект.Код          = КодМобильногоКлиента;
		УзелОбъект.Наименование = СтрШаблон("%1(%2)", Строка(Пользователь), Строка(КодМобильногоКлиента));
		УзелОбъект.Пользователь = Пользователь;
		УзелОбъект.ДатаСоздания = ТекущаяДатаСеанса();
		УзелОбъект.Записать();
		
		НоваяОчередь = Справочники.ОчередьСообщенийОбменаМобильноеПриложение.СоздатьЭлемент();
		НоваяОчередь.Наименование = Строка(Пользователь);
		НоваяОчередь.Записать();
		
		МенеджерЗаписиОчередей = РегистрыСведений.ОчередиСообщенийОбменаМобильноеПриложение.СоздатьМенеджерЗаписи();
		МенеджерЗаписиОчередей.МобильныйКлиент = УзелОбъект.Ссылка;
		МенеджерЗаписиОчередей.Очередь         = НоваяОчередь.Ссылка;
		МенеджерЗаписиОчередей.Записать();

		УзелОбмена = УзелОбъект.Ссылка;

	КонецЕсли;

	Возврат УзелОбмена;

КонецФункции

#КонецОбласти

#КонецЕсли