
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	// Проверка на ошибки.
	СписокОшибок = ПроверитьСправочникПередПроведением();
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибок, Отказ);		
		
	КонецПроцедуры
	
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Функция ПроверитьСправочникПередПроведением()
	
	СписокОшибок = Неопределено;
	
	Для Каждого Строка Из ИсходныеКомплектующие Цикл
		Если Не ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда 
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок, "Объект.Номенклатура", СтрШаблон(НСтр("ru = 'Для номенклатуры %1 не заполнена единица измерения.'"), Строка.Номенклатура), "");
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокОшибок;
	
КонецФункции
	
#КонецОбласти
	
#КонецЕсли