
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПредопределенные(Команда)
	
	ЗаполнитьПредопределенныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
    
    ОчиститьНаСервере();
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредопределенныеНаСервере()
	
	Справочники.TelegramEmoji.ЗаполнитьEmojiПриПервоначальномЗаполнении();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
    
    TelegramСервер.ОчиститьСправочник("TelegramEmoji");
    Элементы.Список.Обновить();
    
КонецПроцедуры

#КонецОбласти
 
