
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуИзображений();
	
	Если Параметры.Свойство("Картинка") Тогда
		Для Каждого Строки Из Таблица Цикл
			Если Строки.Картинка = Параметры.Картинка Тогда
				Элементы.Таблица.ТекущаяСтрока = Строки.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблица

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Таблица.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элементы.Таблица.ТекущиеДанные.Картинка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.Таблица.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элементы.Таблица.ТекущиеДанные.Картинка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуИзображений()
	
	Таблица.Очистить(); 
	
	НачальныйИндекс = 3;
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Важно'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Линейка'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Лампочка'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Баг'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Письмо'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Внимание'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Все в порядке'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Теги'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Звонок'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Молния'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Медицина'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Деньги'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Лягушка'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Авто'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Гроза'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Снег'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Кубок (золото)'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Кубок (серебро)'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Кубок (бронза)'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Золотая медаль'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Медаль'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Корона'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Торт'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Цель'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Важно (1)'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Важно (2)'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Текст (1)'"));
	ДобавитьСтроку(Таблица, НачальныйИндекс, НСтр("ru = 'Текст (2)'"));
	
	Таблица.Сортировать("Наименование");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСтроку(Таблица, НачальныйИндекс, Знач Наименование)
	
	НоваяСтрока 				= Таблица.Добавить();
	НоваяСтрока.Картинка 		= НачальныйИндекс;
	НоваяСтрока.Наименование 	= Наименование;
	
	НачальныйИндекс = НачальныйИндекс + 1;
	
КонецПроцедуры

#КонецОбласти