
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ОтборСтруктура = Новый Структура;
	ОтборСтруктура.Вставить("Правило", ПараметрКоманды);
	ПараметрыФормы.Вставить("Отбор", ОтборСтруктура); 
	ОткрытьФорму("РегистрСведений.ВыполнениеПравилСобытий.Форма.ФормаСписка", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
