
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = Неопределено;		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ПользователиМобильныхПриложений.Ссылка) КАК КоличествоЗаписей
		|ИЗ
		|	Справочник.ПользователиМобильныхПриложений КАК ПользователиМобильныхПриложений
		|ГДЕ
		|	ПользователиМобильныхПриложений.Пользователь = &Пользователь
		|	И ПользователиМобильныхПриложений.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Ссылка", 	  Ссылка);	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоЗаписей > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Пользователь", 
				СтрШаблон(НСтр("ru = 'Для пользователя ""%1"" настройки обмена с мобильными клиентами уже созданы ранее.'"), Пользователь), "");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
