
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.СтатьяБазыЗнаний = ?(Параметры.Свойство("Статья"), Параметры.Статья, Неопределено);
	ЭтотОбъект.Пользователь		= ?(Параметры.Свойство("Пользователь"), Параметры.Пользователь, Неопределено);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатьяБазыЗнаний) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Пользователь) Тогда
		ЭтотОбъект.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЭтотОбъект.Оценка = БазаЗнаний.ПолучитьОценкуСтатьи(ЭтотОбъект.СтатьяБазыЗнаний, ЭтотОбъект.Пользователь);
	
	ЭтотОбъект.АвтоЗаголовок	= Ложь;
	ЭтотОбъект.Заголовок		= НСтр("ru = 'Оцените статью'");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если ЭтотОбъект.Оценка < 1 ИЛИ ЭтотОбъект.Оценка > 5 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не верно указана оценка статьи.'"), 30);
			Возврат;
		КонецЕсли;
		
		ЗаписатьРейтингСтатьиНаСервере(ЭтотОбъект.СтатьяБазыЗнаний, ЭтотОбъект.Пользователь, ЭтотОбъект.Оценка);
	КонецЕсли;
	
	ЭтотОбъект.Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ

&НаСервереБезКонтекста
Процедура ЗаписатьРейтингСтатьиНаСервере(СтатьяСсылка, ПользовательСсылка, Оценка)
	
	БазаЗнаний.ДобавитьОценкуСтатье(СтатьяСсылка, ПользовательСсылка, Оценка);
	
КонецПроцедуры

#КонецОбласти

