
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ПараметрыФормы = Новый Структура("Объект", ПараметрКоманды);
		Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Сотрудники") Тогда
			Если НЕ АктуальностьСотрудника(ПараметрКоманды) Тогда
				ПараметрыФормы.Вставить("ПоказыватьУволенных", Истина);
			КонецЕсли;	
		КонецЕсли;	
	Иначе
		ПараметрыФормы = Новый Структура;
	КонецЕсли;	
	
	ОткрытьФорму("Справочник.ЛогиныИПароли.Форма.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
&НаСервере
Функция АктуальностьСотрудника(Знач Сотрудник)
	
	Возврат Сотрудник.Актуальность;
	
КонецФункции

#КонецОбласти
