
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборКлиент	= Настройки.Получить("ОтборКлиент");
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Клиент", 
		ОтборКлиент, ЗначениеЗаполнено(ОтборКлиент));
		
	ОтборПроект	= Настройки.Получить("ОтборПроект");
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Проект", 
		ОтборПроект, ЗначениеЗаполнено(ОтборПроект));
		
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("ОтборКлиент", ОтборКлиент);
	Настройки.Вставить("ОтборПроект", ОтборПроект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентПриИзменении(Элемент)
	
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Клиент", 
		ОтборКлиент, ЗначениеЗаполнено(ОтборКлиент));
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектПриИзменении(Элемент)
	
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Проект", 
		ОтборПроект, ЗначениеЗаполнено(ОтборПроект));
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(Идентификатор, ОбъектыНазначения) Экспорт
	
	Если ТипЗнч(ОбъектыНазначения) = Тип("ДокументСсылка.РС_ОтчетКлиенту") Тогда
		Документ = ОбъектыНазначения;
	ИначеЕсли ТипЗнч(ОбъектыНазначения)=Тип("Массив") И ОбъектыНазначения.Количество() = 1 Тогда
		Документ = ОбъектыНазначения[0];
	Иначе
		Сообщить("Выберите один документ");
		Возврат;
	КонецЕсли;
	_Параметры = Новый Структура;
	_Параметры.Вставить("Документ",Документ);
	
	ОткрытьФорму("ВнешнийОтчет.ОтчетКлиенту.Форма.Форма",_Параметры);
	
КонецПроцедуры

#Область БСП 
// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 

// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список); 
КонецПроцедуры

&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат); 
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список); 
КонецПроцедуры 
// СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти