
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = НСтр("ru = 'Подсказка: '") + Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("КлючПодсказки") Тогда
		МакетПодсказки = Обработки.МенеджерПодсказок.ПолучитьМакет(Параметры.КлючПодсказки).ПолучитьТекст();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МакетПодсказкиПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если Найти(ДанныеСобытия.href, "unf://") <> 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		СтрокаИмяФормы = ДанныеСобытия.href;
		Если Найти(ДанныеСобытия.href, "v8cfgHelp") <> 0 Тогда
			СтрокаИмяФормы = СтрЗаменить(СтрокаИмяФормы, "v8cfgHelp/v8config/", "");
		КонецЕсли;
		СтрокаИмяФормы = СтрЗаменить(СтрокаИмяФормы, "unf://", "");
		СтрокаИмяФормы = СтрЗаменить(СтрокаИмяФормы, "/", "");
		Попытка
			ОткрытьФорму(СтрокаИмяФормы);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти