
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДатаКалендаря", ДатаКалендаря)
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

// Процедура - обработчик события ПриАктивизацииДаты поля ДатаКалендаря.
//
&НаКлиенте
Процедура ДатаКалендаряПриАктивизацииДаты(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
	
КонецПроцедуры // ДатаКалендаряПриАктивизацииДаты()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обработки ожидания при активизации даты.
//
&НаКлиенте
Процедура ОбработкаОжидания()
	
	Для каждого ВыделеннаяДата Из Элементы.ДатаКалендаря.ВыделенныеДаты Цикл
		
		ДатаКалендаря = ВыделеннаяДата;
		
	КонецЦикла;
	
	ОповеститьОВыборе(ДатаКалендаря);
	
КонецПроцедуры // ОбработкаОжидания()

#КонецОбласти