
&НаКлиенте
Процедура СоздатьБыстраяЗанятость(Команда)
	ОткрытьФорму("Документ.РС_Занятость.Форма.ФормаДокументаБыстраяЗанятость",,,Новый УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОтборИсполнитель	= Настройки.Получить("ТекущийИсполнитель");
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Исполнитель", 
		ОтборИсполнитель, ЗначениеЗаполнено(ОтборИсполнитель));
КонецПроцедуры

&НаКлиенте
Процедура ОтборИсполнительПриИзменении(Элемент)
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Исполнитель", 
		ОтборИсполнитель, ЗначениеЗаполнено(ОтборИсполнитель));
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	//Добавляем полученные массивы в сохраняемые настройки с соответствующими именами
	Настройки.Вставить("ТекущийИсполнитель", ОтборИсполнитель);
КонецПроцедуры




