
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантСтандартногоПериода", ВариантСтандартногоПериода) 
		И Параметры.Свойство("ВидСтандартногоПериода", ВидСтандартногоПериода) Тогда
		ОбновитьСписокПериодов();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ВидСтандартногоПериода) Тогда
		ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц");
		ОбновитьСписокПериодов();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВариантовПериодаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокВариантовПериода.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОбразецПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбразецПериода()
	
	ТекущиеДанные = Элементы.СписокВариантовПериода.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗначениеТекущегоПериода = ТекущиеДанные.Значение;
	мСтандарнтыйПериод 		= Новый СтандартныйПериод(МетрикиКлиентСервер.ВариантСтандартногоПериода(ЗначениеТекущегоПериода));
	ДатаНачала 				= мСтандарнтыйПериод.ДатаНачала;
	ДатаОкончания 			= мСтандарнтыйПериод.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Функция ТекущаяДатаСеансаНаСервере()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДень(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.День");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Сегодня");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНеделя(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Неделя");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаНеделя");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДекада(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Декада");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаДекада");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаМесяц(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотМесяц");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКвартал(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Квартал");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотКвартал");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолугодие(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Полугодие");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтоПолугодие");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГод(Команда)
	
	ВидСтандартногоПериода 		= ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Год");
	ВариантСтандартногоПериода	= ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотГод");
	ОбновитьСписокПериодов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПериодов()
	
	СписокПериодов.Очистить();
	СписокПериодов	= МетрикиКлиентСервер.СписокВычисляемыхПериодов(ВидСтандартногоПериода);
	
	Если ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.День") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.Сегодня).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Неделя") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтаНеделя).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Декада") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтаДекада).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтотМесяц).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Квартал") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтотКвартал).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Полугодие") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтоПолугодие).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	ИначеЕсли ВидСтандартногоПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Год") Тогда
		Если Не ЗначениеЗаполнено(ВариантСтандартногоПериода) Тогда
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(Перечисления.ВариантыСтандартногоПериода.ЭтотГод).ПолучитьИдентификатор();
		Иначе			
			Элементы.СписокВариантовПериода.ТекущаяСтрока 	= СписокПериодов.НайтиПоЗначению(ВариантСтандартногоПериода).ПолучитьИдентификатор();			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ТекущиеДанные = Элементы.СписокВариантовПериода.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	РезультатСтруктура = Новый Структура;
	РезультатСтруктура.Вставить("ВариантСтандартногоПериода", ТекущиеДанные.Значение);	
	РезультатСтруктура.Вставить("ВидСтандартногоПериода",	  ВидСтандартногоПериода);	
	ЭтаФорма.Закрыть(РезультатСтруктура);		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВариантовПериодаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьПериод(Неопределено);
	
КонецПроцедуры

#КонецОбласти