#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
    
	СписокУчастников = "";
	Для Каждого Участник Из Адресаты Цикл
		СписокУчастников = СписокУчастников + ?(СписокУчастников = "", "", "; ") + Строка(Участник.Адресат);
    КонецЦикла;
    
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
    
    ДатаОтправки = Дата(1, 1, 1);
    Для Каждого Строки Из Адресаты Цикл
        
        Строки.Состояние = Перечисления.TelegramСостояниеИсходящегоСообщения.Черновик;
        Строки.ТекстОшибки = "";
        Строки.ОтправленныйЗапрос = "";
        
    КонецЦикла; 
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли