
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПериодов.Добавить("Год");
	СписокПериодов.Добавить("Квартал");
	СписокПериодов.Добавить("Месяц");
	СписокПериодов.Добавить("День");
	СписокПериодов.Добавить("Произвольный");
	
	СписокПериодов.Добавить("СНачалаГода");
	СписокПериодов.Добавить("СНачалаКвартала");
	СписокПериодов.Добавить("СНачалаМесяца");

	// Установим начальные значение.
	ТекущаяДата = ТекущаяДатаСеанса();
	ВыборПериода = 0;
	
	Год = Формат(ТекущаяДата, "ДФ=yyyy");
	
	Квартал = НачалоМесяца(ТекущаяДата);
	КварталПредставление = СтрШаблон(НСтр("ru = '%1 квартал %2 г.'"), 
		ПолучитьНомерКвартала(Квартал), Формат(Квартал, "ДФ=yyyy"));
		
	Месяц = НачалоМесяца(ТекущаяДата);
	МесяцПредставление = СтрШаблон(НСтр("ru = '%1 %2 г.'"), ПолучитьНазваниеМесяца(Формат(Месяц,"ДФ=MM")),
		 Формат(Месяц, "ДФ=yyyy"));
	
	День = НачалоДня(ТекущаяДата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьПериода();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеГодПриИзменении(Элемент)
	УстановитьВидимостьПериода();
	ТекГод = Дата(Формат(Год, "ЧГ=0") + "01010000");
	НачПериода = НачалоМесяца(НачалоГода(ТекГод));
	КонПериода = КонецМесяца(КонецГода(ТекГод));
	УстановитьПредставлениеПериода(Формат(Год, "ЧГ=0") + " г.");
КонецПроцедуры

&НаКлиенте
Процедура ПолеКварталПриИзменении(Элемент)
	УстановитьВидимостьПериода();
	РасчитатьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ПолеМесяцПриИзменении(Элемент)
	УстановитьВидимостьПериода();
	РасчитатьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ПолеДеньПриИзменении(Элемент)
	УстановитьВидимостьПериода();
	РасчитатьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ПолеПроизвольныйПриИзменении(Элемент)
	УстановитьВидимостьПериода();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ТекГод = Дата(Формат(Год, "ЧГ=0") + "01010000");
	НачПериода = НачалоМесяца(НачалоГода(ТекГод));
	КонПериода = КонецМесяца(КонецГода(ТекГод));
	УстановитьПредставлениеПериода(Формат(ТекГод, "ДФ=yyyy") + " г.") ;

КонецПроцедуры

&НаКлиенте
Процедура КварталРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Если Направление = 1 Тогда
		Квартал = НачалоКвартала(ДобавитьМесяц(Квартал, 3) +60*60);
	Иначе
		Квартал = НачалоКвартала(ДобавитьМесяц(Квартал, - 3) + 60*60);
	КонецЕсли;
	РасчитатьПериод();	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Если Направление = 1 Тогда
		Месяц = НачалоМесяца(ДобавитьМесяц(Месяц ,1));
		МесяцПредставление = ПолучитьПредставлениеМесяца(Месяц);
	Иначе
		Месяц = НачалоМесяца(ДобавитьМесяц(Месяц,  -1));
		МесяцПредставление = ПолучитьПредставлениеМесяца(Месяц);
	КонецЕсли;
	РасчитатьПериод();
КонецПроцедуры

&НаКлиенте
Процедура СНачалаГодаПриИзменении(Элемент)
	Если СНачалаГода Тогда
		СНачалаМесяца = Ложь;
		СНачалаКвартала = Ложь;
	КонецЕсли;
	РасчитатьПериод();
КонецПроцедуры

&НаКлиенте
Процедура СНачалаКварталаПриИзменении(Элемент)
	Если СНачалаКвартала Тогда 
		СНачалаМесяца = Ложь;
		СНачалаГода = Ложь;
	КонецЕсли;
	РасчитатьПериод();	
КонецПроцедуры

&НаКлиенте
Процедура СНачалаМесяцаПриИзменении(Элемент)
	Если СНачалаМесяца Тогда 
		СНачалаКвартала = Ложь;
		СНачалаГода = Ложь;
	КонецЕсли;
	РасчитатьПериод();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьПериода()
	Для Каждого ТекСтрока Из СписокПериодов Цикл
		Элементы[ТекСтрока.Значение].Доступность = Ложь;
	КонецЦикла;
	Если ВыборПериода = 0 Тогда
		Элементы.Год.Доступность = Истина;
		СНачалаМесяца = ложь;
     	СНачалаКвартала = ложь;
		СНачалаГода = ложь;
	ИначеЕсли ВыборПериода = 1 Тогда
		Элементы.Квартал.Доступность = Истина;
		Элементы.СНачалаГода.Доступность = Истина;
		СНачалаМесяца = ложь;
     	СНачалаКвартала = ложь;
	ИначеЕсли ВыборПериода = 2 Тогда
		Элементы.Месяц.Доступность = Истина;
		Элементы.СНачалаГода.Доступность = Истина;
		Элементы.СНачалаКвартала.Доступность = Истина;
		СНачалаМесяца = ложь;
	ИначеЕсли ВыборПериода = 3 Тогда
		Элементы.День.Доступность = Истина;
		Элементы.СНачалаГода.Доступность = Истина;
		Элементы.СНачалаКвартала.Доступность = Истина;
		Элементы.СНачалаМесяца.Доступность = Истина;
	ИначеЕсли ВыборПериода = 4 Тогда
		Элементы.Произвольный.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Общего назначения
&НаКлиенте
Функция УстановитьПредставлениеПериода(ТекстПериода)
	
	Элементы.ПредставлениеПериода.Заголовок = СтрШаблон(НСтр("ru = 'Выбранный период: %1'"), ТекстПериода);
	
КонецФункции

&НаСервере
Функция ПолучитьНазваниеМесяца(Номер)
	Если Номер = "01" Тогда
		Возврат "Январь";
	ИначеЕсли Номер = "02" Тогда
		Возврат "Февраль";
	ИначеЕсли Номер = "03" Тогда
		Возврат "Март";
	ИначеЕсли Номер = "04" Тогда
		Возврат "Апрель";
	ИначеЕсли Номер = "05" Тогда
		Возврат "Май";
	ИначеЕсли Номер = "06" Тогда
		Возврат "Июнь";
	ИначеЕсли Номер = "07" Тогда
		Возврат "Июль";
	ИначеЕсли Номер = "08" Тогда
		Возврат "Август";
	ИначеЕсли Номер = "09" Тогда
		Возврат "Сентябрь";
	ИначеЕсли Номер = "10" Тогда
		Возврат "Октябрь";
	ИначеЕсли Номер = "11" Тогда
		Возврат "Ноябрь";
	ИначеЕсли Номер = "12" Тогда
		Возврат "Декабрь";
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьПредставлениеМесяца(Дата)
	Возврат ПолучитьНазваниеМесяца(Формат(Дата,   "ДФ=MM")) + " " + Формат(Дата,  "ДФ=yyyy") + " г.";	
КонецФункции

&НаСервере
Функция ПолучитьНомерКвартала(Дата)
	пМесяц = Формат(Дата,  "ДФ=MM");
	Если пМесяц = "01" Или пМесяц = "02" Или пМесяц = "03" Тогда
		Возврат "1";
	ИначеЕсли  пМесяц = "04" Или пМесяц = "05" Или пМесяц = "06" Тогда
		Возврат "2";
	ИначеЕсли  пМесяц = "07" Или пМесяц = "08" Или пМесяц = "09" Тогда
		Возврат "3";
	ИначеЕсли  пМесяц = "10" Или пМесяц = "11" Или пМесяц = "12" Тогда
		Возврат "4";
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РасчитатьПериод()
	// Период "год"
	Если ВыборПериода = 0 Тогда
	// Период "квартал"
	ИначеЕсли ВыборПериода = 1 Тогда
 		КонПериода =КонецМесяца(КонецКвартала(Квартал));
		КварталПредставление =ПолучитьНомерКвартала(Квартал) + " квартал " + Формат(Квартал, "ДФ=yyyy") + " г.";
		Если СНачалаГода Тогда
			НачПериода = НачалоГода(Квартал);
			УстановитьПредставлениеПериода("с: " + Формат(НачПериода, "ДЛФ=DD") + " по: " + Формат(КонПериода, "ДЛФ=DD")); 
		Иначе
			
			НачПериода = НачалоМесяца(НачалоКвартала(Квартал));
			УстановитьПредставлениеПериода(КварталПредставление);
		КонецЕсли;
	// Период "месяц"	
	ИначеЕсли ВыборПериода = 2 Тогда
		Если СНачалаГода Тогда
			НачПериода = НачалоГода(Месяц);
			КонПериода = КонецМесяца(Месяц);
			УстановитьПредставлениеПериода("с: " + Формат(НачПериода, "ДЛФ=DD") + " по: " + Формат(КонПериода, "ДЛФ=DD")); 
		ИначеЕсли СНачалаКвартала Тогда
			НачПериода = НачалоКвартала(Месяц);
			КонПериода = КонецМесяца(Месяц);
			УстановитьПредставлениеПериода("с: " + Формат(НачПериода, "ДЛФ=DD") + " по: " + Формат(КонПериода, "ДЛФ=DD")); 
		Иначе
			НачПериода = НачалоМесяца(Месяц);
			КонПериода = КонецМесяца(Месяц);
			УстановитьПредставлениеПериода(МесяцПредставление);
		КонецЕсли;
		// Период "день"
		ИначеЕсли ВыборПериода = 3 Тогда
		Если СНачалаГода Тогда
			НачПериода = НачалоГода(День);
			КонПериода = День;
			УстановитьПредставлениеПериода("с: " + Формат(НачПериода, "ДЛФ=DD") + " по: " + Формат(КонПериода, "ДЛФ=DD")); 
		ИначеЕсли СНачалаКвартала Тогда
			НачПериода = НачалоКвартала(День);
			КонПериода = День;
			УстановитьПредставлениеПериода("с: " + Формат(НачПериода, "ДЛФ=DD") + " по: " + Формат(КонПериода, "ДЛФ=DD")); 
		ИначеЕсли СНачалаМесяца Тогда
			НачПериода = НачалоМесяца(День);
			КонПериода = День;
			УстановитьПредставлениеПериода("с: " + Формат(НачПериода, "ДЛФ=DD") + " по: " + Формат(КонПериода, "ДЛФ=DD")); 
		Иначе
			НачПериода = День;
			КонПериода =День;
			УстановитьПредставлениеПериода(Формат(День," ДЛФ=DD") );
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
