#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет загрузку данных Emoji в справочник.
//
Процедура ЗаполнитьEmojiПриПервоначальномЗаполнении() Экспорт
		
	ОбновитьИзИнтернета();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьИзИнтернетаДиапазон(Знач РодительскийКод, Знач НачалоДиапазона, Знач КонецДиапазона = Неопределено)
    
    ВременныйФайл = ПолучитьИмяВременногоФайла();
    
    СсылкаПоКоду = Справочники.TelegramEmoji.НайтиПоКоду(РодительскийКод);
    Если НЕ ЗначениеЗаполнено(СсылкаПоКоду) Тогда
        ЭлементРодитель     = Справочники.TelegramEmoji.СоздатьГруппу();
        ЭлементРодитель.Код = РодительскийКод;
        ЭлементРодитель.Записать();
        ЭлементРодитель     = ЭлементРодитель.Ссылка;
    Иначе
        ЭлементРодитель = СсылкаПоКоду;
    КонецЕсли; 
    
    Начало = ЗаданияСервер.HexToDecЧисло(НачалоДиапазона);
    Если КонецДиапазона = Неопределено Тогда
    	КонецДиапазона = НачалоДиапазона;
    КонецЕсли; 
    Конец = ЗаданияСервер.HexToDecЧисло(КонецДиапазона);
    
    Для Индекс = Начало По Конец Цикл
        
        ИмяФайла = НРег(ЗаданияСервер.ЧислоDecToHex(Индекс));        
        Попытка
    	    КопироватьФайл("https://de9xxjhuq2c2j.cloudfront.net/apps/live-20180516-1/images/emoji/emoji-apple/" 
                + ИмяФайла + ".png", Временныйфайл);
        Исключение
            Продолжить;
        КонецПопытки;
        
    	ДвоичныеДанные          	= Новый ДвоичныеДанные(ВременныйФайл);
		
		НачатьТранзакцию();
		Попытка			
	        СсылкаПоКоду            = Справочники.TelegramEmoji.НайтиПоКоду(Индекс);
	        Если НЕ ЗначениеЗаполнено(СсылкаПоКоду) Тогда
	        	Элемент             = Справочники.TelegramEmoji.СоздатьЭлемент();
	            Элемент.Код         = Индекс;
	            Элемент.Родитель    = ЭлементРодитель;    	
	        Иначе
	            Элемент             = СсылкаПоКоду.ПолучитьОбъект();
	        КонецЕсли; 
			
			Элемент.Заблокировать();
			Элемент.Изображение = Новый ХранилищеЗначения(ДвоичныеДанные);
			Элемент.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
		    ОтменитьТранзакцию();
		КонецПопытки;
        
    КонецЦикла;
    
    УдалитьФайлы(ВременныйФайл);
    
КонецПроцедуры

Процедура ОбновитьИзИнтернета()
    
    // 1. Emoticons ( 1F601 - 1F64F )
    ОбновитьИзИнтернетаДиапазон(1, "1F601", "1F64F");
    // 2. Dingbats ( 2702 - 27B0 )
    ОбновитьИзИнтернетаДиапазон(2, "2702", "27B0");
    // 3. Transport and map symbols ( 1F680 - 1F6C0 )
    ОбновитьИзИнтернетаДиапазон(3, "1F680", "1F6C0");
    // 4. Enclosed characters ( 1F170 - 1F251 )
    ОбновитьИзИнтернетаДиапазон(4, "1F170", "1F19A");
    ОбновитьИзИнтернетаДиапазон(4, "A9");
    ОбновитьИзИнтернетаДиапазон(4, "AE");
    ОбновитьИзИнтернетаДиапазон(4, "203C");
    ОбновитьИзИнтернетаДиапазон(4, "2049");
    ОбновитьИзИнтернетаДиапазон(4, "2122");
    ОбновитьИзИнтернетаДиапазон(4, "2139");
    ОбновитьИзИнтернетаДиапазон(4, "2B1B", "2B1C");
    ОбновитьИзИнтернетаДиапазон(4, "2B50");
    ОбновитьИзИнтернетаДиапазон(4, "2B55");
    ОбновитьИзИнтернетаДиапазон(4, "3030");
    ОбновитьИзИнтернетаДиапазон(4, "303D");
    // 5. Uncategorized
    ОбновитьИзИнтернетаДиапазон(5, "2194", "2199");
    ОбновитьИзИнтернетаДиапазон(4, "21A9");
    ОбновитьИзИнтернетаДиапазон(4, "21AA");
    ОбновитьИзИнтернетаДиапазон(5, "2648", "2653");
    ОбновитьИзИнтернетаДиапазон(5, "2660", "2666");
    ОбновитьИзИнтернетаДиапазон(5, "2934", "2935");
    ОбновитьИзИнтернетаДиапазон(5, "2B05", "2B07");
    ОбновитьИзИнтернетаДиапазон(5, "1F300", "1F5FF");
    // 6a. Additional emoticons ( 1F600 - 1F636 )
    ОбновитьИзИнтернетаДиапазон(6, "1F600", "1F636");
    // 6b. Additional transport and map symbols ( 1F681 - 1F6C5 )
    ОбновитьИзИнтернетаДиапазон(6, "1F681", "1F6C5");
    // 6c. Other additional symbols ( 1F30D - 1F567 )
    ОбновитьИзИнтернетаДиапазон(6, "1F30D", "1F567");

    	
КонецПроцедуры

#КонецОбласти

#КонецЕсли