&НаСервере
Функция ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.КарточкиНоменклатуры") Тогда
		
		Возврат Справочники[ПараметрКоманды[0].Метаданные().Имя].ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды);
		
	Иначе
	
		Возврат Документы[ПараметрКоманды[0].Метаданные().Имя].ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды);
		
	КонецЕсли;
	
КонецФункции

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	                                                  
	АдресВХранилище = ПолучитьДанныеДляПечатиЭтикеток(ПараметрКоманды);
	
	СтруктураПараметры = Новый Структура("АдресВХранилище");
	СтруктураПараметры.АдресВХранилище   = АдресВХранилище;
	
	ОткрытьФорму("Обработка.ПечатьЭтикеток.Форма.Форма",
		СтруктураПараметры,            // Параметры
		,                              // Владелец
		Новый УникальныйИдентификатор,  // Уникальность
		ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

#КонецОбласти