
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Делаем запись в справочник
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеITОтделом8УФ.ЗаписатьТекущиеДанныеМестХранения();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	// Делаем запись в справочник
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеITОтделом8УФ.ЗаписатьТекущиеДанныеМестХранения();
		                
КонецПроцедуры

#КонецОбласти