
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Ставка.Видимость = НЕ Объект.НеОблагается;
	Элементы.Расчетная.Видимость = НЕ Объект.НеОблагается;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода НеОблагается.
//
Процедура НеОблагаетсяПриИзменении(Элемент)
	
	Если Объект.НеОблагается Тогда
		Объект.Ставка = 0;
		Объект.Расчетная = Ложь;
		Элементы.Ставка.Видимость = Ложь;
		Элементы.Расчетная.Видимость = Ложь;
	Иначе
		Элементы.Ставка.Видимость = Истина;
		Элементы.Расчетная.Видимость = Истина;
	КонецЕсли;
		
КонецПроцедуры // НеОблагаетсяПриИзменении()

#КонецОбласти