
#Область ПрограммныйИнтерфейс

Функция СписокВычисляемыхПериодов(Знач ВидПериода) Экспорт
	
	СписокПериодов = Новый СписокЗначений;	
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.День") Тогда
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Вчера"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Сегодня"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Завтра"));
		
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Неделя") Тогда
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлаяНеделя"));		
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Последние7Дней"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтойНедели"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаНеделя"));		
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтойНедели"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Следующие7Дней"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующаяНеделя"));		
		
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Декада") Тогда
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлаяДекада"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтойДекады"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаДекада"));		
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтойДекады"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующаяДекада"));
		
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц") Тогда
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлыйМесяц"));		
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Месяц"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоМесяца"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотМесяц"));		
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоМесяца"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующийМесяц"));
		
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Квартал") Тогда
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлыйКвартал"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоКвартала"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотКвартал"));		
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоКвартала"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующийКвартал"));
		
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Полугодие") Тогда
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлоеПолугодие"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоПолугодия"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтоПолугодие"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоПолугодия"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующееПолугодие"));	
		
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Год") Тогда
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлыйГод"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоГода"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотГод"));		
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоГода"));
		СписокПериодов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующийГод"));	
		
	КонецЕсли;
	
	Возврат СписокПериодов;
	
КонецФункции	

Функция ВариантСтандартногоПериода(Знач ВариантПериода) Экспорт
	
	Если ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Сегодня") Тогда
		Возврат ВариантСтандартногоПериода.Сегодня;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Вчера") Тогда
		Возврат ВариантСтандартногоПериода.Вчера;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Завтра") Тогда
		Возврат ВариантСтандартногоПериода.Завтра;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлаяНеделя") Тогда
		Возврат ВариантСтандартногоПериода.ПрошлаяНеделя;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Последние7Дней") Тогда
		Возврат ВариантСтандартногоПериода.Последние7Дней;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтойНедели") Тогда
		Возврат ВариантСтандартногоПериода.СНачалаЭтойНедели;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаНеделя") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаНеделя;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтойНедели") Тогда
		Возврат ВариантСтандартногоПериода.ДоКонцаЭтойНедели;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Следующие7Дней") Тогда
		Возврат ВариантСтандартногоПериода.Следующие7Дней;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующаяНеделя") Тогда
		Возврат ВариантСтандартногоПериода.СледующаяНеделя;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлаяДекада") Тогда
		Возврат ВариантСтандартногоПериода.ПрошлаяДекада;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтойДекады") Тогда
		Возврат ВариантСтандартногоПериода.СНачалаЭтойДекады;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаДекада") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаДекада;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтойДекады") Тогда
		Возврат ВариантСтандартногоПериода.ДоКонцаЭтойДекады;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующаяДекада") Тогда
		Возврат ВариантСтандартногоПериода.СледующаяДекада;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлыйМесяц") Тогда
		Возврат ВариантСтандартногоПериода.ПрошлыйМесяц;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Месяц") Тогда
		Возврат ВариантСтандартногоПериода.Месяц;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоМесяца") Тогда
		Возврат ВариантСтандартногоПериода.СНачалаЭтогоМесяца;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотМесяц") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотМесяц;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоМесяца") Тогда
		Возврат ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующийМесяц") Тогда
		Возврат ВариантСтандартногоПериода.СледующийМесяц;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлыйКвартал") Тогда
		Возврат ВариантСтандартногоПериода.ПрошлыйКвартал;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоКвартала") Тогда
		Возврат ВариантСтандартногоПериода.СНачалаЭтогоКвартала;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотКвартал") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотКвартал;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоКвартала") Тогда
		Возврат ВариантСтандартногоПериода.ДоКонцаЭтогоКвартала;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующийКвартал") Тогда
		Возврат ВариантСтандартногоПериода.СледующийКвартал;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлоеПолугодие") Тогда
		Возврат ВариантСтандартногоПериода.ПрошлоеПолугодие;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоПолугодия") Тогда
		Возврат ВариантСтандартногоПериода.СНачалаЭтогоПолугодия;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтоПолугодие") Тогда
		Возврат ВариантСтандартногоПериода.ЭтоПолугодие;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоПолугодия") Тогда
		Возврат ВариантСтандартногоПериода.ДоКонцаЭтогоПолугодия;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СледующееПолугодие") Тогда
		Возврат ВариантСтандартногоПериода.СледующееПолугодие;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ПрошлыйГод") Тогда
		Возврат ВариантСтандартногоПериода.ПрошлыйГод;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.СНачалаЭтогоГода") Тогда
		Возврат ВариантСтандартногоПериода.СНачалаЭтогоГода;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотГод") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотГод;
	ИначеЕсли ВариантПериода = ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ДоКонцаЭтогоГода") Тогда
		Возврат ВариантСтандартногоПериода.ДоКонцаЭтогоГода;
	Иначе
		Возврат ВариантСтандартногоПериода.СледующийГод;
	
	КонецЕсли;
	
КонецФункции

// Возвращает предопределенные значение варианта периода по виду.
//
// Параметры:
//	ВидПериода - ПеречислениеСсылка.ВидыСтандартногоПериода - вид периода.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.ВариантыСтандартногоПериода - вид периода.
//
Функция ПредопределенноеЗначениеВариантаПериодаПоВидуПериода(Знач ВидПериода) Экспорт
	
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Год") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотГод");
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Декада") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаДекада");
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.День") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.Сегодня");
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Квартал") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотКвартал");
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Месяц") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтотМесяц");
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыСтандартногоПериода.Неделя") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтаНеделя");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыСтандартногоПериода.ЭтоПолугодие");
	КонецЕсли;
	
КонецФункции

#КонецОбласти 
