#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет виды работ по умолчанию.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьВидыРаботПриПервоначальномЗаполнении() Экспорт
	
	// Описываем стуктуру.
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("ВидВремени");
	
	ВД = Справочники.ВидыРабот;
	
	// Заполняем реквизитами.
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.ВыполнениеЗаданий,			НСтр("ru = 'Выполнение заданий'"), 			Перечисления.ВидыВремени.Рабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Обед,						НСтр("ru = 'Обед'"), 						Перечисления.ВидыВремени.НеРабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.РаботаСДокументами,			НСтр("ru = 'Работа с документами'"), 		Перечисления.ВидыВремени.Рабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.ВыполнениеНарядовНаРаботы,	НСтр("ru = 'Выполнение нарядов на работы'"),Перечисления.ВидыВремени.Рабочее);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.ПрочиеРаботы,				НСтр("ru = 'Прочие работы'"), 				Перечисления.ВидыВремени.Рабочее);
	
	// Записываем.
	Для Каждого Строки Из ТЗ Цикл
		Объект = Строки.Объект.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВТаблицуЗначений(ТЗ, Объект, Наименование, ВидВремени)
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Объект		 	= Объект;
	НоваяСтрока.Наименование 	= Наименование;
	НоваяСтрока.ВидВремени		= ВидВремени;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли