
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПример = НачалоЧаса(ТекущаяДатаСеанса());
	РассчитатьДатуПримера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекДатаПриИзменении(Элемент)
	
	РассчитатьДатуПримера();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВычисляемойСтрокиПриИзменении(Элемент)
	
	РассчитатьДатуПримера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	РассчитатьДатуПримера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЧислаДобавить(Элемент)
	
	РассчитатьДатуПримера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	
	РассчитатьДатуПримера();

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьДатуПримера()
	
	Результат = УправлениеSLA.РассчитатьВычисляемыйСрок(Объект, ДатаПример, ДобавитьМесяц(ДатаПример, 12), ГрафикПредоставленияУслуги);
	
КонецПроцедуры

#КонецОбласти




