
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПоказыватьИнформацию     = Истина;
	ПоказыватьОшибки         = Истина;
	ПоказыватьПредупреждения = Истина;
	СобытияКлиента           = Истина;
	СобытияСервера           = Истина;
	ПоказыватьСообщенияОПроблемахОтПользователей = Истина;

	Если Не УправлениеITОтделом8УФПовтИсп.Право("ПолныеПрава") Тогда
		Пользователь = Пользователи.ТекущийПользователь();
		Элементы.Пользователь.Доступность = Ложь;
	КонецЕсли;

	УстановитьПараметры();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)

	УстановитьПараметры();

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПриИзменении(Элемент)

	УстановитьПараметры();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметры()

	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьИнформацию",     ПоказыватьИнформацию);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьОшибки",         ПоказыватьОшибки);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьПредупреждения", ПоказыватьПредупреждения);
	Список.Параметры.УстановитьЗначениеПараметра("СобытияКлиента",           СобытияКлиента);
	Список.Параметры.УстановитьЗначениеПараметра("СобытияСервера",           СобытияСервера);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаС",                    ДатаС);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаПо",                   ДатаПо);
	Список.Параметры.УстановитьЗначениеПараметра("МобильныйКлиент",          МобильныйКлиент);
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь",             Пользователь);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьСообщенияОПроблемахОтПользователей",
		ПоказыватьСообщенияОПроблемахОтПользователей);

КонецПроцедуры

&НаКлиенте
Процедура МобильныйКлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Элементы.МобильныйКлиент.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Пользователь) Тогда		
		Узлы = УзлыОбменаПоПользователю(Пользователь);		
		Для Каждого Узел Из Узлы Цикл			
			Элементы.МобильныйКлиент.СписокВыбора.Добавить(Узел, Строка(Узел));			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция УзлыОбменаПоПользователю(Пользователь)
	
	Возврат ОбменМобильноеПриложениеПовтИсп.ПолучитьУзлыОбменаПоВладельцу(Пользователь);
	
КонецФункции	

#КонецОбласти
