#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Функция определяет, используются или нет группы доступа мест хранения.
//
//	Возвращаемое значение:
//		Булево - если ИСТИНА, значит группы доступа используются.
//
Функция ИспользуютсяГруппыДоступа() Экспорт
	
	Возврат
		ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей")
		И ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаМестХранения");
	
КонецФункции

Функция ГруппаДоступаПоУмолчанию(Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ГруппаДоступа = УправлениеITОтделом8УФПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяГруппаДоступаМестХранения");
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		Возврат ГруппаДоступа;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыДоступаМестХранения.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступаМестХранения КАК ГруппыДоступаМестХранения
	|ГДЕ
	|	ГруппыДоступаМестХранения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ГруппаДоступа);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат ГруппаДоступа;
	Иначе
		Возврат Справочники.ГруппыДоступаМестХранения.ПустаяСсылка();
	КонецЕсли;

КонецФункции 

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
		
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли