
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерезаполнитьПослеВопроса", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, 
		НСтр("ru = 'Будут восстановлены первоначальные параметры расчетов. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерезаполнитьПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыРасчетовНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыРасчетовНаСервере()
	
	Справочники.ПараметрыРасчетов.ЗаполнитьПараметрыРасчетов();
	
КонецПроцедуры

#КонецОбласти