
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		ДоговорСсылка = Ссылка.Договор;
		Если ЗначениеЗаполнено(ДоговорСсылка) Тогда
			РегистрыСведений.СвязьПервичныхДокументов.УстановитьСвязьПервичногоДокумента(Ссылка, ДоговорСсылка);
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда		
		Контрагент	= ДанныеЗаполнения.Владелец;
		Организация = ДанныеЗаполнения.Организация;
		Договор 	= ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЕстьОригинал		= Ложь;
	ПереданВОплату		= Ложь;
	Оплачен				= Ложь;
	ПереданВАрхив		= Ложь;
	ЭДО					= Ложь;
	НомерДокумента		= "";
	Дата				= Дата(1, 1, 1);
	ДатаПередачиВОплату	= Дата(1,1,1);
	ДатаОплаты			= Дата(1,1,1);
	ДатаПередачиВАрхив	= Дата(1,1,1);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
