#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет предопределенные элементы.
//
// Параметры:
//   МассивЗаполнения - Массив - массив, который передан для перезаполнения, 
//		содержит ссылки на справочник Процессы, если Неопределено, значит полное перезаполнение.
//
Процедура ЗаполнитьПриПервоначальномЗаполнении() Экспорт
	
	Спр = Справочники.ОформленияОповещенийEmailПравилСобытий;
	
	Объект = Спр.СтандартноеОформление.ПолучитьОбъект();
	Объект.Наименование = НСтр("ru = 'Стандартное оформление'");
	Объект.БлокШапка 	= ТекстМакета("ШапкаСтандартноеОформление");
	Объект.БлокПодвал 	= ТекстМакета("ПодвалСтандартноеОформление");
	Объект.Записать();
	
	Объект = Спр.СовременныйШаблон.ПолучитьОбъект();
	Объект.Наименование = НСтр("ru = 'Современный шаблон'");
	Объект.БлокШапка 	= ТекстМакета("ШапкаСовременныйШаблон");
	Объект.БлокПодвал 	= ТекстМакета("ПодвалСовременныйШаблон");
	Объект.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстМакета(ИмяМакета)
	
	Макет = Справочники.ОформленияОповещенийEmailПравилСобытий.ПолучитьМакет(ИмяМакета);
	Возврат Макет.ПолучитьТекст();
	
КонецФункции

Функция ИзображениеМакета(ИмяМакета)
	
	Макет = Справочники.ОформленияОповещенийEmailПравилСобытий.ПолучитьМакет(ИмяМакета);
	Возврат Новый ХранилищеЗначения(Макет);

КонецФункции

#КонецОбласти

#КонецЕсли