////////////////////////////////////////////////////////////////////////////////
// КОД ПРОЦЕДУР И ФУНКЦИЙ модуля УправлениеДоступомПереопределяемый.
// для поддержки библиотечного подхода разработки.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
		
	ВидДоступа 				 = ВидыДоступа.Добавить();
	ВидДоступа.Имя 			 = "Подразделения";
	ВидДоступа.Представление = НСтр("ru = 'Подразделения'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Подразделения");	
	
	ВидДоступа 				 = ВидыДоступа.Добавить();
	ВидДоступа.Имя 			 = "ГруппыМестХранения";
	ВидДоступа.Представление = НСтр("ru = 'Группы мест хранения'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.МестаХранения");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаМестХранения");
	
	ВидДоступа 				 = ВидыДоступа.Добавить();
	ВидДоступа.Имя 			 = "ГруппыКонтрагентов";
	ВидДоступа.Представление = НСтр("ru = 'Группы контрагентов'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Контрагенты");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаКонтрагентов");
	
	ВидДоступа 				 = ВидыДоступа.Добавить();
	ВидДоступа.Имя 			 = "ГруппыКатегорийБазыЗнаний";
	ВидДоступа.Представление = НСтр("ru = 'Группы категорий базы знаний'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.КатегорииБазыЗнаний");
	ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаКатегорийБазыЗнаний");
	
	ВидДоступа 				 = ВидыДоступа.Добавить();
	ВидДоступа.Имя 			 = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");	
	
КонецПроцедуры

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	// Документы.
	Списки.Вставить(Метаданные.Документы.TelegramСообщениеВходящее, 			Ложь);
	Списки.Вставить(Метаданные.Документы.TelegramСообщениеИсходящее, 			Ложь);
	Списки.Вставить(Метаданные.Документы.Доверенность, 							Ложь);
	Списки.Вставить(Метаданные.Документы.ЕжедневныйОтчет,						Ложь);
	Списки.Вставить(Метаданные.Документы.Задание,								Ложь);
	Списки.Вставить(Метаданные.Документы.ЗаказПоставщику,						Ложь);
	Списки.Вставить(Метаданные.Документы.ЗакреплениеСотрудников, 				Ложь);	
	Списки.Вставить(Метаданные.Документы.ИзменениеПоказателейОборудования, 		Ложь);
	Списки.Вставить(Метаданные.Документы.Инвентаризация,						Ложь);
	Списки.Вставить(Метаданные.Документы.ЛистУчетаРабочегоВремени,				Ложь);
	Списки.Вставить(Метаданные.Документы.НарядНаРаботы,							Ложь);
	Списки.Вставить(Метаданные.Документы.НачалоОбслуживания,					Ложь);
	Списки.Вставить(Метаданные.Документы.ОкончаниеОбслуживания,					Ложь);
	Списки.Вставить(Метаданные.Документы.Перемещение, 							Ложь);
	Списки.Вставить(Метаданные.Документы.ПеремещениеСотрудников,				Ложь);
	Списки.Вставить(Метаданные.Документы.ПланированиеБюджета,					Ложь);
	Списки.Вставить(Метаданные.Документы.Поступление,							Ложь);
	Списки.Вставить(Метаданные.Документы.ПраваДоступаКИнформационнымРесурсам, 	Ложь);
	Списки.Вставить(Метаданные.Документы.Проблема,								Ложь);
	Списки.Вставить(Метаданные.Документы.Продажа,								Ложь);
	Списки.Вставить(Метаданные.Документы.РазбиениеКомплектации,					Ложь);
	Списки.Вставить(Метаданные.Документы.СборкаКомплектация,					Ложь);
	Списки.Вставить(Метаданные.Документы.СнятиеЗакрепленияСотрудников,			Ложь);
	Списки.Вставить(Метаданные.Документы.СоглашениеSLA,							Ложь);
	Списки.Вставить(Метаданные.Документы.Списание,								Ложь);
	Списки.Вставить(Метаданные.Документы.УчетДенежныхСредств,					Ложь);
	Списки.Вставить(Метаданные.Документы.НазначениеНачисленийИУдержаний,		Ложь);
	Списки.Вставить(Метаданные.Документы.НачислениеЗаработнойПлаты,				Ложь);
	Списки.Вставить(Метаданные.Документы.ЗаказКлиента,							Ложь);
	
	// Журналы документов.
	Списки.Вставить(Метаданные.ЖурналыДокументов.ОтветственныеСотрудники, 		Ложь);
	Списки.Вставить(Метаданные.ЖурналыДокументов.РемонтИОбслуживание, 			Ложь);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СкладскиеДокументы,			Ложь);
	
	// Регистры.
	Списки.Вставить(Метаданные.РегистрыНакопления.ВзаиморасчетыСКонтрагентами, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПоставщикам,			Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.Закупки,						Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОбслуживаниеКонтрагентами, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОплатаДокументов,				Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.Остатки,						Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.Продажи,						Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.Работы,						Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.Ремонты, 						Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.УчетВремени, 					Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.ВзаиморасчетыССотрудниками,	Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.НачисленияИУдержания,			Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыКлиентов,				Ложь);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДополнительныеРасходы,		Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.БлокировкаСтатьейБазыЗнаний, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.ИзбранноеБазыЗнаний, 			Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.ИсторияСтатейБазыЗнаний, 		Ложь);	
	Списки.Вставить(Метаданные.РегистрыСведений.ОтветственныеСотрудники, 		Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.ОтветственныеСотрудникиИТОтдела,Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.РейтингКлючевыхСловБазыЗнаний, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.РейтингСтатейБазыЗнаний, 		Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.СвязьКлючевыхСловБазыЗнаний, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.СвязьСтатейБазыЗнаний, 			Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатистикаКатегорийБазыЗнаний, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатистикаСтатейБазыЗнаний, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.ПлановыеНачисленияИУдержания, 	Ложь);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОСотрудниках, 			Ложь);
	
	// Справочники.
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчета, 					Ложь);
	Списки.Вставить(Метаданные.Справочники.Бюджеты, 							Ложь);
	Списки.Вставить(Метаданные.Справочники.ГруппыДоступаКатегорийБазыЗнаний,	Ложь);
	Списки.Вставить(Метаданные.Справочники.ГруппыДоступаКонтрагентов,			Ложь);
	Списки.Вставить(Метаданные.Справочники.ГруппыДоступаМестХранения,			Ложь);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов,				Ложь);
	Списки.Вставить(Метаданные.Справочники.КатегорииБазыЗнаний,					Ложь);
	Списки.Вставить(Метаданные.Справочники.КонтактныеЛица,						Ложь);
	Списки.Вставить(Метаданные.Справочники.Контрагенты,							Ложь);
	Списки.Вставить(Метаданные.Справочники.МестаХранения, 						Ложь);
	Списки.Вставить(Метаданные.Справочники.НовостиБазыЗнаний,					Ложь);
	Списки.Вставить(Метаданные.Справочники.Организации, 						Ложь);
	Списки.Вставить(Метаданные.Справочники.Подразделения,						Ложь);
	Списки.Вставить(Метаданные.Справочники.Местоположения, 						Ложь);
	Списки.Вставить(Метаданные.Справочники.Сотрудники,							Ложь);
	Списки.Вставить(Метаданные.Справочники.СтатьиБазыЗнаний,					Ложь);
	Списки.Вставить(Метаданные.Справочники.УдаленноеУправление, 				Ложь);
	Списки.Вставить(Метаданные.Справочники.ПервичныеДокументы,					Ложь);
	Списки.Вставить(Метаданные.Справочники.ЛогиныИПароли,						Ложь);
	
КонецПроцедуры

// Вызывается из переопределяемого модуля.
// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
#Область Документы	
	
	Если Список = Метаданные.Документы.TelegramСообщениеВходящее
		ИЛИ Список = Метаданные.Документы.TelegramСообщениеИсходящее Тогда
		Ограничение.Текст = "";
		
	ИначеЕсли Список = Метаданные.Документы.Доверенность Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.ЕжедневныйОтчет Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.Задание Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Инициатор, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Клиент, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.ЗаказПоставщику Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Номенклатура.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.ЗакреплениеСотрудников Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.МестоХранения, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.ИзменениеПоказателейОборудования Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.Инвентаризация Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)		
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Номенклатура.МестоХранения, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.ЛистУчетаРабочегоВремени Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.НарядНаРаботы Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Работы.Инициатор, NULL КАК ИСТИНА, Неопределено КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Работы.Клиент, NULL КАК ИСТИНА, Неопределено КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Работы.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Номенклатура.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.НачалоОбслуживания Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(МестоОбслуживания, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Номенклатура.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Услуги.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.ОкончаниеОбслуживания Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(МестоОбслуживания, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(МестоХраненияНаСклад, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(МестоХраненияСоСклада, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Номенклатура.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Услуги.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.Перемещение Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(ОрганизацияРасхода, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(ОрганизацияПрихода, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХраненияРасхода, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(МестоХраненияПрихода, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.ПеремещениеСотрудников Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.СтароеМестоХранения, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.НовоеМестоХранения, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.ПланированиеБюджета Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Бюджеты.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.Поступление Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)		
		|	И ДляВсехСтрок(ЗначениеРазрешено(Номенклатура.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Услуги.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(Накладная.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.ПраваДоступаКИнформационнымРесурсам Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.Проблема Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.Продажа Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.РазбиениеКомплектации Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)		
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.СборкаКомплектация Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)		
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Документы.СнятиеЗакрепленияСотрудников Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.МестоХранения, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.СоглашениеSLA Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, Неопределено КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Клиенты.Клиент, NULL КАК ИСТИНА, Неопределено КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.Списание Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина)		
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Номенклатура.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.УчетДенежныхСредств Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)		
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Оплата.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))
		|	И ДляВсехСтрок(ЗначениеРазрешено(ЗаработнаяПлата.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.НазначениеНачисленийИУдержаний Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)		
		|	И ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.Подразделение, NULL КАК ИСТИНА, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Документы.НачислениеЗаработнойПлаты Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация, Неопределено КАК Истина)		
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";	
		

	ИначеЕсли Список = Метаданные.ЖурналыДокументов.ОтветственныеСотрудники
		ИЛИ Список = Метаданные.ЖурналыДокументов.РемонтИОбслуживание
		ИЛИ Список = Метаданные.ЖурналыДокументов.СкладскиеДокументы Тогда
			
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЧтениеОбъектаРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.ВзаиморасчетыСКонтрагентами Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Контрагент)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.ЗаказыПоставщикам Тогда
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Контрагент)
		|	И ЗначениеРазрешено(Подразделение)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.Закупки Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Контрагент)
		|	И ЗначениеРазрешено(МестоХранения)
		|	И ЗначениеРазрешено(Подразделение)";

	ИначеЕсли Список = Метаданные.РегистрыНакопления.ОбслуживаниеКонтрагентами Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Контрагент)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.ОплатаДокументов Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";	
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.Остатки Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)	
		|	И ЗначениеРазрешено(МестоХранения)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.Продажи Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Контрагент)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.Работы Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Инициатор)
		|	И ЗначениеРазрешено(Клиент)
		|	И ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Подразделение)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.Ремонты Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.УчетВремени Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Подразделение)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.ВзаиморасчетыССотрудниками Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Подразделение)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.НачисленияИУдержания Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Подразделение)";
		
	ИначеЕсли Список = Метаданные.РегистрыНакопления.ДополнительныеРасходы Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";	
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.БлокировкаСтатьейБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(СтатьяБазыЗнаний)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.ИзбранноеБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(КатегорияБазыЗнаний)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.ИсторияСтатейБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(СтатьяБазыЗнаний)";			
			
	ИначеЕсли Список = Метаданные.РегистрыСведений.ОтветственныеСотрудники Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(МестоХранения)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.ОтветственныеСотрудникиИТОтдела Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(МестоХранения)";		
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.РейтингКлючевыхСловБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(КатегорияБазыЗнаний)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.РейтингСтатейБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(СтатьяБазыЗнаний)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.СвязьКлючевыхСловБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(СтатьяБазыЗнаний)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.СвязьСтатейБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Статья)
		|	И ЗначениеРазрешено(Объект)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.СтатистикаКатегорийБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(КатегорияБазыЗнаний)";	
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.СтатистикаСтатейБазыЗнаний Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(СтатьяБазыЗнаний)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.ПлановыеНачисленияИУдержания Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";
		
	ИначеЕсли Список = Метаданные.РегистрыСведений.СведенияОСотрудниках Тогда	
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";	
		
	ИначеЕсли Список = Метаданные.Справочники.БанковскиеСчета Тогда
		Ограничение.Текст =
		"РазрешитьЧтение
		|ГДЕ
		|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
		|	И ЧтениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
		|	ИЛИ
		|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты))
		|	И ЧтениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты))
		|;
		|РазрешитьИзменениеЕслиРазрешеноЧтение
		|ГДЕ
		|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
		|	И ИзменениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
		|	ИЛИ
		|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты))
		|	И ИзменениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Контрагенты))";
		
	ИначеЕсли Список = Метаданные.Справочники.Бюджеты Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЭтоГруппа ИЛИ
		|	ДляВсехСтрок(ЗначениеРазрешено(Организации.Организация, NULL КАК ИСТИНА, Неопределено КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Справочники.ГруппыДоступаКатегорийБазыЗнаний Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ссылка)";	
		
	ИначеЕсли Список = Метаданные.Справочники.ГруппыДоступаКонтрагентов Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.Справочники.ГруппыДоступаМестХранения Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ссылка)";		
		
	ИначеЕсли Список = Метаданные.Справочники.ДоговорыКонтрагентов Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(Владелец)";
		
	ИначеЕсли Список = Метаданные.Справочники.КатегорииБазыЗнаний Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.Справочники.КонтактныеЛица Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ	
		|	ЗначениеРазрешено(Владелец)";
		
	ИначеЕсли Список = Метаданные.Справочники.Контрагенты Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЭтоГруппа ИЛИ
		|	ЗначениеРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.Справочники.МестаХранения Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ	
		|	ЗначениеРазрешено(Ссылка)
		|	И ЗначениеРазрешено(Организация, Неопределено КАК Истина)
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Справочники.НовостиБазыЗнаний Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ	
		|	ЗначениеРазрешено(Ссылка)";

	ИначеЕсли Список = Метаданные.Справочники.Организации Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.Справочники.Подразделения Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.Справочники.Местоположения Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ДляВсехСтрок(ЗначениеРазрешено(МестаХранения.МестоХранения, Null КАК Истина, ПустаяСсылка КАК Истина))";	
		
	ИначеЕсли Список = Метаданные.Справочники.Сотрудники Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЭтоГруппа ИЛИ
		|	(ЗначениеРазрешено(Организация, Неопределено КАК Истина) 
		|	И ЗначениеРазрешено(Подразделение, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(МестоХранения, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Справочники.СтатьиБазыЗнаний Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ссылка)
		|	И ДляВсехСтрок(ЗначениеРазрешено(Категории.Категория, Null КАК Истина, ПустаяСсылка КАК Истина))";
		
	ИначеЕсли Список = Метаданные.Справочники.УдаленноеУправление Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЭтоГруппа ИЛИ
		|	ЗначениеРазрешено(Владелец)";
		
	ИначеЕсли Список = Метаданные.Справочники.ПервичныеДокументы Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Контрагент, ПустаяСсылка КАК Истина)
		|	И ЗначениеРазрешено(Организация, Неопределено КАК Истина)";
		
	ИначеЕсли Список = Метаданные.Справочники.ЛогиныИПароли Тогда		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Объект, ПустаяСсылка КАК Истина)";	
		
	КонецЕсли;
	
#КонецОбласти

КонецПроцедуры

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

#Область Описание_профиля_Бухгалтер

	// Описание для заполнения профиля "Бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "ea55b08d-7d30-11e0-b9a7-20cf30c960bf";
	ОписаниеПрофиля.Наименование  = "Бухгалтер";
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДенежныхДокументов"                               );	
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеФизическихЛиц"                                    );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеСкладскихДокументов"								);
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеОплат"								);
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеВариантовОтчетов"					);
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",	      "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",     "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыМестХранения","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов","ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_СотрудникСклада

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "62730c03-81d6-11e0-a42a-be487808c52b";	
	ОписаниеПрофиля.Наименование  = "Сотрудник склада";
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);	
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеСкладскихДокументов" );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеМестХранения" 		);	
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеДенежныхДокументов"               );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеОбщейБазовойНСИ"                  );
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеФизическихЛиц"                    );
	
	// Виды Доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",	      "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",     "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыМестХранения","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов","ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти	

#Область Описание_профиля_СотрудникРемонта

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "66ce5549-aae3-11e0-9746-01179a3853da";	
	ОписаниеПрофиля.Наименование  = "Сотрудник ремонта";
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить           (  "ЧтениеФизическихЛиц"                    );
	ОписаниеПрофиля.Роли.Добавить           (  "ДобавлениеИзменениеОбслуживанияРемонтов");
	
	// Виды Доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",	      "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",     "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыМестХранения","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов","ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область Описание_профиля_ВнешнийПоставщик

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f23a89fd-2486-4d4e-8ccb-cee2f9cbb7aa";
	ОписаниеПрофиля.Наименование  = "Внешний поставщик";	
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУФ");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");		
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");	
	ОписаниеПрофиля.Роли.Добавить("ServiceDeskДобавлениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ServiceDeskЧтениеЗаданий");
	
	// Виды Доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",	      "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",     "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыМестХранения","ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов","ВначалеВсеЗапрещены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти
	
КонецПроцедуры

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
//
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
		
	Описание = Описание + 
	"
	|Справочник.Бюджеты.Чтение.Организации
	|Справочник.Бюджеты.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.УдаленноеУправление.Чтение.Организации
	|Справочник.УдаленноеУправление.Изменение.Организации
	|Справочник.МестаХранения.Чтение.Организации
	|Справочник.МестаХранения.Изменение.Организации
	|Справочник.Подразделения.Чтение.Организации
	|Справочник.Подразделения.Изменение.Организации
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Изменение.Организации
	|Документ.Доверенность.Чтение.Организации
	|Документ.Доверенность.Изменение.Организации
	|Документ.Задание.Чтение.Организации
	|Документ.Задание.Изменение.Организации
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗакреплениеСотрудников.Чтение.Организации
	|Документ.ЗакреплениеСотрудников.Изменение.Организации
	|Документ.ИзменениеПоказателейОборудования.Чтение.Организации
	|Документ.ИзменениеПоказателейОборудования.Изменение.Организации
	|Документ.ЕжедневныйОтчет.Чтение.Организации
	|Документ.ЕжедневныйОтчет.Изменение.Организации
	|Документ.Инвентаризация.Чтение.Организации
	|Документ.Инвентаризация.Изменение.Организации
	|Документ.НачалоОбслуживания.Чтение.Организации
	|Документ.НачалоОбслуживания.Изменение.Организации
	|Документ.ОкончаниеОбслуживания.Чтение.Организации
	|Документ.ОкончаниеОбслуживания.Изменение.Организации
	|Документ.Перемещение.Чтение.Организации
	|Документ.Перемещение.Изменение.Организации
	|Документ.ПеремещениеСотрудников.Чтение.Организации
	|Документ.ПеремещениеСотрудников.Изменение.Организации
	|Документ.Поступление.Чтение.Организации
	|Документ.Поступление.Изменение.Организации
	|Документ.Продажа.Чтение.Организации
	|Документ.Продажа.Изменение.Организации
	|Документ.РазбиениеКомплектации.Чтение.Организации
	|Документ.РазбиениеКомплектации.Изменение.Организации
	|Документ.УчетДенежныхСредств.Чтение.Организации
	|Документ.УчетДенежныхСредств.Изменение.Организации
	|Документ.СнятиеЗакрепленияСотрудников.Чтение.Организации
	|Документ.СнятиеЗакрепленияСотрудников.Изменение.Организации
	|Документ.СоглашениеSLA.Чтение.Организации
	|Документ.СоглашениеSLA.Изменение.Организации
	|Документ.Списание.Чтение.Организации
	|Документ.Списание.Изменение.Организации
	|Документ.НарядНаРаботы.Чтение.Организации
	|Документ.НарядНаРаботы.Изменение.Организации
	|Документ.ПланированиеБюджета.Чтение.Организации
	|Документ.ПланированиеБюджета.Изменение.Организации
	|Документ.СборкаКомплектация.Чтение.Организации
	|Документ.СборкаКомплектация.Изменение.Организации
	|ЖурналДокументов.ОтветственныеСотрудники.Чтение.Организации
	|ЖурналДокументов.РемонтИОбслуживание.Чтение.Организации
	|ЖурналДокументов.СкладскиеДокументы.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.Остатки.Чтение.Организации
    |РегистрНакопления.Продажи.Чтение.Организации
	|РегистрНакопления.Работы.Чтение.Организации
	|РегистрНакопления.УчетВремени.Чтение.Организации
	|Справочник.УдаленноеУправление.Чтение.Подразделения
	|Справочник.УдаленноеУправление.Изменение.Подразделения
	|Справочник.МестаХранения.Чтение.Подразделения
	|Справочник.МестаХранения.Изменение.Подразделения
	|Справочник.Подразделения.Чтение.Подразделения	
	|Справочник.Сотрудники.Чтение.Подразделения
	|Справочник.Сотрудники.Изменение.Подразделения
	|Документ.Доверенность.Чтение.Подразделения
	|Документ.Доверенность.Изменение.Подразделения
	|Документ.ЕжедневныйОтчет.Чтение.Подразделения
	|Документ.ЕжедневныйОтчет.Изменение.Подразделения
	|Документ.Задание.Чтение.Подразделения
	|Документ.Задание.Изменение.Подразделения
	|Документ.ЗаказПоставщику.Чтение.Подразделения
	|Документ.ЗаказПоставщику.Изменение.Подразделения
	|Документ.ЗакреплениеСотрудников.Чтение.Подразделения
	|Документ.ЗакреплениеСотрудников.Изменение.Подразделения
	|Документ.ИзменениеПоказателейОборудования.Чтение.Подразделения
	|Документ.ИзменениеПоказателейОборудования.Изменение.Подразделения
	|Документ.Инвентаризация.Чтение.Подразделения
	|Документ.Инвентаризация.Изменение.Подразделения
	|Документ.ЛистУчетаРабочегоВремени.Чтение.Подразделения
	|Документ.ЛистУчетаРабочегоВремени.Изменение.Подразделения
	|Документ.НарядНаРаботы.Чтение.Подразделения
	|Документ.НарядНаРаботы.Изменение.Подразделения
	|Документ.НачалоОбслуживания.Чтение.Подразделения
	|Документ.НачалоОбслуживания.Изменение.Подразделения
	|Документ.ОкончаниеОбслуживания.Чтение.Подразделения
	|Документ.ОкончаниеОбслуживания.Изменение.Подразделения
	|Документ.Перемещение.Чтение.Подразделения
	|Документ.Перемещение.Изменение.Подразделения
	|Документ.ПеремещениеСотрудников.Чтение.Подразделения
	|Документ.ПеремещениеСотрудников.Изменение.Подразделения
	|Документ.ПланированиеБюджета.Чтение.Подразделения
	|Документ.ПланированиеБюджета.Изменение.Подразделения
	|Документ.Поступление.Чтение.Подразделения
	|Документ.Поступление.Изменение.Подразделения
	|Документ.ПраваДоступаКИнформационнымРесурсам.Чтение.Подразделения
	|Документ.ПраваДоступаКИнформационнымРесурсам.Изменение.Подразделения
	|Документ.Продажа.Чтение.Подразделения
	|Документ.Продажа.Изменение.Подразделения
	|Документ.РазбиениеКомплектации.Чтение.Подразделения
	|Документ.РазбиениеКомплектации.Изменение.Подразделения
	|Документ.СборкаКомплектация.Чтение.Подразделения
	|Документ.СборкаКомплектация.Изменение.Подразделения
	|Документ.СнятиеЗакрепленияСотрудников.Чтение.Подразделения
	|Документ.СнятиеЗакрепленияСотрудников.Изменение.Подразделения
	|Документ.СоглашениеSLA.Чтение.Подразделения
	|Документ.СоглашениеSLA.Изменение.Подразделения
	|Документ.Списание.Чтение.Подразделения
	|Документ.Списание.Изменение.Подразделения
	|Документ.УчетДенежныхСредств.Чтение.Подразделения
	|Документ.УчетДенежныхСредств.Изменение.Подразделения
	|ЖурналДокументов.ОтветственныеСотрудники.Чтение.Подразделения
	|ЖурналДокументов.РемонтИОбслуживание.Чтение.Подразделения
	|ЖурналДокументов.СкладскиеДокументы.Чтение.Подразделения	
	|РегистрНакопления.Работы.Чтение.Подразделения
	|РегистрНакопления.УчетВремени.Чтение.Подразделения
	|Справочник.БанковскиеСчета.Чтение.ГруппыКонтрагентов
	|Справочник.БанковскиеСчета.Изменение.ГруппыКонтрагентов
	|Справочник.ГруппыДоступаКонтрагентов.Чтение.ГруппыКонтрагентов	
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыКонтрагентов
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыКонтрагентов
	|Справочник.КонтактныеЛица.Чтение.ГруппыКонтрагентов
	|Справочник.КонтактныеЛица.Изменение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Чтение.ГруппыКонтрагентов
	|Справочник.Контрагенты.Изменение.ГруппыКонтрагентов
	|Справочник.УдаленноеУправление.Чтение.ГруппыКонтрагентов
	|Справочник.УдаленноеУправление.Изменение.ГруппыКонтрагентов
	|Документ.Доверенность.Чтение.ГруппыКонтрагентов
	|Документ.Доверенность.Изменение.ГруппыКонтрагентов
	|Документ.Задание.Чтение.ГруппыКонтрагентов
	|Документ.Задание.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказПоставщику.Изменение.ГруппыКонтрагентов
	|Документ.ЛистУчетаРабочегоВремени.Чтение.ГруппыКонтрагентов
	|Документ.ЛистУчетаРабочегоВремени.Изменение.ГруппыКонтрагентов
	|Документ.НарядНаРаботы.Чтение.ГруппыКонтрагентов
	|Документ.НарядНаРаботы.Изменение.ГруппыКонтрагентов
	|Документ.НачалоОбслуживания.Чтение.ГруппыКонтрагентов
	|Документ.НачалоОбслуживания.Изменение.ГруппыКонтрагентов
	|Документ.ОкончаниеОбслуживания.Чтение.ГруппыКонтрагентов
	|Документ.ОкончаниеОбслуживания.Изменение.ГруппыКонтрагентов
	|Документ.Поступление.Чтение.ГруппыКонтрагентов
	|Документ.Поступление.Изменение.ГруппыКонтрагентов
	|Документ.Продажа.Чтение.ГруппыКонтрагентов
	|Документ.Продажа.Изменение.ГруппыКонтрагентов
	|Документ.СоглашениеSLA.Чтение.ГруппыКонтрагентов
	|Документ.СоглашениеSLA.Изменение.ГруппыКонтрагентов
	|Документ.УчетДенежныхСредств.Чтение.ГруппыКонтрагентов
	|Документ.УчетДенежныхСредств.Изменение.ГруппыКонтрагентов
	|Документ.Инвентаризация.Чтение.ГруппыКонтрагентов
	|Документ.Инвентаризация.Изменение.ГруппыКонтрагентов
	|Документ.Перемещение.Чтение.ГруппыКонтрагентов
	|Документ.Перемещение.Изменение.ГруппыКонтрагентов
	|Документ.РазбиениеКомплектации.Чтение.ГруппыКонтрагентов
	|Документ.РазбиениеКомплектации.Изменение.ГруппыКонтрагентов
	|Документ.СборкаКомплектация.Чтение.ГруппыКонтрагентов
	|Документ.СборкаКомплектация.Изменение.ГруппыКонтрагентов
    |Документ.Списание.Чтение.ГруппыКонтрагентов
	|Документ.Списание.Изменение.ГруппыКонтрагентов	
	|ЖурналДокументов.РемонтИОбслуживание.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ВзаиморасчетыСКонтрагентами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Закупки.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ОбслуживаниеКонтрагентами.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Остатки.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Продажи.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Работы.Чтение.ГруппыКонтрагентов
	|Справочник.ГруппыДоступаМестХранения.Чтение.ГруппыМестХранения	
	|Справочник.МестаХранения.Чтение.ГруппыМестХранения
	|Справочник.МестаХранения.Изменение.ГруппыМестХранения
	|Справочник.УдаленноеУправление.Чтение.ГруппыМестХранения
	|Справочник.УдаленноеУправление.Изменение.ГруппыМестХранения
	|Справочник.Местоположения.Чтение.ГруппыМестХранения
	|Справочник.Местоположения.Изменение.ГруппыМестХранения
	|Документ.Задание.Чтение.ГруппыМестХранения
	|Документ.Задание.Изменение.ГруппыМестХранения
	|Документ.ЗаказПоставщику.Чтение.ГруппыМестХранения
	|Документ.ЗаказПоставщику.Изменение.ГруппыМестХранения
	|Документ.ЗакреплениеСотрудников.Чтение.ГруппыМестХранения
	|Документ.ЗакреплениеСотрудников.Изменение.ГруппыМестХранения
	|Документ.ИзменениеПоказателейОборудования.Чтение.ГруппыМестХранения
	|Документ.ИзменениеПоказателейОборудования.Изменение.ГруппыМестХранения
	|Документ.Инвентаризация.Чтение.ГруппыМестХранения
	|Документ.Инвентаризация.Изменение.ГруппыМестХранения
	|Документ.НарядНаРаботы.Чтение.ГруппыМестХранения
	|Документ.НарядНаРаботы.Изменение.ГруппыМестХранения
	|Документ.НачалоОбслуживания.Чтение.ГруппыМестХранения
	|Документ.НачалоОбслуживания.Изменение.ГруппыМестХранения
	|Документ.ОкончаниеОбслуживания.Чтение.ГруппыМестХранения
	|Документ.ОкончаниеОбслуживания.Изменение.ГруппыМестХранения
	|Документ.Перемещение.Чтение.ГруппыМестХранения
	|Документ.Перемещение.Изменение.ГруппыМестХранения
	|Документ.ПеремещениеСотрудников.Чтение.ГруппыМестХранения
	|Документ.ПеремещениеСотрудников.Изменение.ГруппыМестХранения
	|Документ.Поступление.Чтение.ГруппыМестХранения
	|Документ.Поступление.Изменение.ГруппыМестХранения
	|Документ.Продажа.Чтение.ГруппыМестХранения
	|Документ.Продажа.Изменение.ГруппыМестХранения
	|Документ.РазбиениеКомплектации.Чтение.ГруппыМестХранения
	|Документ.РазбиениеКомплектации.Изменение.ГруппыМестХранения
	|Документ.СборкаКомплектация.Чтение.ГруппыМестХранения
	|Документ.СборкаКомплектация.Изменение.ГруппыМестХранения
	|Документ.СнятиеЗакрепленияСотрудников.Чтение.ГруппыМестХранения
	|Документ.СнятиеЗакрепленияСотрудников.Изменение.ГруппыМестХранения
	|Документ.Списание.Чтение.ГруппыМестХранения
	|Документ.Списание.Изменение.ГруппыМестХранения
	|ЖурналДокументов.РемонтИОбслуживание.Чтение.ГруппыМестХранения
	|ЖурналДокументов.СкладскиеДокументы.Чтение.ГруппыМестХранения
	|РегистрНакопления.Закупки.Чтение.ГруппыМестХранения
	|РегистрНакопления.Остатки.Чтение.ГруппыМестХранения
	|РегистрСведений.ОтветственныеСотрудникиИТОтдела.Чтение.ГруппыКонтрагентов
	|РегистрСведений.ОтветственныеСотрудникиИТОтдела.Чтение.ГруппыМестХранения
	|РегистрСведений.ОтветственныеСотрудникиИТОтдела.Чтение.Организации
	|РегистрСведений.ОтветственныеСотрудникиИТОтдела.Чтение.Подразделения
	|Документ.ИзменениеПоказателейОборудования.Чтение.ГруппыКонтрагентов
	|Документ.ИзменениеПоказателейОборудования.Изменение.ГруппыКонтрагентов
	|Документ.ЗакреплениеСотрудников.Чтение.ГруппыКонтрагентов
	|Документ.ЗакреплениеСотрудников.Изменение.ГруппыКонтрагентов
	|Документ.ПраваДоступаКИнформационнымРесурсам.Чтение.ГруппыКонтрагентов
	|Документ.ПраваДоступаКИнформационнымРесурсам.Изменение.ГруппыКонтрагентов
	|Документ.ПраваДоступаКИнформационнымРесурсам.Чтение.Организации
	|Документ.ПраваДоступаКИнформационнымРесурсам.Изменение.Организации
	|Документ.СнятиеЗакрепленияСотрудников.Чтение.ГруппыКонтрагентов
	|Документ.СнятиеЗакрепленияСотрудников.Изменение.ГруппыКонтрагентов
	|РегистрСведений.ОтветственныеСотрудники.Чтение.ГруппыКонтрагентов
	|РегистрСведений.ОтветственныеСотрудники.Чтение.ГруппыМестХранения
	|РегистрСведений.ОтветственныеСотрудники.Чтение.Организации
	|РегистрСведений.ОтветственныеСотрудники.Чтение.Подразделения
	|Справочник.Организации.Чтение.Организации
	|Справочник.БанковскиеСчета.Чтение.Организации
	|Справочник.БанковскиеСчета.Изменение.Организации
	|Справочник.Бюджеты.Чтение.ГруппыКонтрагентов
	|Справочник.Бюджеты.Изменение.ГруппыКонтрагентов
    |РегистрНакопления.ВзаиморасчетыСКонтрагентами.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Подразделения
	|РегистрНакопления.ОбслуживаниеКонтрагентами.Чтение.Организации
	|РегистрНакопления.Ремонты.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.Ремонты.Чтение.Организации
	|Справочник.Сотрудники.Чтение.ГруппыКонтрагентов
	|Справочник.Сотрудники.Изменение.ГруппыКонтрагентов
	|Справочник.МестаХранения.Чтение.ГруппыКонтрагентов
	|Справочник.МестаХранения.Изменение.ГруппыКонтрагентов
	|Документ.Проблема.Чтение.Организации
	|Документ.Проблема.Изменение.Организации
	|РегистрНакопления.ОплатаДокументов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ОплатаДокументов.Чтение.Организации
	|РегистрСведений.БлокировкаСтатьейБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.ИзбранноеБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.ИсторияСтатейБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.РейтингКлючевыхСловБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.СвязьКлючевыхСловБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.СтатистикаКатегорийБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.СтатистикаСтатейБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.РейтингСтатейБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|РегистрСведений.СвязьСтатейБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|Справочник.ГруппыДоступаКатегорийБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|Справочник.КатегорииБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|Справочник.КатегорииБазыЗнаний.Изменение.ГруппыКатегорийБазыЗнаний
	|Справочник.НовостиБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|Справочник.НовостиБазыЗнаний.Изменение.ГруппыКатегорийБазыЗнаний
	|Справочник.СтатьиБазыЗнаний.Чтение.ГруппыКатегорийБазыЗнаний
	|Справочник.СтатьиБазыЗнаний.Изменение.ГруппыКатегорийБазыЗнаний
	|РегистрНакопления.УчетВремени.Чтение.ГруппыКонтрагентов
	|Документ.ПеремещениеСотрудников.Чтение.ГруппыКонтрагентов
	|Документ.ПеремещениеСотрудников.Изменение.ГруппыКонтрагентов
	|Справочник.Подразделения.Чтение.ГруппыКонтрагентов
	|Справочник.Подразделения.Изменение.ГруппыКонтрагентов
	|Справочник.Подразделения.Изменение.Подразделения
	|Документ.ЛистУчетаРабочегоВремени.Чтение.Организации
	|Документ.ЛистУчетаРабочегоВремени.Изменение.Организации
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.TelegramСообщениеВходящее
	|Справочник.ПервичныеДокументы.Чтение.ГруппыКонтрагентов
	|Справочник.ПервичныеДокументы.Чтение.Организации
	|Справочник.ПервичныеДокументы.Изменение.ГруппыКонтрагентов
	|Справочник.ПервичныеДокументы.Изменение.Организации	
	|Документ.НазначениеНачисленийИУдержаний.Чтение.ГруппыКонтрагентов
	|Документ.НазначениеНачисленийИУдержаний.Чтение.Организации
	|Документ.НазначениеНачисленийИУдержаний.Чтение.Подразделения
	|Документ.НазначениеНачисленийИУдержаний.Изменение.ГруппыКонтрагентов
	|Документ.НазначениеНачисленийИУдержаний.Изменение.Организации
	|Документ.НазначениеНачисленийИУдержаний.Изменение.Подразделения	
	|Документ.НачислениеЗаработнойПлаты.Чтение.ГруппыКонтрагентов
	|Документ.НачислениеЗаработнойПлаты.Чтение.Организации
	|Документ.НачислениеЗаработнойПлаты.Чтение.Подразделения
	|Документ.НачислениеЗаработнойПлаты.Изменение.ГруппыКонтрагентов
	|Документ.НачислениеЗаработнойПлаты.Изменение.Организации
	|Документ.НачислениеЗаработнойПлаты.Изменение.Подразделения		
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Подразделения	
	|РегистрНакопления.НачисленияИУдержания.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.НачисленияИУдержания.Чтение.Организации
	|РегистрНакопления.НачисленияИУдержания.Чтение.Подразделения	
	|РегистрСведений.ПлановыеНачисленияИУдержания.Чтение.ГруппыКонтрагентов
	|РегистрСведений.ПлановыеНачисленияИУдержания.Чтение.Организации	
	|РегистрСведений.СведенияОСотрудниках.Чтение.ГруппыКонтрагентов
	|РегистрСведений.СведенияОСотрудниках.Чтение.Организации
	|Справочник.ЛогиныИПароли.Чтение.ГруппыКонтрагентов
	|Справочник.ЛогиныИПароли.Чтение.ГруппыМестХранения
	|Справочник.ЛогиныИПароли.Чтение.Организации
	|Справочник.ЛогиныИПароли.Чтение.Подразделения
	|Справочник.ЛогиныИПароли.Изменение.ГруппыКонтрагентов
	|Справочник.ЛогиныИПароли.Изменение.ГруппыМестХранения
	|Справочник.ЛогиныИПароли.Изменение.Организации
	|Справочник.ЛогиныИПароли.Изменение.Подразделения
	|Документ.ЗаказКлиента.Чтение.ГруппыКонтрагентов
	|Документ.ЗаказКлиента.Чтение.ГруппыМестХранения
	|Документ.ЗаказКлиента.Чтение.Организации
	|Документ.ЗаказКлиента.Изменение.ГруппыКонтрагентов
	|Документ.ЗаказКлиента.Изменение.ГруппыМестХранения
	|Документ.ЗаказКлиента.Изменение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Организации
	|РегистрНакопления.ДополнительныеРасходы.Чтение.ГруппыКонтрагентов
	|РегистрНакопления.ДополнительныеРасходы.Чтение.Организации
	|";
	
КонецПроцедуры

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидДоступа = "ГруппыМестХранения" Тогда
        Использование = Константы.ИспользоватьГруппыДоступаМестХранения.Получить();
		
    ИначеЕсли ВидДоступа = "ГруппыКонтрагентов" Тогда
        Использование = Константы.ИспользоватьГруппыДоступаКонтрагентов.Получить();
		
    ИначеЕсли ВидДоступа = "ГруппыКатегорийБазыЗнаний" Тогда
        Использование = Константы.ИспользоватьГруппыДоступаКатегорийБазыЗнаний.Получить();
		
    КонецЕсли;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля.
// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
	УпрощенныйИнтерфейс = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля)

	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУФ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	// Заметки
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");	
	// Напоминание
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");	
	//Работа с почтовыми сообщениями
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");		
	// Печать
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	// Дополнительные сведения.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	// Редактирование реквизитов объектов.
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	// Вариантов отчетов
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	// Использование дополнительных отчетов и обработок.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	// Просмотр базы знаний
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБазыЗнаний");	
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
КонецПроцедуры

#КонецОбласти