
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппировкаСписка   		= Список.Группировка.Элементы;   
	ЭлементГруппировки   		= ГруппировкаСписка.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));   
	ЭлементГруппировки.Поле  	= Новый ПолеКомпоновкиДанных("ТипОбъекта");   	
	
	Справочники.ВидыПричинОтклоненияОтГрафика.УстановитьУсловноеОформление(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьЦветаСостоянияСотрудников" Тогда
		УстановитьУсловноеОформление();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПредопределенные(Команда)
	
	ЗаполнитьПредопределенныеНаСервере();
	УстановитьУсловноеОформление();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредопределенныеНаСервере()
	
	Справочники.ВидыПричинОтклоненияОтГрафика.ЗаполнитьВидыПричинОтклоненияОтГрафикаПриПервоначальномЗаполнении();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Справочники.ВидыПричинОтклоненияОтГрафика.УстановитьУсловноеОформление(Список);
	
КонецПроцедуры

#КонецОбласти

