
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	Если ПустаяСтрока(Представление) Тогда
		СтандартнаяОбработка	= Ложь;
		СтрокаНаименование		= Данные.Наименование;
		СтрокаВид 				= Строка(Данные.Вид);
		Представление 			= СтрШаблон(НСтр("ru = '%1 (%2)'"), 
				?(ПустаяСтрока(СтрокаНаименование), СтрокаВид, СтрокаНаименование), 
				СтрокаВид);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Вид");
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
