
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияПрограммаНажатие(Элемент)
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Пустышка", ЭтаФорма), "http://infostart.ru/public/100480/");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАвторНажатие(Элемент)
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Пустышка", ЭтаФорма), "http://infostart.ru/profile/67680/");
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Пустышка", ЭтаФорма), "https://softonit.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура Пустышка(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти