//<< УИТ
// Кнопка формы сделана по умолчанию.
// Добавлена картинка строк для ДеревоАбонентов "ИсполнительПользователь".

#Область Общие_Процедуры_И_Функции

&НаСервере
Процедура сфпСформироватьДеревоАбонентов()
	
	ДеревоАбонентов.ПолучитьЭлементы().Очистить();
	
	Если СписокОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//<< УИТ Переопределили заполнение.
	КореньДерева = ДеревоАбонентов.ПолучитьЭлементы();
	Для Каждого ЭлементСписка Из СписокОбъектов Цикл
		СсылкаНаЭлемент = ЭлементСписка.Значение;
		
		КонтактИмяМетаданных = СсылкаНаЭлемент.Метаданные().Имя;
		
		Если КонтактИмяМетаданных = "Пользователи" И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (пользователь)'");
			
		ИначеЕсли КонтактИмяМетаданных = "Организации" И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (организация)'");
			
		ИначеЕсли КонтактИмяМетаданных = "Контрагенты" Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (контрагент)'");
			
		ИначеЕсли КонтактИмяМетаданных = "Подразделения" Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (подразделение)'");
			
		ИначеЕсли КонтактИмяМетаданных = "ФизическиеЛица" И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (физическое лицо)'");
			
		ИначеЕсли КонтактИмяМетаданных = "Сотрудники" И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + Нстр("ru = ' (сотрудник)'");
			
		ИначеЕсли КонтактИмяМетаданных = "КонтактныеЛица" Тогда
			
			ВеткаДереваРодитель = КореньДерева.Добавить();
			ВеткаДереваРодитель.Ссылка = СсылкаНаЭлемент.Владелец;
			ВеткаДереваРодитель.Объект = Строка(СсылкаНаЭлемент.Владелец) + Нстр("ru = ' (контрагент)'");
			
			
			ВеткаДерева = ВеткаДереваРодитель.ПолучитьЭлементы().Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + " <" + Строка(сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(СсылкаНаЭлемент)) + ">" + Нстр("ru = ' (контактное лицо)'");
		КонецЕсли;		
	КонецЦикла;
	//>>
	
КонецПроцедуры

&НаСервере
Процедура сфпСформироватьЗаголовокФормы(ПодборНомера)
	Если ПодборНомера Тогда
		Заголовок = Нстр(" ru = 'Выберите контакт для номера '") + НомерТелефона;
	Иначе
		Заголовок = Нстр("ru = 'Выберите связанный объект '");
	КонецЕсли;		
КонецПроцедуры	

#КонецОбласти

#Область Обработчики_Событий_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("СписокОбъектов") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СписокОбъектов = Параметры.СписокОбъектов;
	Если Параметры.Свойство("НомерТелефона") Тогда
		НомерТелефона = Параметры.НомерТелефона;
	КонецЕсли;	
	Если Параметры.Свойство("ТолькоКлиентыИКЛ") Тогда
		ТолькоКлиентыИКЛ = Параметры.ТолькоКлиентыИКЛ;
	КонецЕсли;		
	сфпСформироватьЗаголовокФормы(НЕ Параметры.Свойство("ПодборВСобытие"));
	сфпСформироватьДеревоАбонентов();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Событий_Элементов_Формы

&НаКлиенте
Процедура ДеревоАбонентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	Закрыть(ТекДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Команд_Формы

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(,Нстр("ru = 'Не выбран контакт!'"),5);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		ПоказатьЗначение(,ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
