
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновитьПредпросмотр();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ВзаимодействияКлиент.ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура БлокШапкаПриИзменении(Элемент)
	
	ОбновитьПредпросмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокПодвалПриИзменении(Элемент)
	
	ОбновитьПредпросмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьПредпросмотр();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПредпросмотр()
	
	БлокШапка	= ?(ПустаяСтрока(Объект.БлокШапка), "<html><body>", Объект.БлокШапка);
	БлокПодвал	= ?(ПустаяСтрока(Объект.БлокПодвал), "<html><body>", Объект.БлокПодвал);
	
	Документ	= БлокШапка		
		+ "Текст <b>электронного письма</b>, которое будет отправляться из правил событий.<br>
		  |Ссылка <a href=""https://softonit.ru"" target=""_blank"">https://softonit.ru</a><br>
		  |<b>Жиный текст</b>, <i>Курсив</i>, <u>Подчеркнутый</u>
		  |Список:<br>
		  |<ul><li>Тест 1</li><li>Тест 2</li><li>Тест 3</li></ul>
          |<quote>Цитата</quote>
		  |Это пример письма, который будет отправляться подсистемой ""Правила событий"" для уведомления по e-mail."
		+ БлокПодвал;
	
	
КонецПроцедуры

#КонецОбласти