
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Объект") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбъектСписка = Параметры.Объект;	
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список.Отбор, "Объект", ОбъектСписка);
				
	ТекущийПользователь  = Пользователи.ТекущийПользователь();
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьМоиТрудозатраты" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти