
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоМестуХранения") Тогда
		ФлагЗакладки 		= Ложь;
		ФлагВидимостьОтбора = Истина;
		РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список.Отбор, 
			"МестоХранения", Параметры.ОтборПоМестуХранения);
			
	Иначе
		ФлагЗакладки		= Истина;
		ФлагВидимостьОтбора = Ложь;
		
	КонецЕсли;
	
	Элементы.ОбщаяГруппа.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбщаяГруппаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДокументамПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Закладки(Команда)
	
	ФлагЗакладки = НЕ ФлагЗакладки;	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьОтбора(Команда)
	
	ФлагВидимостьОтбора = НЕ ФлагВидимостьОтбора;
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ФлагЗакладки Тогда
		Если Элементы.ОбщаяГруппа.ТекущаяСтраница <> Элементы.ГруппаПоДокументам Тогда
			Элементы.ОбщаяГруппа.ТекущаяСтраница = Элементы.ГруппаПоДокументам;
		КонецЕсли;
	Иначе
		Если Элементы.ОбщаяГруппа.ТекущаяСтраница <> Элементы.ГруппаЖурнал Тогда
			Элементы.ОбщаяГруппа.ТекущаяСтраница = Элементы.ГруппаЖурнал;
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ОбщаяГруппа.ТекущаяСтраница = Элементы.ГруппаЖурнал Тогда
		Элементы.СписокЗакладки.Пометка = ФлагЗакладки;
	Иначе
		Если Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаПоступление Тогда
			Элементы.ПоступленияЗакладки.Пометка = ФлагЗакладки;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаПеремещение Тогда
			Элементы.ПеремещенияЗакладки.Пометка = ФлагЗакладки;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаСписание Тогда
			Элементы.СписанияЗакладки.Пометка = ФлагЗакладки;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаСборкаКомплектация Тогда
			Элементы.СборкаКомплектацияЗакладки.Пометка = ФлагЗакладки;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаРазбиениеКомплектации Тогда
			Элементы.РазбиениеКомплектацииЗакладки.Пометка = ФлагЗакладки;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаИнвентаризация Тогда
			Элементы.ИнвентаризацияЗакладки.Пометка = ФлагЗакладки;			
		КонецЕсли;
	КонецЕсли;	
	
	Если Элементы.ОбщаяГруппа.ТекущаяСтраница = Элементы.ГруппаЖурнал Тогда
		Элементы.СписокВидимостьОтбора.Пометка = ФлагВидимостьОтбора;
		Если Элементы.ГруппаСписокОтбор.Видимость <> ФлагВидимостьОтбора Тогда
        	Элементы.ГруппаСписокОтбор.Видимость = ФлагВидимостьОтбора;
		КонецЕсли;
	Иначе
		Если Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаПоступление Тогда
			Элементы.ПоступленияВидимостьОтбора.Пометка = ФлагВидимостьОтбора;
			Если Элементы.ГруппаПоступленияОтбор.Видимость <> ФлагВидимостьОтбора Тогда
				Элементы.ГруппаПоступленияОтбор.Видимость = ФлагВидимостьОтбора;
			КонецЕсли;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаПеремещение Тогда
			Элементы.ПеремещенияВидимостьОтбора.Пометка = ФлагВидимостьОтбора;
			Если Элементы.ГруппаПеремещенияОтбор.Видимость <> ФлагВидимостьОтбора Тогда
				Элементы.ГруппаПеремещенияОтбор.Видимость = ФлагВидимостьОтбора;
			КонецЕсли;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаСписание Тогда
			Элементы.СписанияВидимостьОтбора.Пометка = ФлагВидимостьОтбора;
			Если Элементы.ГруппаСписанияОтбор.Видимость <> ФлагВидимостьОтбора Тогда
				Элементы.ГруппаСписанияОтбор.Видимость = ФлагВидимостьОтбора;
			КонецЕсли;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаСборкаКомплектация Тогда
			Элементы.СборкаКомплектацияВидимостьОтбора.Пометка = ФлагВидимостьОтбора;
			Если Элементы.ГруппаСборкаКомплектацияОтбор.Видимость <> ФлагВидимостьОтбора Тогда
				Элементы.ГруппаСборкаКомплектацияОтбор.Видимость = ФлагВидимостьОтбора;
			КонецЕсли;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаРазбиениеКомплектации Тогда
			Элементы.РазбиениеКомплектацииВидимостьОтбора.Пометка = ФлагВидимостьОтбора;
			Если Элементы.ГруппаРазбиениеКомплектацииОтбор.Видимость <> ФлагВидимостьОтбора Тогда
				Элементы.ГруппаРазбиениеКомплектацииОтбор.Видимость = ФлагВидимостьОтбора;
			КонецЕсли;
		ИначеЕсли Элементы.ПоДокументам.ТекущаяСтраница = Элементы.ГруппаИнвентаризация Тогда
			Элементы.ИнвентаризацияВидимостьОтбора.Пометка = ФлагВидимостьОтбора;
			Если Элементы.ГруппаИнвентаризацияОтбор.Видимость <> ФлагВидимостьОтбора Тогда
				Элементы.ГруппаИнвентаризацияОтбор.Видимость = ФлагВидимостьОтбора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти