#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьВидыПервичныхДокументовПриПервоначальномЗаполнении() Экспорт
	
	// Описываем стуктуру.
	Таблица = Новый ТаблицаЗначений;	
	Таблица.Колонки.Добавить("Наименование");
	Таблица.Колонки.Добавить("ТипДокумента");
	
	ТипДокумента = Перечисления.ТипыПервичныхДокументов;
	
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Акт'"), ТипДокумента.Акт);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Договор'"), ТипДокумента.Договор);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Дополнительное соглашение'"), 
		ТипДокумента.ДополнительноеСоглашение);
		
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Накладная'"), ТипДокумента.Накладная);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Соглашение о конфиденциальности'"), 
		ТипДокумента.СоглашениеОКонфиденциальности);
		
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Спецификация'"), ТипДокумента.Спецификация);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Счет'"), ТипДокумента.Счет);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Счет - фактура'"), ТипДокумента.СчетФактура);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'УПД'"), ТипДокумента.УниверсальныйПередаточныйДокумент);
	
	// Записываем.
	Для Каждого Строки Из Таблица Цикл
		Объект = Справочники.ВидыПервичныхДокументов.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Записать();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет в таблицу значений данные по заполняемым объектам.
//
// Параметры:
//   ТЗ 	- ТаблицаЗначений - таблица, куда надо добавить.
//	 Наименование - Строка - наименование элемента.
//	 ТипДокумента - ПеречислениеСсылка.ТипыПервичныхДокументов - тип элемента.
//
Процедура ДобавитьВТаблицуЗначений(Таблица, Наименование, ТипДокумента)
	
	НоваяСтрока 				= Таблица.Добавить();	
	НоваяСтрока.Наименование 	= Наименование;
	НоваяСтрока.ТипДокумента 	= ТипДокумента;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли