
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("МассоваяГенерацияПаролей") Тогда
		Элементы.ГруппаПароль.Видимость = Параметры.МассоваяГенерацияПаролей = Ложь;
	КонецЕсли;
	
	Объект.КоличествоСимволов 				= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_КоличествоСимволовПаролейПоУмолчанию");
	Объект.ВключатьЦифры 					= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьЦифры");
	Объект.ВключатьМаленькиеЛатинскиеБуквы	= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьМаленькиеЛатинскиеБуквы");
	Объект.ВключатьБольшиеЛатинскиеБуквы	= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьБольшиеЛатинскиеБуквы");
	Объект.ВключатьМаленькиеРусскиеБуквы	= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьМаленькиеРусскиеБуквы");
	Объект.ВключатьБольшиеРусскиеБуквы		= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьБольшиеРусскиеБуквы");
	Объект.ВключатьДругиеСимволы			= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьДругиеСимволы");
	
	Если Объект.КоличествоСимволов = 0 Тогда
		
		Объект.КоличествоСимволов = 6;
		
	КонецЕсли;
	
	Если НЕ (Объект.ВключатьБольшиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьБольшиеРусскиеБуквы 
		ИЛИ Объект.ВключатьДругиеСимволы 
		ИЛИ Объект.ВключатьМаленькиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьМаленькиеРусскиеБуквы 
		ИЛИ Объект.ВключатьЦифры) Тогда
		
		Объект.ВключатьЦифры = Истина;
		
	КонецЕсли;
		
	Если НЕ (Объект.ВключатьЦифры 
		ИЛИ Объект.ВключатьМаленькиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьБольшиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьМаленькиеРусскиеБуквы 
		ИЛИ Объект.ВключатьБольшиеРусскиеБуквы 
		ИЛИ Объект.ВключатьДругиеСимволы) Тогда
		
		Объект.ВключатьЦифры = Истина;
		
	КонецЕсли;
	
	СформироватьПароль();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПароль(Команда)
	
	СформироватьПароль();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Структура = Новый Структура();
	Структура.Вставить("Пароль", 							Объект.Пароль);
	Структура.Вставить("ВключатьЦифры", 					Объект.ВключатьЦифры);
	Структура.Вставить("ВключатьМаленькиеЛатинскиеБуквы", 	Объект.ВключатьМаленькиеЛатинскиеБуквы);
	Структура.Вставить("ВключатьБольшиеЛатинскиеБуквы", 	Объект.ВключатьБольшиеЛатинскиеБуквы);
	Структура.Вставить("ВключатьМаленькиеРусскиеБуквы", 	Объект.ВключатьМаленькиеРусскиеБуквы);
	Структура.Вставить("ВключатьБольшиеРусскиеБуквы", 		Объект.ВключатьБольшиеРусскиеБуквы);
	Структура.Вставить("ВключатьДругиеСимволы", 			Объект.ВключатьДругиеСимволы);
	Структура.Вставить("КоличествоСимволов", 				Объект.КоличествоСимволов);
	
	Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьПароль()
	
	Объект.Пароль = УправлениеITОтделом8УФ.СформироватьПароль(Объект);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_КоличествоСимволовПаролейПоУмолчанию",,Объект.КоличествоСимволов);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьЦифры", ,Объект.ВключатьЦифры);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьМаленькиеЛатинскиеБуквы", ,
		Объект.ВключатьМаленькиеЛатинскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьБольшиеЛатинскиеБуквы", ,Объект.ВключатьБольшиеЛатинскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьМаленькиеРусскиеБуквы", ,Объект.ВключатьМаленькиеРусскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьБольшиеРусскиеБуквы", ,Объект.ВключатьБольшиеРусскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьДругиеСимволы", ,Объект.ВключатьДругиеСимволы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_КоличествоСимволовПаролейПоУмолчанию", ,Объект.КоличествоСимволов);
	
КонецПроцедуры

#КонецОбласти