
Функция ПолучитьПеременную(ИмяПредопределенныхДанных) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РС_Переменные.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	Справочник.РС_Переменные КАК РС_Переменные
		|ГДЕ
		|	РС_Переменные.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных
		|
	//04.02.2021, Тарасов Михаил: не вижу причины ограничиваться только предопределенными элементами.
	//Корректнее будет обрабатывать и переменные, добавленные в предприятии (без монопольных изменений),
	//с приоритетом по предопределенному имени по объединению
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РС_Переменные.СсылкаНаОбъект
		|ИЗ
		|	Справочник.РС_Переменные КАК РС_Переменные
		|ГДЕ
		|	РС_Переменные.Наименование = &ИмяПредопределенныхДанных");
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенныхДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.СсылкаНаОбъект;
	
КонецФункции