
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Массив = Новый Массив;
	Массив.Добавить(ПараметрКоманды);
	
	СтруктураОтветственный = Новый Структура("Проект", ПараметрКоманды);
	ПараметрыОткрытия = Новый Структура("КлючНазначенияИспользования, Отбор, СформироватьПриОткрытии",
		Массив, СтруктураОтветственный, Истина);
	
	ОткрытьФорму("Отчет.СписокЗаданий.Форма", ПараметрыОткрытия,, "Проект=" + ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти