#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСвязь(Знач РодительСсылка, Знач ПодчиненныйСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РодительСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи 			= РегистрыСведений.СвязьКомментариев.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьСвязь(Знач РодительСсылка, Знач ПодчиненныйСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи 			= РегистрыСведений.СвязьКомментариев.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
